[{"title":"Marketing in a Digital World","about":"This course examines how digital tools, such as the Internet, smartphones, and 3D printing, are revolutionizing the world of marketing by shifting the balance of power from firms to consumers. Marketing in a Digital World is one of the most popular courses on Coursera with over 150,000 Learners and is rated by Class Central as one of the Top 50 MOOCs of All Time (https://www.class-central.com/report/top-moocs/).\n\nThis course is part of the iMBA offered by the University of Illinois, a flexible, fully-accredited online MBA at an incredibly competitive price. For more information, please see the Resource page in this course and onlinemba.illinois.edu.","tutor":"Aric Rindfleisch","provider":"Coursera","language":"English","skills":["usa","north america"],"subject":"Marketing","studentsInterested":"19.3k","courseLink":"https://www.coursera.org/learn/marketing-digital","classCentralLink":"https://www.class-central.com/course/coursera-marketing-in-a-digital-world-2750"},{"title":"Introduction to Marketing","about":"Taught by three of Wharton\u0027s top faculty in the marketing department, consistently ranked as the #1 marketing department in the world, this course covers three core topics in customer loyalty: branding, customer centricity, and practical, go-to-market strategies.\n\nYou’ll learn key principles in\n\n- Branding: brand equity is one of the key elements of keeping customers in a dynamic world in which new startups are emerging constantly.\n- Customer centricity: not synonymous with customer service, customer centricity starts with customer focus and need-gathering.\n- Go-to-market strategies: understand the drivers that influence customers and see how these are implemented prior to making an investment.\n\nComplete this course as part of Wharton\u0027s Business Foundations Specialization, and you\u0027ll have the opportunity to take the Capstone Project and prepare a strategic analysis and proposed solution to a real business challenge from Wharton-governed companies like Shazam and SnapDeal or to a challenge faced by your own company or organization. Wharton-trained staff will evaluate the top submissions, and leadership teams at Shazam and SnapDeal will review the highest scoring projects prepared for their companies.","tutor":"David Bell, Peter Fader and Barbara Kahn","provider":"Coursera","language":"English","skills":["usa","north america"],"subject":"Marketing","studentsInterested":"10.4k","courseLink":"https://www.coursera.org/learn/wharton-marketing","classCentralLink":"https://www.class-central.com/course/coursera-introduction-to-marketing-1137"},{"title":"Introduction to Financial Accounting","about":"Master the technical skills needed to analyze financial statements and disclosures for use in financial analysis, and learn how accounting standards and managerial incentives affect the financial reporting process. By the end of this course, you’ll be able to read the three most common financial statements: the income statement, balance sheet, and statement of cash flows. Then you can apply these skills to a real-world business challenge as part of the Wharton Business Foundations Specialization.","tutor":"Brian J Bushee","provider":"Coursera","language":"English","skills":["usa","north america"],"subject":"Accounting","studentsInterested":"9.1k","courseLink":"https://www.coursera.org/learn/wharton-accounting","classCentralLink":"https://www.class-central.com/course/coursera-introduction-to-financial-accounting-769"},{"title":"Developing Innovative Ideas for New Companies: The First Step in Entrepreneurship","about":"This course assists aspiring and active entrepreneurs in developing great ideas into great companies. With strong economies presenting rich opportunities for new venture creation, and challenging economic times presenting the necessity for many to make their own job, the need to develop the skills to develop and act on innovative business opportunities is increasingly vital.\n\nUsing proven content, methods, and models for new venture opportunity assessment and analysis, you will learn how to:\n\n* Identify and analyze entrepreneurial opportunities;\n* Enhance your entrepreneurial mindset;\n* Improve your strategic decision-making; and\n* Build innovative business models.\n\nOur goal is to demystify the startup process, and to help you build the skills to identify and act on innovative opportunities now, and in the future.\n\nWith this course, students experience a sampling of the ideas and techniques explored in the University of Maryland\u0027s master\u0027s degree in technology entrepreneurship, an innovative, 100% online program. Learn more at http://mte.umd.edu/landing.","tutor":"James Green","provider":"Coursera","language":"English","skills":["innovation","entreprenuership","usa","north america"],"subject":"Entrepreneurship","studentsInterested":"3k","courseLink":"https://www.coursera.org/learn/innovative-ideas","classCentralLink":"https://www.class-central.com/course/coursera-developing-innovative-ideas-for-new-companies-the-first-step-in-entrepreneurship-840"},{"title":"Digital Analytics for Marketing Professionals: Marketing Analytics in Theory","about":"Learn the introductory theory and strategy behind marketing analytics that provides marketers with the foundation needed to apply data analytics to real-world challenges they confront daily in their professional lives.\n\nThis course is part of the iMBA offered by the University of Illinois, a flexible, fully-accredited online MBA at an incredibly competitive price. For more information, please see the Resource page in this course and onlinemba.illinois.edu.","tutor":"Kevin Hartman","provider":"Coursera","language":"English","skills":["usa","north america"],"subject":"Marketing","studentsInterested":"2.5k","courseLink":"https://www.coursera.org/learn/marketing-analytics","classCentralLink":"https://www.class-central.com/course/coursera-digital-analytics-for-marketing-professionals-marketing-analytics-in-theory-2753"},{"title":"Computational Investing, Part I","about":"Why do the prices of some companies’ stocks seem to move up and down together while others move separately? What does portfolio “diversification” really mean and how important is it? What should the price of a stock be? How can we discover and exploit the relationships between equity prices automatically? We’ll examine these questions, and others, from a computational point of view. You will learn many of the principles and algorithms that hedge funds and investment professionals use to maximize return and reduce risk in equity portfolios.","tutor":"Tucker Balch","provider":"Coursera","language":"English","skills":["python","usa","north america"],"subject":"Finance","studentsInterested":"301","courseLink":"https://www.coursera.org/learn/computational-investing","classCentralLink":"https://www.class-central.com/course/coursera-computational-investing-part-i-406"},{"title":"Critical Perspectives on Management","about":"This course is designed for students of all backgrounds who have an interest in how firms are governed, the forces that have helped define modern management practice, and the outcomes of that practice not only for the firm itself, but also for the societies in which they operate. For students who are thinking of a career in management, it may also prove useful as a basic introduction to some of the conceptual vocabulary and ideas behind modern theories of management.\n\nUsing a wide disciplinary approach - from economics and history to social theory and even a smattering of biblical criticism - the course will invite students to consider several core management strategies and priorities from often unexpected perspectives in order to judge their success or failure. The key objective of the course is to bring into critical focus how we think about the function and culture of management, how managers understand their role within a firm, how they take decisions, set priorities and benchmark success and failure.\n\nTopics include: the function of the firm; the role of incentive; the ways in which narrative forces shape decision making, and how market relationships define the managerial culture in ways that can lead to sub-optimal outcomes.","tutor":"Rolf Strom-Olsen","provider":"Coursera","language":"English","skills":["spain","europe"],"subject":"Management \u0026 Leadership","studentsInterested":"5.6k","courseLink":"https://www.coursera.org/learn/critical-management","classCentralLink":"https://www.class-central.com/course/coursera-critical-perspectives-on-management-714"},{"title":"Introduction to Operations Management","about":"Learn to analyze and improve business processes in services or in manufacturing by learning how to increase productivity and deliver higher quality standards. Key concepts include process analysis, bottlenecks, flows rates, and inventory levels, and more. After successfully completing this course, you can apply these skills to a real-world business challenge as part of the Wharton Business Foundations Specialization.","tutor":"Christian Terwiesch","provider":"Coursera","language":"English","skills":["usa","north america"],"subject":"Strategic Management","studentsInterested":"2.6k","courseLink":"https://www.coursera.org/learn/wharton-operations","classCentralLink":"https://www.class-central.com/course/coursera-introduction-to-operations-management-372"},{"title":"Preparing to Manage Human Resources","about":"One way or another, all employees are managed. But approaches to managing employees varying from employee-to-employee, job-to-job, manager-to-manager, organization-to-organization, and country-to-country. This course provides a foundation for developing your own approach to skillfully managing employees by illustrating alternative human resource management (HRM) strategies, introducing the importance of the legal context, and thinking about what motivates employees. This will then give you the factual and conceptual basis for developing specific, critical HRM skills in subsequent courses on hiring employees, managing performance, and rewarding employees. Don\u0027t know anything about HRM? That\u0027s OK! Leave this course with a new-found understanding of the range of options available for managing employees, a grasp of what makes workers tick, and the readiness to develop your own HRM skills.","tutor":"John W. Budd","provider":"Coursera","language":"English","skills":["human resources","hrm","hrm strategies","usa","north america"],"subject":"Human Resources","studentsInterested":"8.9k","courseLink":"https://www.coursera.org/learn/managing-human-resources","classCentralLink":"https://www.class-central.com/course/coursera-preparing-to-manage-human-resources-5462"},{"title":"Estadística Aplicada a los Negocios","about":"Este curso proporciona una introducción al análisis de datos en base a las principales herramientas estadísticas, enfocándose en la estadística descriptiva y la estadística inferencial.\nSe estudian los diferentes tipos de gráficos estadísticos utilizados para describir el comportamiento de los datos. El curso de estadística aplicada presenta la definición de una variable aleatoria, funciones de densidad de probabilidad, de distribución acumulativa; también se presentan las variables aleatorias para el caso continuo y estimación con intervalos de confianza, finalizando con una introducción a los modelos econométricos.","tutor":"Jorge Samayoa","provider":"edX","language":"Spanish","skills":["galileox"],"subject":"Statistics \u0026 Probability","studentsInterested":"14","courseLink":"https://www.edx.org/course/estadistica-aplicada-los-negocios-galileox-pcpsta01x","classCentralLink":"https://www.class-central.com/course/edx-estadistica-aplicada-a-los-negocios-10270"},{"title":"Fundamentals of Project Planning and Management","about":"Projects are all around us. Virtually every organization runs projects, either formally or informally. We are engaged in projects at home and at work. Across settings, planning principles and execution methodologies can offer ways in which projects can be run more effectively and efficiently. Project management provides organizations (and individuals) with the language and the frameworks for scoping projects, sequencing activities, utilizing resources, and minimizing risks.\n\nThis is an introductory course on the key concepts of planning and executing projects. We will identify factors that lead to project success, and learn how to plan, analyze, and manage projects. Learners will be exposed to state-of-the-art methodologies and to considering the challenges of various types of projects.\n\nAs a Project Management Institute (PMI®) Registered Education Provider, the University of Virginia Darden School of Business has been approved by PMI to issue 12 professional development units (PDUs) for this course, which focuses on core competencies recognized by PMI. (Provider #2122)","tutor":"Yael Grushka-Cockayne","provider":"Coursera","language":"English","skills":["usa","north america"],"subject":"Project Management","studentsInterested":"1.9k","courseLink":"https://www.coursera.org/learn/uva-darden-project-management","classCentralLink":"https://www.class-central.com/course/coursera-fundamentals-of-project-planning-and-management-3292"},{"title":"Financial Markets","about":"An overview of the ideas, methods, and institutions that permit human society to manage risks and foster enterprise. Emphasis on financially-savvy leadership skills. Description of practices today and analysis of prospects for the future. Introduction to risk management and behavioral finance principles to understand the real-world functioning of securities, insurance, and banking industries. The ultimate goal of this course is using such industries effectively and towards a better society.","tutor":"Bob Shiller","provider":"Coursera","language":"English","skills":["usa","north america"],"subject":"Finance","studentsInterested":"4.3k","courseLink":"https://www.coursera.org/learn/financial-markets-global","classCentralLink":"https://www.class-central.com/course/coursera-financial-markets-912"},{"title":"Foundations of Business Strategy","about":"Develop your ability to think strategically, analyze the competitive environment, and recommend firm positioning and value creation. In this course, we will explore the underlying theory and frameworks that provide the foundations of a successful business strategy and provide the tools you need to understand that strategy: SWOT, Competitor, Environmental, Five Forces, and Capabilities Analyses, as well as Strategy Maps. We\u0027ll apply these tools in case studies of industry leaders Google, Redhook, Piaggio and Apple.","tutor":"Michael J. Lenox","provider":"Coursera","language":"English","skills":["usa","north america"],"subject":"Strategic Management","studentsInterested":"994","courseLink":"https://www.coursera.org/learn/uva-darden-foundations-business-strategy","classCentralLink":"https://www.class-central.com/course/coursera-foundations-of-business-strategy-546"},{"title":"Competitive Strategy","about":"In this six-module course, you will learn how businesses and organizations behave in situations in which strategic decisions are interdependent, i.e. where my actions affect my competitors\u0027 profits and vice versa. Using the basic tools of game theory, we will analyse how businesses choose strategies to attain competitive advantage.\n\nThis course is also available in Chinese. Please go to our course catalog to access the Chinese version of Competitive Strategy.","tutor":"Tobias Kretschmer","provider":"Coursera","language":"English","skills":["europe","germany"],"subject":"Strategic Management","studentsInterested":"9.2k","courseLink":"https://www.coursera.org/learn/competitive-strategy","classCentralLink":"https://www.class-central.com/course/coursera-competitive-strategy-706"},{"title":"Initiating and Planning Projects","about":"The courses in the Introduction to Project Management Principles and Practices Specialization are a recommended precursor to UCI\u0027s Applied Project Management Certificate.\n\nSuccessful projects require careful upfront planning. In this course, you’ll learn the key roles and responsibilities of the project manager and project team. You’ll also learn to answer some key questions upfront to help you meet project objectives: What will this project accomplish? Why is this project important? Who benefits from this project? How will we plan for successful outcomes?\n\nUpon completing this course, you will be able to:\n1. Identify the key characteristics of a project\n2. Identify primary project constraints\n3. Define the role and responsibilities of the project manager\n4. Identify Project Organizational Structures\n5. Understand the definition of a Project Stakeholder\n6. Identify project stakeholders\n7. Identify information needs of the project stakeholders\n8. Define responsibility for managing stakeholder and controlling stakeholder engagement\n9. Define the purpose of using a project charter\n10. Summarize the key elements of a project plan\n11. Identify common sources of conflict within a project environment\n12. Describe the difference between authority and influence","tutor":"Margaret Meloni","provider":"Coursera","language":"English","skills":["usa","north america"],"subject":"Management \u0026 Leadership","studentsInterested":"3.0k","courseLink":"https://www.coursera.org/learn/project-planning","classCentralLink":"https://www.class-central.com/course/coursera-initiating-and-planning-projects-2728"},{"title":"Inspiring Leadership through Emotional Intelligence","about":"Emotional intelligence, hope, mindfulness, and compassion help a person reverse the damage of chronic stress and build great leadership relationships. The Positive and Negative Emotional Attractors inspire sustained, desired change and learning at many levels.","tutor":"Richard Boyatzis","provider":"Coursera","language":"English","skills":["leadership","emotional intelligence","usa","north america"],"subject":"Management \u0026 Leadership","studentsInterested":"6.1k","courseLink":"https://www.coursera.org/learn/emotional-intelligence-leadership","classCentralLink":"https://www.class-central.com/course/coursera-inspiring-leadership-through-emotional-intelligence-710"},{"title":"Business Strategy","about":"In this course you will learn how organizations create, capture, and maintain value, and how it is fundamental for sustainable competitive advantage. You will be able to better understand value creation and capture, and learn the tools to analyze both competition and cooperation from a variety of perspectives, including the industry level (e.g., five forces analysis), and the firm level (e.g., business models and strategic positioning).\n\n• Understand how managers coordinate different functional areas, resources, and systems inside a company and align them with the external environment to enhance overall performance\n• Knowledge of strategic management tools and frameworks, and apply them to real business contexts Process diverse business and industry information to diagnose strategic issues, evaluate strategic alternatives, and formulate a coherent and actionable strategic plan\n• How to think like a CEO, entrepreneur, or general manager.\n\nThis course is part of the iMBA offered by the University of Illinois, a flexible, fully-accredited online MBA at an incredibly competitive price. For more information, please see the Resource page in this course and onlinemba.illinois.edu.","tutor":"Deepak Somaya","provider":"Coursera","language":"English","skills":["competitive strategy","usa","north america"],"subject":"Strategic Management","studentsInterested":"11.9k","courseLink":"https://www.coursera.org/learn/strategy-business","classCentralLink":"https://www.class-central.com/course/coursera-business-strategy-5242"},{"title":"How to Build a Startup","about":"In an introduction to the basics of the famous Customer Development Process, Steve Blank provides insight into the key steps needed to build a successful startup.\nThe main idea in this course is learning how to rapidly develop and test ideas by gathering massive amounts of customer and marketplace feedback. Many startups fail by not validating their ideas early on with real-life customers. In order to mitigate that, students will learn how to get out of the building and search for the real pain points and unmet needs of customers. Only with these can the entrepreneur find a proper solution and establish a suitable business model.\nBuilding a startup is not simply building an execution plan for a business model that the entrepreneur thinks will work, but rather, a search for the actual business model itself.\n\n\nWhy Take This Course?\nYou will learn the business skills it takes to bring your idea from conception to market. These include:\nActively listening and engaging your customers to find out what exactly they want in your product and how you should deliver it to them\nGathering, evaluating and using customer feedback to make your product, marketing, and business model stronger","tutor":"Steve Blank","provider":"Udacity","language":"English","skills":["entrepreneurship","startups","customer development"],"subject":"Entrepreneurship","studentsInterested":"14.6k","courseLink":"https://www.udacity.com/course/how-to-build-a-startup--ep245","classCentralLink":"https://www.class-central.com/course/udacity-how-to-build-a-startup-461"},{"title":"Becoming a changemaker: Introduction to Social Innovation","about":"This free 6 week course is for anyone who wants to make a difference. Whether you are already familiar with the field of social innovation or social entrepreneurship, working for an organization that wants to increase its social impact, or just starting out, this course will take you on a journey of exploring the complex problems that surround us and how to start thinking about solutions.\n\nWe will debunk common assumptions around what resources are needed to begin acting as a social innovator. We will learn from the numerous examples of social innovations happening all over the world. You will be challenged to get out of your comfort zone and start engaging with the diverse spaces around you. By the end of the course, you will have formed your own approach to social innovation, and you will have begun to develop the concepts, mindset, skills, and relationships that will enable you to start and evolve as a changemaker.\n\nYou will be able to purchase a Verified Certificate if you wish to show evidence of your achievements, but this is optional, and you may apply for Financial Aid if you are unable to pay the certificate fee.\n\nThe Bertha Centre for Social Innovation and Entrepreneurship co-created this course with RLabs, a social movement ‘born-and-bred’ in Bridgetown, Cape Town that is now active in 22 countries. The movement empowers youth through innovative and disruptive technology by teaching them vital skills and providing much needed support and a sense of community. Advocating and supporting initiatives such as RLabs forms part of the Bertha Centre’s mandate. The Centre is a specialised unit at University of Cape Town’s Graduate School of Business, and is the first academic centre in Africa dedicated to advancing social innovation and entrepreneurship.\n\nYou can view the course trailer at www.youtube.com/watch?v\u003dTcWYG64WO20\nTweet about this course using the hashtag #socinnMOOC","tutor":"François Bonnici and Warren Nilsson","provider":"Coursera","language":"English","skills":["entrepreneurship","innovation","africa","social impact","south africa"],"subject":"Entrepreneurship","studentsInterested":"13.7k","courseLink":"https://www.coursera.org/learn/social-innovation","classCentralLink":"https://www.class-central.com/course/coursera-becoming-a-changemaker-introduction-to-social-innovation-6655"},{"title":"Customer Analytics","about":"Data about our browsing and buying patterns are everywhere. From credit card transactions and online shopping carts, to customer loyalty programs and user-generated ratings/reviews, there is a staggering amount of data that can be used to describe our past buying behaviors, predict future ones, and prescribe new ways to influence future purchasing decisions. In this course, four of Wharton’s top marketing professors will provide an overview of key areas of customer analytics: descriptive analytics, predictive analytics, prescriptive analytics, and their application to real-world business practices including Amazon, Google, and Starbucks to name a few. This course provides an overview of the field of analytics so that you can make informed business decisions. It is an introduction to the theory of customer analytics, and is not intended to prepare learners to perform customer analytics.\n\nCourse Learning Outcomes:\n\nAfter completing the course learners will be able to...\n\nDescribe the major methods of customer data collection used by companies and understand how this data can inform business decisions\n\nDescribe the main tools used to predict customer behavior and identify the appropriate uses for each tool\n\nCommunicate key ideas about customer analytics and how the field informs business decisions\n\nCommunicate the history of customer analytics and latest best practices at top firms","tutor":"Eric Bradlow, Peter Fader, Raghu Iyengar and Ron Berman","provider":"Coursera","language":"English","skills":["predictive analytics","customer analytics","usa","north america"],"subject":"Business Intelligence","studentsInterested":"671","courseLink":"https://www.coursera.org/learn/wharton-customer-analytics","classCentralLink":"https://www.class-central.com/course/coursera-customer-analytics-4353"},{"title":"Viral Marketing and How to Craft Contagious Content","about":"Ever wondered why some things become popular, and other don\u0027t? Why some products becomes hits while others flop? Why some ideas take off while others languish? What are the key ideas behind viral marketing? This course explains how things catch on and helps you apply these ideas to be more effective at marketing your ideas, brands, or products. You\u0027ll learn how to make ideas stick, how to increase your influence, how to generate more word of mouth, and how to use the power of social networks to spread information and influence. Drawing on principles from his best-selling book, \"Contagious: Why Things Catch On,\" Professor Jonah Berger illustrates successful strategies for you to use buzz to create virality so that your campaigns become more shareable on social media and elsewhere. By the end of this course, you\u0027ll have a better understanding of how to craft contagious content, build stickier messages, and get any product, idea, or behavior to catch on.","tutor":"Jonah Berger","provider":"Coursera","language":"English","skills":["product development","viral marketing","usa","north america"],"subject":"Marketing","studentsInterested":"2.0k","courseLink":"https://www.coursera.org/learn/wharton-contagious-viral-marketing","classCentralLink":"https://www.class-central.com/course/coursera-viral-marketing-and-how-to-craft-contagious-content-5034"},{"title":"Introduction to Corporate Finance","about":"This course provides a brief introduction to the fundamentals of finance, emphasizing their application to a wide variety of real-world situations spanning personal finance, corporate decision-making, and financial intermediation. Key concepts and applications include: time value of money, risk-return tradeoff, cost of capital, interest rates, retirement savings, mortgage financing, auto leasing, capital budgeting, asset valuation, discounted cash flow (DCF) analysis, net present value, internal rate of return, hurdle rate, payback period.","tutor":"Franklin Allen","provider":"Coursera","language":"English","skills":["usa","north america"],"subject":"Finance","studentsInterested":"4.9k","courseLink":"https://www.coursera.org/learn/wharton-finance","classCentralLink":"https://www.class-central.com/course/coursera-introduction-to-corporate-finance-625"},{"title":"On Strategy : What Managers Can Learn from Philosophy - PART 1","about":"In the expression “creative thinking”, the keyword is not creativity; the keyword is thinking. With the help of great philosophers, you will rediscover the art of thinking.\n\nTo help leaders to be rigorous even without figures, great philosophers have lots of ideas. Managers are invited to rediscover the art of thinking. They should understand the role of mental models, realize the importance of cognitive bias, agree on clear definitions and efficient criteria etc.\n\nCreativity demands the ability to unshackle ourselves from conventional ways of thinking, to \"think outside the box\". But we need to go a step further. Once outside the box, we need to construct a new box or boxes (that is, new intellectual frameworks or models) to help us structure our thinking. Only once we have done so can we generate truly game-changing ideas.","tutor":"Luc de Brabandere","provider":"Coursera","language":"English","skills":["europe","france"],"subject":"Management \u0026 Leadership","studentsInterested":"4.6k","courseLink":"https://www.coursera.org/learn/management-philosophy","classCentralLink":"https://www.class-central.com/course/coursera-on-strategy-what-managers-can-learn-from-philosophy-part-1-1312"},{"title":"Project Management for Business Professionals","about":"This course provides an introduction to the concepts, techniques, and principles of project management. Primary emphasis will be on learning the project management process outlined in the Project Management Institute\u0027s PMBOK Guide (Project Management Body of Knowledge Guide). Agile, extreme, and other variations of project management will be discussed and their key features related to the PMBOK Guide.\nUpon completion of the course students will be able to plan, schedule, budget, estimate, control, and monitor projects. In addition, they will become familiar with resource allocation, resource loading and the creation and use of GANTT and PERT charts.\nPurchase of the PMBOK Guide for use as a text is optional. For those wanting to use this course to support new or continuing certification by the Project Management Institute (PMI), purchasing the text is recommended. A certificate and supporting documentation is available for a fee upon completion of this course. This certificate can be used to meet professional development requirements for the PMI’s Project Management Professional (PMP) certification.","tutor":"Peter von Stackelberg","provider":"Canvas Network","language":"English","skills":[],"subject":"Project Management","studentsInterested":"9.4k","courseLink":"https://http://www.canvas.net/browse/jerichohill/courses/project-management-business-professionals","classCentralLink":"https://www.class-central.com/course/canvas-network-project-management-for-business-professionals-962"},{"title":"International Leadership and Organizational Behavior","about":"Leaders in business and non-profit organizations increasingly work across national borders and in multi-cultural environments. You may work regularly with customers or suppliers abroad, or be part of a globally dispersed cross-functional team, or an expatriate manager on an international assignment. You may be a member of a global online community, or a development aid worker collaborating with an international network of partner organizations. In all of these contexts, your effectiveness as a leader depends on how well you understand and are able to manage individual and collective behaviors in an intercultural context.\n\nIn this course – together with a team of Bocconi expert faculty and Bocconi alumni – we’ll explore the theory and practice of international and intercultural leadership and organizational behavior. Social science research has revealed systematic ways in which our behavior differs across cultural contexts – enabling us to more effectively work across borders. Insights from psychology, neuroscience, sociology and anthropology, from communication studies and from management scholarship allow us to understand what shapes individual and group decision making, what enhances or weakens team performance, and how we can build and use our social networks. And the shared practical experience of international leaders allows us to identify concrete steps to enhancing intercultural leadership competence, and to be cognizant of common leadership challenges.\n\nLearning about organizational behavior provides a great opportunity to develop your leadership skills and to reflect on your own behavioral tendencies. How do you usually make important decisions? What motivates you and how do you try motivating others? How successfully do you leverage and integrate diverse skills and views in a team? Do you prefer professional relationships with a close-knit group of trusted colleagues, or with a far-flung network of acquaintances from all walks of life?\n\nIf you really want to learn how organizations behave and take decisions and at the same time develop leadership skills, then this is the course for you.\n\nWe are looking forward to welcoming you and supporting you on this journey of learning and discovery.\n\nCOURSE SYLLABUS\nWeek 1 - Leadership Acumen. International perspective on leadership, common traps \u0026 challenges, and opportunities of intercultural leadership.\nWeek 2 - Navigating Culture. Impact of cultural differences on organizations, decoding culture, culture classifications and stereotyping, developing intercultural intelligence.\nWeek 3 - Communication. Communication and its impact on leadership identity and relationships, managing communication to improve decision making, steps for developing your intercultural communication skills.\nWeek 4 - Motivation. Views on individual motivation, cultural differences in motivation, developing motivation and commitment in teams.\nWeek 5 - Networking. Patterns of interpersonal relationships in/across organizations, strategically developing social networks and social capital, norms for networking across cultures.\nWeek 6 - Conflict. Effective / defective conflict management approaches, dealing with ethical dilemmas.\n\nThanks to the participation of our alumni and of the Bocconi Alumni Association, participants will have practical insights on international leadership.\n\nRECOMMENDED BACKGROUND\nAll are welcome! Some prior exposure to basic issues of organizational behavior (communication, decision making, motivation, etc.) is useful, but not required.","tutor":"Franz Wohlgezogen and Luigi Proserpio","provider":"Coursera","language":"English","skills":["europe","italy"],"subject":"Management \u0026 Leadership","studentsInterested":"764","courseLink":"https://www.coursera.org/learn/organizational-behavior","classCentralLink":"https://www.class-central.com/course/coursera-international-leadership-and-organizational-behavior-1371"},{"title":"What is Social?","about":"The “What Is Social?\" MOOC is for business owners, executives, and marketing professionals who want to significantly improve their abilities to grow their social strategy using effective, proven methodologies. This hands on, \"how to\" program won’t just tell you how to grow your professional persona using social – you will actually do it! This course is the first in the six-course specialization, Social Media Marketing: How to Profit in a Digital World.\n\nWhile the course can be audited for free, paid learners will receive additional content beyond the course basics. For MOOC 1, the toolkit includes a special video from Alessandro Acquisti on Big Data and a set of studies done by IBM on engagement and social marketing strategies with bottom-line profits.\n\nThis course has been designed to give you the tools, insights, knowledge, and skills to immediately impact your organization. In addition, we will help you network with thought leaders in social. After completing this course, you and your organization’s staff will be able to position, engage, and grow relationships with the consumers of highest value to you.\n\nToday, we are living in a period of massive disruption. New technologies are changing the way people engage with each other and with the organizations that interest them. This course will start you on the path to growing your own social strategy using effective, proven methodologies.\n\nAdditional MOOC 1 faculty include:\n* Judy Ungar Franks (President, The Marketing Democracy, Ltd. \u0026 Lecturer, Medill Integrated Marketing Communications, Northwestern)","tutor":"Randy Hlavac","provider":"Coursera","language":"English","skills":["social marketing","usa","north america"],"subject":"Marketing","studentsInterested":"1.9k","courseLink":"https://www.coursera.org/learn/what-is-social","classCentralLink":"https://www.class-central.com/course/coursera-what-is-social-4205"},{"title":"Budgeting and Scheduling Projects","about":"A good project schedule helps all team members’ work together to meet project objectives. A project budget with realistic cost constraints is also an essential bedrock of any project. In this course you’ll learn to plan and stick to time and cost constraints in order to ensure the success of your projects.\n\nUpon completing this course, you will be able to:\n1. Identify the resource needs of the project\n2. Decompose work packages into activities\n3. Define what is needed to estimate activity durations\n4. Define milestones and create a milestone schedule\n5. Determine the critical path and calculate float\n6. Describe the purpose of using leads and lags in a project schedule\n7. Estimate the quantities and costs of resources required to perform project activities\n8. Select one of three common cost estimating techniques to determine a project budget\n9. Use a responsibility assignment matrix to assign responsibilities\n10. Recognize the components of a project’s quality management plan","tutor":"Margaret Meloni","provider":"Coursera","language":"English","skills":["usa","north america"],"subject":"Project Management","studentsInterested":"6.8k","courseLink":"https://www.coursera.org/learn/schedule-projects","classCentralLink":"https://www.class-central.com/course/coursera-budgeting-and-scheduling-projects-2729"},{"title":"Principles of Project Management","about":"If you\u0027re looking to move into management, or want to gain some project management skills for your current role, this is the course for you. Learn to manage a project from start to finish, including popular standards and processes and how to manage stakeholders. Understand the role of a project manager and learn how to plan work and execute projects.\nWhat will I learn?\nWhat a project is, and how you can manage it, including:\nAn overview of popular Project Management methodologies and standards\nThe project life cycle: Concept, Develop, Execute and Finish\nNine areas every project manager should know\nThe main constraints projects often encounter\nThe benefits of Project Management\nWhat is involved in the concept phase, including:\nKey project roles, like the project manager, team and stakeholder\nSetting and justifying your goals","tutor":"Sue Dowson","provider":"Open2Study","language":"English","skills":["australia"],"subject":"Project Management","studentsInterested":"3.2k","courseLink":"https://www.open2study.com/courses/principles-of-project-management","classCentralLink":"https://www.class-central.com/course/open2study-principles-of-project-management-900"},{"title":"Leadership Toolkit for Managers","about":"Personal branding is critical for today’s executive—it distinguishes you as a competent authority, helps you establish your own goals for continuous improvement and development of your strengths as a business leader, and empowers you to lead change in your organization through effective management of yourself and others. If you’re looking to establish yourself in a leadership role and align your actions and behaviors with how you want to be perceived, this course is for you.\n\nThis course is composed of three modules: managing self, managing others, and leading efforts for change. You’ll complete a hands-on project on organizational change that tests your skills in a variety of simulated situations, and you’ll receive detailed feedback about your efforts. You’ll leave with a thorough understanding of how your leadership can make an impact on your organization—and a set of sharpened skills to help you accomplish your goals.\n\nYou’ll learn how to:\nManage teams and foster effective decision-making\nCreate and communicate a vision for workplace change\nBuild coalitions that work\nMaster the art of self-management\nDevelop and manage your executive personal brand\nImprove your executive presence online, in email and on voice mail\nBecome a more persuasive presenter\n\nMost of all, you’ll learn to develop your own unique strengths—and make more meaningful, authentic connections with others.","tutor":"Valérie Gauthier","provider":"Coursera","language":"English","skills":["leadership","europe","sr method","france"],"subject":"Management \u0026 Leadership","studentsInterested":"1.2k","courseLink":"https://www.coursera.org/learn/leadership","classCentralLink":"https://www.class-central.com/course/coursera-leadership-toolkit-for-managers-4209"},{"title":"Innovation for Powerful Outcomes","about":"Innovation involves transformative thinking and the genuine ability to cultivate and pick the lucrative fruits of our creative labour. In this course, you will develop an appreciation for a range of tools and concepts that can help make innovation happen.\nThis course will feature original content and fresh thinking. It contains a stimulating mix of creative experiments, intriguing innovation examples, practical tools and robust concepts. These will help you induce creativity, gain deep customer insights, and develop an appreciation for creating a compelling innovation strategy.\nWhat will I learn?\nInnovation in Practice\nThe practice and meaning of innovation\nSignature characteristics of innovative organisations\nProcesses of service and product innovation\nDifferent approaches for sourcing external ideas\nCreativity in Action\nAn understanding of how our creative minds work\nKey considerations and principles of creativity\nA range of creativity tools","tutor":"Dr Noordin Shehabuddeen","provider":"Open2Study","language":"English","skills":["australia"],"subject":"Entrepreneurship","studentsInterested":"8.0k","courseLink":"https://www.open2study.com/courses/innovation-for-powerful-outcomes","classCentralLink":"https://www.class-central.com/course/open2study-innovation-for-powerful-outcomes-1177"},{"title":"Innovation for Entrepreneurs: From Idea to Marketplace","about":"Develop insights on navigating the innovation process from idea generation to commercialization. Build knowledge on how to create strategies to bring innovations to market. Develop an innovation portfolio and business model canvas for your venture.\n\nWe establish a framework for examining the innovation process, and quickly transition into exploring how to successfully bring innovations to market. Key questions answered within the course include:\n\n* What are the key indicators of innovation opportunities?\n* What steps are critical for entrepreneurs to bring innovations to the marketplace?\n* What innovation strategies are valuable for new ventures to establish and maintain a competitive advantage?\n\nWith this course, students experience a sampling of the ideas and techniques explored in the University of Maryland\u0027s master\u0027s degree in technology entrepreneurship, an innovative, 100% online program. Learn more at http://mte.umd.edu/landing.","tutor":"Thomas Mierzwa","provider":"Coursera","language":"English","skills":["usa","north america"],"subject":"Entrepreneurship","studentsInterested":"698","courseLink":"https://www.coursera.org/learn/innovative-entrepreneur","classCentralLink":"https://www.class-central.com/course/coursera-innovation-for-entrepreneurs-from-idea-to-marketplace-2708"},{"title":"New Venture Finance: Startup Funding for Entrepreneurs","about":"This course is for aspiring or active entrepreneurs who wants to understand how to secure funding for their company. This course will demystify key financing concepts to give entrepreneurs and aspiring entrepreneurs a guide to secure funding.\n\nExamine the many financing options available to get your new venture funded. Learn the basics of finance, valuations, dilution and non-dilutive funding sources. Understand capital structure for new ventures, term sheets and how to negotiate them, and the differences between early-stage versus later-stage financing. Develop an understanding of how to develop winning investor pitches, who and when to pitch, how to avoid common mistakes that limit the effectiveness of the pitch, and how to ‘get to the close’. Key questions answered within the course include:\n\n* When to raise outside capital?\n* What kind of investors invest by stage and where to find them?\n* What are your fundraising options?\n* What are the key components of the term sheet?\n* How to perform company valuations?\n* How to pitch to investors?\n* What techniques help the entrepreneur ‘get to the close’?\n\nWith this course, students experience a sampling of the ideas and techniques explored in the University of Maryland\u0027s master\u0027s degree in technology entrepreneurship, an innovative 100% online program. Learn more at http://mte.umd.edu/landing.","tutor":"Michael Pratt","provider":"Coursera","language":"English","skills":["usa","north america"],"subject":"Entrepreneurship","studentsInterested":"2.7k","courseLink":"https://www.coursera.org/learn/startup-funding","classCentralLink":"https://www.class-central.com/course/coursera-new-venture-finance-startup-funding-for-entrepreneurs-2709"},{"title":"Advanced Competitive Strategy","about":"Advanced Competitive Strategy will introduce new topics and modules with even more real world examples and opportunities for student interaction than in the previous course Competitive Strategy (https://www.coursera.org/learn/competitivestrategy).\n\nIn Advanced Competitive Strategy, we will look at how companies can build up and maintain their customer base by increasing switching costs and facilitating strategic customer lock-ins. We will find out how firms can increase their profits by pursuing suitable price discrimination and product differentiation strategies.\n\nWe will look at examples of what is acceptable behavior under the premises of EU competition and US antitrust policies and discover exciting ways of how companies can increase their returns by strategically making use of network effects and economies of size. We will further intensify our newly acquired knowledge about network effects and discuss strategies that are explicitly tailored to network markets.\n\nWe will analyze the workings of mergers and acquisitions and, moreover, support you in considering alternative strategies that can help companies grow organically.","tutor":"Tobias Kretschmer","provider":"Coursera","language":"English","skills":["europe","germany"],"subject":"Strategic Management","studentsInterested":"2.2k","courseLink":"https://www.coursera.org/learn/advanced-competitive-strategy","classCentralLink":"https://www.class-central.com/course/coursera-advanced-competitive-strategy-1856"},{"title":"An Introduction to Consumer Neuroscience \u0026 Neuromarketing","about":"How do we make decisions as consumers? What do we pay attention to, and how do our initial responses predict our final choices? To what extent are these processes unconscious and cannot be reflected in overt reports? This course will provide you with an introduction to some of the most basic methods in the emerging fields of consumer neuroscience and neuromarketing. You will learn about the methods employed and what they mean. You will learn about the basic brain mechanisms in consumer choice, and how to stay updated on these topics. The course will give an overview of the current and future uses of neuroscience in business.","tutor":"Thomas Ramsøy","provider":"Coursera","language":"English","skills":["europe","denmark"],"subject":"Marketing","studentsInterested":"519","courseLink":"https://www.coursera.org/learn/neuromarketing","classCentralLink":"https://www.class-central.com/course/coursera-an-introduction-to-consumer-neuroscience-neuromarketing-1395"},{"title":"Forensic Accounting and Fraud Examination","about":"Everyday across the world, thousands of businesses are victimized by fraud. Who commits these bad acts? Why? And, how? In this course we are going to help you answer the questions: who commits fraud, why and how. We’ll also help you develop skills for catching them.","tutor":"Richard Riley, Richard Dull and John Gill","provider":"Coursera","language":"English","skills":["financial accounting","accounting","usa","north america"],"subject":"Accounting","studentsInterested":"415","courseLink":"https://www.coursera.org/learn/forensic-accounting","classCentralLink":"https://www.class-central.com/course/coursera-forensic-accounting-and-fraud-examination-2465"},{"title":"Supply Chain Fundamentals","about":"This Supply Chain Fundamentals course is part of the MITx MicroMasters Credential in Supply Chain Management, offered by #1 ranked SCM Master\u0027s program at the Massachusetts Institute of Technology.\nThe CTL.SC1x Supply Chain Fundamentals course provides the foundational skills for supply chain management and logistics. You will learn how to develop and apply analytic tools, approaches, and techniques used in the design and operation of logistics systems and integrated supply chains. The material is taught from a managerial perspective, with an emphasis on where and how specific tools can be used to improve the overall performance and reduce the total cost of a supply chain. We place a strong emphasis on the development and use of fundamental mathematical models to illustrate the underlying concepts involved in both intra- and inter-company logistics operations.\nThe main topic areas we will focus on this course are:\nDemand Forecasting, Planning, and Management\nInventory Planning, Management, and Control\nTransportation Planning, Management, and Execution\nWhile our main objective is to develop and use models to help us analyze these situations, we will make heavy use of examples from industry to provide illustrations of the concepts in practice. This is neither a purely theoretical nor a case study course, but rather an applied analytical course that addresses real problems found in practice.","tutor":"Chris Caplice","provider":"edX","language":"English","skills":["mitx"],"subject":"Strategic Management","studentsInterested":"6.0k","courseLink":"https://www.edx.org/course/supply-chain-fundamentals-mitx-ctl-sc1x-3","classCentralLink":"https://www.class-central.com/course/edx-supply-chain-fundamentals-2140"},{"title":"Business Metrics for Data-Driven Companies","about":"In this course, you will learn best practices for how to use data analytics to make any company more competitive and more profitable. You will be able to recognize the most critical business metrics and distinguish them from mere data.\n\nYou’ll get a clear picture of the vital but different roles business analysts, business data analysts, and data scientists each play in various types of companies. And you’ll know exactly what skills are required to be hired for, and succeed at, these high-demand jobs.\n\nFinally, you will be able to use a checklist provided in the course to score any company on how effectively it is embracing big data culture. Digital companies like Amazon, Uber and Airbnb are transforming entire industries through their creative use of big data. You’ll understand why these companies are so disruptive and how they use data-analytics techniques to out-compete traditional companies.","tutor":"Daniel Egger and Jana Schaich Borg","provider":"Coursera","language":"English","skills":["data analysis","business analytics","usa","north america"],"subject":"Business Intelligence","studentsInterested":"281","courseLink":"https://www.coursera.org/learn/analytics-business-metrics","classCentralLink":"https://www.class-central.com/course/coursera-business-metrics-for-data-driven-companies-4357"},{"title":"Managing Project Risks and Changes","about":"This course will help you manage project risk effectively by identifying, analyzing, and communicating inevitable changes to project scope and objectives. You will understand and practice the elements needed to measure and report on project scope, schedule, and cost performance. You will be equipped with the tools to manage change in the least disruptive way possible for your team and other project stakeholders.\n\nUpon completing this course, you will be able to:\n1. Define components of a communications management plan\n2. Understand the importance of communications channels\n3. Define the key elements needed to measure and report on project scope, schedule, and cost performance\n4. Identify project risk events\n5. Prioritize identified risks\n6. Develop responses for a high priority risk\n7. Identify and analyze changes to project scope\n8. Describe causes and effects of project changes\n9. Define the purpose of conducting a lessons learned session","tutor":"Margaret Meloni","provider":"Coursera","language":"English","skills":["usa","north america"],"subject":"Project Management","studentsInterested":"5.8k","courseLink":"https://www.coursera.org/learn/project-risk-management","classCentralLink":"https://www.class-central.com/course/coursera-managing-project-risks-and-changes-2730"},{"title":"Foundations of strategic business analytics","about":"Who is this course for?\nThis course is designed for students, business analysts, and data scientists who want to apply statistical knowledge and techniques to business contexts. For example, it may be suited to experienced statisticians, analysts, engineers who want to move more into a business role.\n\nYou will find this course exciting and rewarding if you already have a background in statistics, can use R or another programming language and are familiar with databases and data analysis techniques such as regression, classification, and clustering.\nHowever, it contains a number of recitals and R Studio tutorials which will consolidate your competences, enable you to play more freely with data and explore new features and statistical functions in R.\n\nWith this course, you’ll have a first overview on Strategic Business Analytics topics. We’ll discuss a wide variety of applications of Business Analytics. From Marketing to Supply Chain or Credit Scoring and HR Analytics, etc. We’ll cover many different data analytics techniques, each time explaining how to be relevant for your business.\n\nWe’ll pay special attention to how you can produce convincing, actionable, and efficient insights. We\u0027ll also present you with different data analytics tools to be applied to different types of issues.\nBy doing so, we’ll help you develop four sets of skills needed to leverage value from data: Analytics, IT, Business and Communication.\n\nBy the end of this MOOC, you should be able to approach a business issue using Analytics by (1) qualifying the issue at hand in quantitative terms, (2) conducting relevant data analyses, and (3) presenting your conclusions and recommendations in a business-oriented, actionable and efficient way.\n\nPrerequisites : 1/ Be able to use R or to program 2/ To know the fundamentals of databases, data analysis (regression, classification, clustering)\n\nWe give credit to Pauline Glikman, Albane Gaubert, Elias Abou Khalil-Lanvin (Students at ESSEC BUSINESS SCHOOL) for their contribution to this course design.","tutor":"Nicolas Glady","provider":"Coursera","language":"English","skills":["europe","strategic business analytics","france"],"subject":"Business Intelligence","studentsInterested":"283","courseLink":"https://www.coursera.org/learn/strategic-business-analytics","classCentralLink":"https://www.class-central.com/course/coursera-foundations-of-strategic-business-analytics-4371"},{"title":"Starting a Business 1: Vision and Opportunity","about":"##\nA successful business starts with a clear vision and a thorough understanding of the opportunities available to turn that vision into a reality. Whether you have an idea for a future venture or you already have a side-line business whilst studying, this course will help you consider your vision and explore the opportunities available. It will give you the time to plan and help you to start documenting your thoughts in a structured business plan while allowing you to share your ideas with others.\nThis course is the first in a series of six about ‘starting a business’.\nThis course is part of the ‘Going to University’ collection which has been specifically designed for schools and colleges. The course can be used as a teachers’ classroom enrichment resource or can be studied independently by students.","tutor":"Nigel Lockett","provider":"FutureLearn","language":"English","skills":["europe","business planning","uk"],"subject":"Entrepreneurship","studentsInterested":"2.0k","courseLink":"https://www.futurelearn.com/courses/starting-a-business-1","classCentralLink":"https://www.class-central.com/course/futurelearn-starting-a-business-1-vision-and-opportunity-5007"},{"title":"Inspiring and Motivating Individuals","about":"In this course, you will learn how to create a shared vision for your team and effectively communicate it to your teammates. You will also learn how to set effective goals and expectations in a way that best enables your team to attain the shared vision. Finally, you will understand the most important needs and drivers of performance across cultures, and will learn to align rewards with desired behaviors so that your teammates are motivated to attain the team’s objectives.\n\nMotivation represents a crucial challenge for contemporary organizations: A recent Gallup poll revealed that only 13% of workers worldwide exhibit high levels of engagement and motivation. We will show you why these motivation problems are not simply due to a “bad” or “unmotivated” team member. Rather, motivation is very much driven by what work conditions we create for our teammates, how we structure goals and objectives, and how we reward people for the accomplishment of those goals. This course will help you diagnose and solve motivation problems so that you can bring out the best in your people.","tutor":"Scott DeRue, Ph.D. and Maxim Sytch, Ph.D.","provider":"Coursera","language":"English","skills":["team building","motivation","usa","north america"],"subject":"Management \u0026 Leadership","studentsInterested":"4.3k","courseLink":"https://www.coursera.org/learn/motivate-people-teams","classCentralLink":"https://www.class-central.com/course/coursera-inspiring-and-motivating-individuals-4183"},{"title":"The Science of Success: What Researchers Know that You Should Know","about":"This engaging course is designed to help you achieve the success that you desire. Drawing on decades of scientific research, you will learn what the most successful people do differently than others, why IQ is not the most significant predictor of success (and can sometimes backfire), and why many commonly held beliefs hold people back from achieving their goals.\n\nAlthough this course is based on the science of success, you will learn many practical ideas that you can apply to your own life immediately, particularly in three main areas:\n\n• Getting better results at work (and school)\n• Achieving career success (however you define success)\n• Enjoying a meaningful, happy, and healthy life\n\nBy the time you finish this course you will know more than most people know about what predicts success in life. One of the most important lessons you’ll learn is that success is earned day-by-day through small wins - small, achievable actions that together can help you achieve your goals sooner and exceed even your own expectations. Therefore, you will have an opportunity to complete a detailed action plan through which you can turn what you learned into specific steps for achieving your most treasured life goals.","tutor":"Paula Caproni","provider":"Coursera","language":"English","skills":["usa","north america","new-moocs-2017"],"subject":"Management \u0026 Leadership","studentsInterested":"3.7k","courseLink":"https://www.coursera.org/learn/success","classCentralLink":"https://www.class-central.com/course/coursera-the-science-of-success-what-researchers-know-that-you-should-know-8087"},{"title":"Project Management Basics","about":"Ever wonder what Project Management involves? This course will provide you with key concepts and techniques for successfully managing projects from planning to completion. After taking this course you will be able to:\n(1) Differentiate between projects and operations\n(2) Identify the different phases of a project\n(3) Develop strategies to effectively handle projects\n(4) Assess if Project Management is a career path for you\n(5) Collaborate and share your Project Management experiences with others!","tutor":"Silvia Gurdian","provider":"Open Education by Blackboard","language":"English","skills":["usa","north america"],"subject":"Project Management","studentsInterested":"2.7k","courseLink":"https://www.coursesites.com/webapps/Bb-sites-course-creation-BBLEARN/courseHomepage.htmlx?course_id\u003d_257864_1","classCentralLink":"https://www.class-central.com/course/open-education-by-blackboard-project-management-basics-794"},{"title":"Lean Production","about":"Learn about lean management, a customer-centric methodology that improves processes by eliminating waste and focusing on value-added tasks.\nThis course will introduce the main tenets of the Toyota Production System, which includes Just-in-Time manufacturing, quality management tools, and the critical concept of Kaizen, the Japanese practice of continuous improvement. You will also learn about key organisation and managerial approaches that are used in Lean.  \nYou will learn how to analyse process flows in order to establish process capacity and identify the process bottleneck. You will then calculate resource utilisation and cycle time to evaluate the impact of set up times, batching, defects and reworks on key process performance measures, including inventory, flow rate and flow time.\nWe will also discuss the impact of key concepts of Lean, including Heijunka, Kanban, Jidoka, Andon, Poka Yoke, and 5S, which help achieve increased productivity and quality.\nUpon successful completion of this series, learners will earn the Technical University of Munich Lean Six Sigma Yellow Belt Certification, confirming mastery of the fundamentals of Lean Six Sigma to a Yellow Belt level, based on the American Society of Quality\u0027s Body of Knowledge for the Certified Six Sigma Yellow Belt. ","tutor":"Martin Grunow and Holly Ott","provider":"edX","language":"English","skills":["tumx"],"subject":"Business","studentsInterested":"161","courseLink":"https://www.edx.org/course/lean-production-tumx-qpls3x-0","classCentralLink":"https://www.class-central.com/course/edx-lean-production-8447"},{"title":"The Global Financial Crisis","about":"Former U.S. Secretary of the Treasury Timothy F. Geithner and Professor Andrew Metrick survey the causes, events, policy responses, and aftermath of the recent global financial crisis.","tutor":"Andrew Metrick and Timothy Geithner","provider":"Coursera","language":"English","skills":["financial crisis","usa","north america"],"subject":"Finance","studentsInterested":"3.2k","courseLink":"https://www.coursera.org/learn/global-financial-crisis","classCentralLink":"https://www.class-central.com/course/coursera-the-global-financial-crisis-4893"},{"title":"How to Start a Startup","about":"CS183B is a class we’re teaching at Stanford. It’s designed to be a sort of one-class business course for people who want to start startups.\nVideos of the lectures, associated reading materials, and assignments will all be available here. There will be 20 videos, some with a speaker or two and some with a small panel. It’ll be 1,000 minutes of content if you watch it all.\nWe’ll cover how to come up with ideas and evaluate them, how to get users and grow, how to do sales and marketing, how to hire, how to raise money, company culture, operations and management, business strategy, and more.\nYou can’t teach everything necessary to succeed in starting a company, but I suspect we can teach a surprising amount. We’ve tried to take some of the best speakers from the past 9 years of Y Combinator dinners and arrange them in a way that will hopefully make sense.\nWe’re doing this because we believe helping a lot of people be better at starting companies will be good for everyone. It will hopefully be valuable even for people who don’t want to start startups.\nTalks like these have really helped Y Combinator founders create their companies. We hope you find it helpful too!","tutor":"Sam Altman","provider":"Independent","language":"English","skills":["usa","north america"],"subject":"Entrepreneurship","studentsInterested":"10.9k","courseLink":"https://www.http://startupclass.samaltman.com/","classCentralLink":"https://www.class-central.com/course/how-to-start-a-startup-2572"},{"title":"Project Management for Designers","about":"Project Management for Designers is intended for students who would like a broad exposure to the field of Design, with a specific interest in administration and management. This curriculum investigates the practical, business side of design: getting organized and staying on-track through timeline projections, cost estimates and workflow charts in order to ensure success and profitability. Students will study the essential paperwork – estimates, memos, model releases, change orders and contact reports – and will look at contracts and copyright issues, and when to get legal and accounting assistance. Students will also learn the principles of research, and its important role in the work of a designer. From working in a small to mid-size design studio, to more independent roles, students will gain important skills in both understanding the context and needs of designers and the field broadly, and strategies for developing administrative processes that support these practices.\nThe program is intended for students who already have foundational training in Design, and who are looking to move into a design field in an administrative capacity, or for designers who are interested in gaining valuable management knowledge. On completion of the modules, students will understand the principles of how to make a business work cleanly and efficiently, how to manage yourself and your workflow, and how to ensure client relationships are productive and clear.","tutor":"Hope Forstenzer","provider":"Kadenze","language":"English","skills":["design","project management","canada","north america"],"subject":"Project Management","studentsInterested":"585","courseLink":"https://www.kadenze.com/courses/project-management-for-designers","classCentralLink":"https://www.class-central.com/course/kadenze-project-management-for-designers-3750"},{"title":"Digital Branding and Engagement","about":"Want to learn how to get people to engage with your brand, but not sure where to begin?\nDigital technology has rapidly evolved in the last decade, and so too has the way people communicate. Businesses can no longer rely solely on traditional business models to build brand awareness.\nIn today’s interconnected, hyperaware world, brand awareness and brand engagement are synonymous. We are in the age of digital brand engagement, where brands need to participate in, and inspire, a two-way conversation with their consumers.\nThis course will teach you about this shift and how it has altered the way brands communicate with their audiences. You will learn about the challenges of managing a digital brand and how rich and compelling content, combined with digital distribution, are integral to brand engagement.\nThis course is part of the CurtinX MicroMasters Credential in Marketing in a Digital World that is specifically designed to teach the critical skills needed to be successful in this exciting field. In order to qualify for the MicroMasters Credential you will need to earn a Verified Certificate in each of the five courses.","tutor":"Sonia Dickinson","provider":"edX","language":"English","skills":["curtinx"],"subject":"Marketing","studentsInterested":"362","courseLink":"https://www.edx.org/course/digital-branding-engagement-curtinx-mkt1x-3","classCentralLink":"https://www.class-central.com/course/edx-digital-branding-and-engagement-4101"},{"title":"The Language and Tools of Financial Analysis","about":"In this course, participants will learn the foundations of accounting principles and financial analysis, develop an understanding of the links between these, and the measurement of value creation at the firm level. This is the first course in a four-course Specialization on the Essentials of Corporate Financial Analysis and Decision-Making, created in partnership between the University of Melbourne and Bank of New York Mellon (BNY Mellon).\n\nView the MOOC promotional video here: http://tinyurl.com/jeoa83t","tutor":"Paul Kofman and Sean Pinder","provider":"Coursera","language":"English","skills":["australia"],"subject":"Finance","studentsInterested":"534","courseLink":"https://www.coursera.org/learn/financial-analysis","classCentralLink":"https://www.class-central.com/course/coursera-the-language-and-tools-of-financial-analysis-3330"},{"title":"Financial Engineering and Risk Management Part I","about":"Financial Engineering is a multidisciplinary field drawing from finance and economics, mathematics, statistics, engineering and computational methods. The emphasis of FE \u0026 RM Part I will be on the use of simple stochastic models to price derivative securities in various asset classes including equities, fixed income, credit and mortgage-backed securities. We will also consider the role that some of these asset classes played during the financial crisis. A notable feature of this course will be an interview module with Emanuel Derman, the renowned ``quant\u0027\u0027 and best-selling author of \"My Life as a Quant\".\n\nWe hope that students who complete the course will begin to understand the \"rocket science\" behind financial engineering but perhaps more importantly, we hope they will also understand the limitations of this theory in practice and why financial models should always be treated with a healthy degree of skepticism. The follow-on course FE \u0026 RM Part II will continue to develop derivatives pricing models but it will also focus on asset allocation and portfolio optimization as well as other applications of financial engineering such as real options, commodity and energy derivatives and algorithmic trading.","tutor":"Martin Haugh and Garud Iyengar","provider":"Coursera","language":"English","skills":["usa","north america"],"subject":"Finance","studentsInterested":"2.2k","courseLink":"https://www.coursera.org/learn/financial-engineering-1","classCentralLink":"https://www.class-central.com/course/coursera-financial-engineering-and-risk-management-part-i-1014"},{"title":"Organizational Analysis","about":"In this introductory, self-paced course, you will learn multiple theories of organizational behavior and apply them to actual cases of organizational change.\n\nOrganizations are groups whose members coordinate their behaviors in order to accomplish a shared goal. They can be found nearly everywhere in today’s society: universities, start-ups, classrooms, hospitals, non-profits, government bureaus, corporations, restaurants, grocery stores, and professional associations are some of many examples of organizations.\n\nOrganizations are as varied and complex as they are ubiquitous: they differ in size and internal structure; they can entail a multiplicity of goals and tasks (some of which are planned and others unplanned!); they are made up of individuals whose goals and motivations may differ from those of the group; and they must interact with other organizations and deal with environmental constraints in order to be successful. This complexity frequently results in a myriad of problems for organizational participants and the organization’s survival.\n\nIn this course, we will use organizational theories to systematically analyze how an organization operates and can best be managed. Organizational theories highlight certain features of an organization’s structure and environment, as well as its processes of negotiation, production, and change. Each provides a lens for interpreting novel organizational situations and developing a sense for how individual and group behaviors are organized. Theories are valuable for the analyst and manager because most organizational problems are unique to the circumstances and cannot be solved by simple rules of thumb. Armed with a toolset of organizational theories, you will be able to systematically identify important features of an organization and the events transforming it; choose a theoretical framework most applicable to the observed mode of organizing; and use that theory to determine which actions will best redirect the organization in desired directions.\n\nIn sum, the course has three goals: to become familiar with a series of real-world organizational phenomena; to learn different theoretical perspectives that can elucidate these phenomena; and to apply these different ways of “seeing” and managing organizations to cases. In such a fashion, the course is designed to actively bridge theory and practice, exposing students to a variety of conceptual tools and ways to negotiate novel situations.","tutor":"Daniel A. McFarland","provider":"Coursera","language":"English","skills":["usa","north america"],"subject":"Business Intelligence","studentsInterested":"2.9k","courseLink":"https://www.coursera.org/learn/organizational-analysis","classCentralLink":"https://www.class-central.com/course/coursera-organizational-analysis-459"},{"title":"Introduction to the Music Business","about":"Three things are clear about today’s music industry: The consumption of music is expanding at the greatest rate in history and from the most portals ever imagined, the cost of producing music is decreasing, and the number of artists creating and seeking to expose their work and develop careers through the Internet has increased dramatically. As demand grows and Internet piracy wanes, ad-supported and subscription models will generate unprecedented revenues that will surpass even the best of past earnings. And, many astute “music industry-watchers” predict a steep rise in business activity and trade earnings by the end of the decade.\nWhether you’re a music creator, consumer, or facilitator of this process, you’ll want to understand the history, underpinnings, and basics of the music business. This course has been developed to provide students with the latest instruction on the best way for creators, consumers, and facilitators to navigate the resurgence of one of the world’s most exciting industries: the music business. Course author John Kellogg—administrator, educator, entertainment lawyer, performer, and radio and television personality—offers students the opportunity to learn the fundamental principles of the developing new music business, for now and into the future.","tutor":"John P. Kellogg","provider":"edX","language":"English","skills":["berkleex"],"subject":"Industry Specific","studentsInterested":"1.5k","courseLink":"https://www.edx.org/course/introduction-to-the-music-business","classCentralLink":"https://www.class-central.com/course/edx-introduction-to-the-music-business-1486"},{"title":"企业金融概论（中文版）","about":"学完本课程后，您将可以分析企业所做金融决策的主要类型。然后，您可以运用所学技能处理现实商务挑战，这也是沃顿商学院商务基础专项课程的组成部分。主要概念包括：净现值技术、资本预算原则、资产估值、金融市场运作和效率、公司财务决策以及衍生产品。","tutor":"Michael Roberts","provider":"Coursera","language":"Chinese","skills":["corporate finance","usa","north america"],"subject":"Finance","studentsInterested":"14","courseLink":"https://www.coursera.org/learn/wharton-qiye-jinrong","classCentralLink":"https://www.class-central.com/course/coursera---3903"},{"title":"Business Growth Strategy","about":"Get the tools you need to analyze, evaluate and recommend specific actions organizations can take to grow their value and avoid common growth pitfalls. Learn to determine how best to build value, whether by scaling existing markets, entering established markets or creating new markets through innovation and acquisitions. Apply these concepts in case studies of industry leaders JetBlue, Starbucks, Intel Corporate Venturing and Tata Motors.","tutor":"Michael J. Lenox and Jared Harris","provider":"Coursera","language":"English","skills":["growth strategy","usa","north america"],"subject":"Strategic Management","studentsInterested":"5.6k","courseLink":"https://www.coursera.org/learn/uva-darden-business-growth-strategy","classCentralLink":"https://www.class-central.com/course/coursera-business-growth-strategy-4259"},{"title":"Финансовые рынки и институты (Financial Markets and Institutions)","about":"В рамках данного курса рассматриваются основные вопросы функционирования финансовых рынков, деятельности финансовых институтов, изучаются финансовые инструменты, с которыми приходится сталкиваться человеку в своей жизни. Помимо этого, раскрываются базовые принципы инвестирования свободных средств на финансовом рынке, основы проведения финансовых вычислений.\n\nВ настоящее время финансовый рынок активно используется компаниями, регионами и государством для привлечения финансовых ресурсов, обеспечивающих реализацию инвестиционных проектов. Однако востребован финансовый рынок не только со стороны финансовых институтов, но и частных инвесторов, которые используют его для размещения временно свободных денежных средств с целью получения дохода на вложенный капитал. Изучение курса позволит слушателю лучше ориентироваться в современном финансовом мире, понимать причины финансовых кризисов, роль процессов глобализации и секьюритизации финансовых рынков, возможности финансовой инженерии.\n\nФинальная оценка за курс основана на 9 тестах, выполняемых в конце каждой недели. Курс считается пройденным при успешной сдаче всех тестов.\nКаких-либо специальных знаний в области финансов и фондовых рынков для освоения курса не требуется.","tutor":"Nikolay Berzon","provider":"Coursera","language":"Russian","skills":["russia"],"subject":"Finance","studentsInterested":"56","courseLink":"https://www.coursera.org/learn/finansovye-rynki","classCentralLink":"https://www.class-central.com/course/coursera-----financial-markets-and-institutions-1375"},{"title":"Operations Management","about":"In this course, you will learn about the role of operations and how they are connected to other business functions in manufacturing- and service-focused organizations. You will learn and practice the use of decision-making frameworks and techniques applicable at all levels, from management-level strategic decisions such as connecting process to the needs of various customer segments, to front-line tactical decisions such as choosing between ordering larger quantities vs. ordering more frequently.\n\nUpon successful completion of this course, you will be able to:\n• Understand the role of operations management\n• Relate underlying principles to operations management frameworks and techniques\n• Synthesize information to make strategic operations decisions\n• Evaluate processes on different dimensions\n• Apply analytical techniques for tactical operations decision\n\nThis course is part of the iMBA offered by the University of Illinois, a flexible, fully-accredited online MBA at an incredibly competitive price. For more information, please see onlinemba.illinois.edu.","tutor":"Gopesh Anand","provider":"Coursera","language":"English","skills":["usa","north america"],"subject":"Strategic Management","studentsInterested":"7.7k","courseLink":"https://www.coursera.org/learn/operations-management","classCentralLink":"https://www.class-central.com/course/coursera-operations-management-2741"},{"title":"Operations Analytics","about":"This course is designed to impact the way you think about transforming data into better decisions. Recent extraordinary improvements in data-collecting technologies have changed the way firms make informed and effective business decisions. The course on operations analytics, taught by three of Wharton’s leading experts, focuses on how the data can be used to profitably match supply with demand in various business settings. In this course, you will learn how to model future demand uncertainties, how to predict the outcomes of competing policy choices and how to choose the best course of action in the face of risk. The course will introduce frameworks and ideas that provide insights into a spectrum of real-world business challenges, will teach you methods and software available for tackling these challenges quantitatively as well as the issues involved in gathering the relevant data.\n\nThis course is appropriate for beginners and business professionals with no prior analytics experience.","tutor":"Senthil Veeraraghavan, Sergei Savin and Noah Gans","provider":"Coursera","language":"English","skills":["business analytics","usa","north america"],"subject":"Business Intelligence","studentsInterested":"2.3k","courseLink":"https://www.coursera.org/learn/wharton-operations-analytics","classCentralLink":"https://www.class-central.com/course/coursera-operations-analytics-4204"},{"title":"Changer le monde : passons a l\u0027action (creer son entreprise sociale)","about":"Ce MOOC a pour vocation de vous aider à créer votre entreprise à but social ou environnemental.\nQue vous envisagiez de créer une entreprise sociale ou de lancer un nouveau projet à visée sociale dans votre entreprise actuelle, que vous souhaitiez entreprendre à Paris, Casablanca ou à Abidjan, ce MOOC est pour vous !","tutor":"Thierry Sibieude, Kevin André, Jean-claude Charlet and Jan Lepoutre","provider":"Coursera","language":"French","skills":["europe","social entrepreneurship","social impact","france"],"subject":"Entrepreneurship","studentsInterested":"37","courseLink":"https://www.coursera.org/learn/monde-action","classCentralLink":"https://www.class-central.com/course/coursera-changer-le-monde-passons-a-l-action-creer-son-entreprise-sociale-4324"},{"title":"The fundamentals of hotel distribution","about":"In today’s hotel sector an increasingly complex network of traditional and web based channels have to be managed to insure hotel success. Key questions include: how should you distribute over the web? What should you include on your brand.com website so people book through it? How can you maximise the potential of online travel agents (OTAs)? With the distribution environment both highly complex and constantly evolving, this course will give you comprehensive foundation of current industry practices to help jumpstart your career in this fascinating domain.\n\nAcknowledgements: Claire Bertrand, Vincent Chatain, Jessica Moses, Benjamin Six (ESSEC Business School), Emilie Dupré (Image-In), Gregory Halidy (Triplay)","tutor":"Peter O\u0027Connor and Nicolas Graf","provider":"Coursera","language":"English","skills":["europe","hotel distribution","france"],"subject":"Industry Specific","studentsInterested":"315","courseLink":"https://www.coursera.org/learn/hotel-distribution","classCentralLink":"https://www.class-central.com/course/coursera-the-fundamentals-of-hotel-distribution-4300"},{"title":"Optimizing a Website for Search","about":"Learn the ins and outs of optimizing a website, from conducting an initial audit to presenting your findings and recommendations. Hands-on activities include learning how to select and apply appropriate keywords throughout a website, incorporating keyword research in a content marketing strategy, and optimizing a site for local search. You will also learn strategies for setting goals and client/stakeholder expectations, building effective analytics and reports, and communicating SEO improvements.","tutor":"Rebekah May","provider":"Coursera","language":"English","skills":["seo","keywords","analytics","usa","north america"],"subject":"Marketing","studentsInterested":"173","courseLink":"https://www.coursera.org/learn/optimizing-web-search","classCentralLink":"https://www.class-central.com/course/coursera-optimizing-a-website-for-search-5512"},{"title":"Entrepreneurship 3: Growth Strategies","about":"Start-ups are designed to grow quickly, but successful start-ups grow smart. This course is designed to provide you with an understanding of the essential elements of successful scaling, including an overview of demand generation, customer acquisition, adoption, diffusion and forecasting demand. You’ll also learn how to market effectively using best practices of digital marketing, social media, PR, SEO, and pricing. Finally, you’ll cover the nuts and bolts of building a sales process, partnerships and supply relationships, and examine the crucial components of attracting, developing and retaining talent. By the end of this course, you’ll have an outline of an expansion strategy for your idea or enterprise, and also be ready for Entrepreneurship 4: Financing and Profitability","tutor":"David Bell, Ethan Mollick, Laura Huang, David Hsu, Karl T. Ulrich, Lori Rosenkopf and Kartik Hosanagar","provider":"Coursera","language":"English","skills":["entreprenuership","startups","growth strategy","usa","north america"],"subject":"Entrepreneurship","studentsInterested":"395","courseLink":"https://www.coursera.org/learn/growth-strategy","classCentralLink":"https://www.class-central.com/course/coursera-entrepreneurship-3-growth-strategies-5466"},{"title":"¿Cómo convertir mi idea en empresa?","about":"Este curso te ofrece un entrenamiento para la tarea de descubrir quién será el consumidor de tu producto o servicio y cuáles serán los atributos y características del mismo. Al terminar el curso, habrás identificado una oportunidad de negocio que te permitirá utilizar tus fortalezas personales; habrás identificado un grupo de consumidores y sus necesidades; habrás creado un producto o servicio para atender esas necesidades y lo habrás prototipado con consumidores reales, obteniendo claridad con respecto a cuáles son los atributos del producto que el consumidor realmente desea y por los cuales está dispuesto a pagar.\n\nObjetivos de aprendizaje:\n\n1. Identificar las capacidades que tienes como individuo y te hacen especial (lo que eres, lo que sabes y a quien conoces), e identificar cómo estas capacidades pueden implicar ventajas en tu entorno. Se introduce aquí la idea de ventaja injusta, que hace referencia a las capacidades individuales que resultan raras, valiosas y difíciles de replicar en el medio.\n2. Identificar con precisión una necesidad en el entorno, que pueda ser resuelta por ti como individuo, a partir de tus capacidades personales.\n3. Proponer una solución que pueda funcionar bien como un producto o servicio en el mercado. Precisar la propuesta de valor teniendo en cuenta sus elementos constitutivos: productos y servicios, canales, relación con el cliente y la forma de cobro.\n\nTen en cuenta que este curso ha sido diseñado como el primero de cuatro cursos que hacen parte del programa especializado en Desarrollo de nuevas empresas (https://www.coursera.org/specializations/desarrollo-nuevas-empresas), cuyo objetivo es brindarte una ruta práctica y accesible para crear y consolidar tu propia empresa, partiendo del análisis de tus ideas, de tus propias habilidades y de las oportunidades que te ofrece tu entorno inmediato.\n\nPuedes tomar todos los cursos por separado o sólo uno de ellos, sin embargo te recomendamos que te inscribas y participes en los cuatro, ojalá en el orden que te proponemos, de manera que llegues al último curso denominado \"Mi nueva empresa: los siguientes pasos\" preparado para aplicar los conocimientos adquiridos en los cursos anteriores y lleves tu emprendimiento o negocio a la realidad.","tutor":"Rafael Vesga Fajardo and Felipe Estrada Prada","provider":"Coursera","language":"Spanish","skills":["entrepreneurship","business ideas","colombia","south america"],"subject":"Entrepreneurship","studentsInterested":"100","courseLink":"https://www.coursera.org/learn/idea-empresa","classCentralLink":"https://www.class-central.com/course/coursera-como-convertir-mi-idea-en-empresa-5601"},{"title":"(Re)-invent your business model with the Odyssey 3.14 approach","about":"This course gives you access to Odyssey 3.14 - an original approach developed to help you invent or reinvent a business model.\n\nThis highly innovative approach has been developed by Laurence Lehmann-Ortega and Hélène Musikas and has been shown to be very effective. It is taught to top executives, entrepreneurs, and HEC students.\n\nYou will learn about the concept and tools that combine innovation and strategy. Starting with the 3 pillars that make up the core business model, this approach recommends 14 directions to consider in order to invent or reinvent the business model.\nWhether you are a graduate student, an executive or an entrepreneur, you will learn from examples and from your peers how to challenge your views in order to be innovative and come up with new ideas.\nOdyssey 3.14 is the result of over ten years of research, consulting and teaching. Over 100 companies that have successfully invented or reinvented their business model have been thoroughly analyzed and will inspire you to develop your own new, innovative business model.\n\nAt the end of the course, you will be able to :\n• Define what a business model is and how it relates to other the tools and frameworks in strategy\n• Understand the 3 components of the business model and how they are linked\n• Remember the 14 directions in which to explore and imagine a new business model\n• Understand the Odyssey 3.14 global approach, which means being able to apply this approach to any industry","tutor":"Laurence Lehmann-Ortega and Hélène Musikas","provider":"Coursera","language":"English","skills":["innovation","europe","business models","odyessy 3.14","france"],"subject":"Entrepreneurship","studentsInterested":"47","courseLink":"https://www.coursera.org/learn/business-model","classCentralLink":"https://www.class-central.com/course/coursera-re-invent-your-business-model-with-the-odyssey-3-14-approach-5961"},{"title":"Gestión del canal de distribución y retailing","about":"Hoy en día la estrategia de distribución es parte del ADN de muchas empresas y la gestión correcta de la misma es fundamental para el éxito de tu producto o servicio. Los canales necesitan ser planificados a largo plazo combinando las siguientes áreas principalmente: perfil de compañía, estructura de portafolio y posicionamiento de precio, política de go-to-market, trade y retail marketing, comercio electrónico y manejo de ventas global.\n\nEn la última década, ha habido dos revoluciones que han afectado las industrias, incrementando la importancia del manejo de los canales de distribución:\n\n• La revolución digital: considerando los desarrollos en el área de CRM, la cadena de abastecimiento, herramientas de planificación, sistemas de mercancía y reasignación, entre otros.\n• El enfoque de ventas: una estrategia clara de ventas puede ser un diferenciador para las empresas y un arma poderosa de competitividad.\n\nMantente al día respecto a cómo muchas compañías están agregando ambos aspectos a sus estrategias principales convirtiéndolos en puntos clave en su proceso de toma de decisiones.","tutor":"Maria Teresa Aranzabal","provider":"Coursera","language":"Spanish","skills":["spain","europe","distribution","channel management"],"subject":"Strategic Management","studentsInterested":"7","courseLink":"https://www.coursera.org/learn/canal-distribucion","classCentralLink":"https://www.class-central.com/course/coursera-gestion-del-canal-de-distribucion-y-retailing-5985"},{"title":"Introduction to Financial Markets","about":"Learn the general concepts of financial markets and economy. You will see the difference between primary and secondary markets and learn about markets for different products. You will also look at various economic Indicators and their influence on the markets. After completing this course, you will have a much stronger background of financial markets and ready to go to the next stage in the Specialization. This course is designed to help students with very little or no finance background to learn the basics of investments.","tutor":"Vaidya Nathan","provider":"Coursera","language":"English","skills":["india","economics","asia","financial markets"],"subject":"Finance","studentsInterested":"251","courseLink":"https://www.coursera.org/learn/financial-markets-intro","classCentralLink":"https://www.class-central.com/course/coursera-introduction-to-financial-markets-6178"},{"title":"Biases and Portfolio Selection","about":"Investors tend to be their own worst enemies. In this third course, you will learn how to capitalize on understanding behavioral biases and irrational behavior in financial markets. You will start by learning about the various behavioral biases – mistakes that investors make and understand their reasons. You will learn how to recognize your own mistakes as well as others’ and understand how these mistakes can affect investment decisions and financial markets. You will also explore how different preferences and investment horizons impact the optimal asset allocation choice.\n\nAfter this course, you will be more effective in overcoming biases to do the wrong things at the wrong times and tailoring an investment strategy that is best suited on your or your client’s profile and investment needs.","tutor":"Arzu Ozoguz","provider":"Coursera","language":"English","skills":["usa","north america","new-moocs-2017"],"subject":"Finance","studentsInterested":"47","courseLink":"https://www.coursera.org/learn/biases-portfolio-selection","classCentralLink":"https://www.class-central.com/course/coursera-biases-and-portfolio-selection-7037"},{"title":"Ethical Social Media","about":"Social media connects us across space and time, allowing us to find like-minded communities and participate creatively in public life as never before. We may often use social media without thinking much about the possible consequences. But there is a shadow side associated with social media use, which takes the form of hate speech, increased surveillance, lack of anonymity and questionable use of our data. What do we need to know to use social media spaces effectively, in a way that is safe and productive for all?\n\nThis course will guide you into a deeper exploration of online identity, social media communities and their users. You will examine the ways that social media is being used by public institutions such as government to build participation and conversation with audiences. You will encounter the most common ethical debates in social media.\n\nYou will also have the opportunity to build your practical skills by developing your professional social media profile, defining your audience, building your social media influence and understanding how to interpret data analytics to \"listen\" and communicate well.","tutor":"Dr Jonathon Hutchinson","provider":"Coursera","language":"English","skills":["australia"],"subject":"Marketing","studentsInterested":"109","courseLink":"https://www.coursera.org/learn/ethical-social-media","classCentralLink":"https://www.class-central.com/course/coursera-ethical-social-media-7020"},{"title":"Managing Uncertainty in Marketing Analytics","about":"Marketers must make the best decisions based on the information presented to them. Rarely will they have all the information necessary to predict what consumers will do with complete certainty. By incorporating uncertainty into the decisions that they make, they can anticipate a wide range of possible outcomes and recognize the extent of uncertainty on the decisions that they make. In Incorporating Uncertainty into Marketing Decisions, learners will become familiar with different methods to recognize sources of uncertainty that may affect the marketing decisions they ultimately make. We eschew specialized software and provide learners with the foundational knowledge they need to develop sophisticated marketing models in a basic spreadsheet environment. Topics include the development and application of Monte Carlo simulations, and the use of probability distributions to characterize uncertainty.","tutor":"David Schweidel","provider":"Coursera","language":"English","skills":["usa","north america"],"subject":"Marketing","studentsInterested":"70","courseLink":"https://www.coursera.org/learn/uncertainty-marketing-decisions","classCentralLink":"https://www.class-central.com/course/coursera-managing-uncertainty-in-marketing-analytics-6914"},{"title":"Visual Analytics with Tableau","about":"In this third course of the specialization, we’ll drill deeper into the tools Tableau offers in the areas of charting, dates, table calculations and mapping. We’ll explore the best choices for charts, based on the type of data you are using. We’ll look at specific types of charts including scatter plots, Gantt charts, histograms, bullet charts and several others, and we’ll address charting guidelines. We’ll define discrete and continuous dates, and examine when to use each one to explain your data. You’ll learn how to create custom and quick table calculations and how to create parameters. We’ll also introduce mapping and explore how Tableau can use different types of geographic data, how to connect to multiple data sources and how to create custom maps.","tutor":"Suk S. Brar, M.B.A.","provider":"Coursera","language":"English","skills":["usa","north america"],"subject":"Business Intelligence","studentsInterested":"53","courseLink":"https://www.coursera.org/learn/dataviz-visual-analytics","classCentralLink":"https://www.class-central.com/course/coursera-visual-analytics-with-tableau-7621"},{"title":"Quantitative Foundations for International Business","about":"This course provides the essential mathematics required to succeed in the finance and economics related modules of the Global MBA, including equations, functions, derivatives, and matrices. You can test your understanding with quizzes and worksheets, while more advanced content will be available if you want to push yourself.\n\nThis course forms part of a specialisation from the University of London designed to help you develop and build the essential business, academic, and cultural skills necessary to succeed in international business, or in further study.\n\nIf completed successfully, your certificate from this specialisation can also be used as part of the application process for the University of London Global MBA programme, particularly for early career applicants. If you would like more information about the Global MBA, please visit www.londoninternational.ac.uk/mba\n\nThis course is endorsed by CMI","tutor":"George Kapetanios","provider":"Coursera","language":"English","skills":["europe","england","new-moocs-2017"],"subject":"Business","studentsInterested":"76","courseLink":"https://www.coursera.org/learn/quantitative-foundations-international-business","classCentralLink":"https://www.class-central.com/course/coursera-quantitative-foundations-for-international-business-8042"},{"title":"IT Project Management","about":"The concepts and use of project management tools, techniques and methodologies are becoming all pervasive. This course addresses project management in the context of IT projects, including software projects. Using the framework of project life cycle, the course covers various aspects pertaining to (i) project initiation, (ii) project planning and scheduling, (iii) project monitoring and control, and (iv) project termination. For planning and scheduling of projects, the use of project network and estimation of time and cost are covered in detail. Scheduling of projects with resource limitations is covered next.\n\nRisk assessment methods including simulation and risk reduction approaches are also be covered. The students will be required to use the software @risk to simulate project completion times. The use of Earned Value Analysis for Project Monitoring and Control is emphasized. For Software Project Management, the Waterfall Model and Agile Project Management are covered in detail.","tutor":"M Rammohan Rao","provider":"Coursera","language":"English","skills":["india","asia","new-moocs-2017"],"subject":"Project Management","studentsInterested":"192","courseLink":"https://www.coursera.org/learn/it-project-management","classCentralLink":"https://www.class-central.com/course/coursera-it-project-management-7183"},{"title":"Leadership and Emotional Intelligence","about":"The digital age is dramatically reshaping the rules for organizational success. The new context demands renewal of your capabilities and development of different mindsets. In this course, you’ll learn the different components of emotional intelligence at work. For example, you’ll learn how you can work effectively in teams, build cooperative relationships with your key stakeholders, exercise effective influence, handle difficult conversations, and create energy and enthusiasm to foster meaningful change. Our modules will begin with powerful stories that are illustrative of typical challenges faced by front-line leaders. We’ll analyze the case illustration using the ideas from emotional intelligence theory, and highlight the key lessons that you should take away in terms of mindsets and skills that you should master to distinguish yourself as a leader.","tutor":"Ramnarayan Subramaniam","provider":"Coursera","language":"English","skills":["india","asia","new-moocs-2017"],"subject":"Management \u0026 Leadership","studentsInterested":"401","courseLink":"https://www.coursera.org/learn/emotional-intelligence-in-leadership","classCentralLink":"https://www.class-central.com/course/coursera-leadership-and-emotional-intelligence-7188"},{"title":"Construction Scheduling","about":"Learners will discover the key project scheduling techniques and procedures including; how to create a network diagram, how to define the importance of the critical path in a project network, and defining project activities float. Also covered are the fundamentals of Bar Charts, Precedence Diagrams, Activity on Arrow, PERT, Range Estimating, and linear project operations and the line of balance.","tutor":"Ibrahim Odeh, Ph.D., MBA","provider":"Coursera","language":"English","skills":["usa","north america"],"subject":"Business","studentsInterested":"704","courseLink":"https://www.coursera.org/learn/construction-scheduling","classCentralLink":"https://www.class-central.com/course/coursera-construction-scheduling-7114"},{"title":"Building High-Performing Teams","about":"Teams are essential to the modern organization, but most never reach their potential. Co-workers miscommunicate, and groups struggle to adapt to changes in the market or their organizations. When teams lack self-awareness about these challenges, performance suffers. Based on years of team culture research and consulting experience, this course helps you understand the problems that hurt productivity, and gives you tools for creating positive change. This course also guides you through creating the ground rules and structure needed to set your team up for success.\n\nYou gain the skills to diagnose issues such as conflicts, groupthink and lack of commitment in your team before they get out of control. The course offers frameworks to adjust team behaviors and get the best performance out of your people. You also understand frequent stumbling blocks for common team types, such as startups and virtual teams, and learn solutions tailored to each one.","tutor":"Derek Newberry, Ph.D. and Aviva Legatt, Ph.D.","provider":"Coursera","language":"English","skills":["usa","north america"],"subject":"Management \u0026 Leadership","studentsInterested":"750","courseLink":"https://www.coursera.org/learn/high-performing-teams","classCentralLink":"https://www.class-central.com/course/coursera-building-high-performing-teams-7121"},{"title":"Strategic Innovation: Building and Sustaining Innovative Organizations","about":"Innovation strategy is about creating unique value for consumers by delivering a great product that satisfies their needs and capturing value back from consumers.\n\nAt the core of a successful innovation strategy is a great product concept. Product is an all-encompassing term that includes physical goods, intangible services, and even ideas. There are three pillars to a successful product strategy: a clear understanding of (a) the target customers (WHO), (b) the specific elements of the product offering (WHAT) that satisfies consumer needs and dovetails with company capabilities, and (c) the tactical plans to reach end consumers (HOW). The value proposition has to be embedded in a coherent business model in order to create and capture value. But well-laid innovation plans can go awry without a consideration of the business ecosystem that includes competitors, collaborators, including suppliers, distributors, and retailers, or the contextual environment in which the company operates. In an interdependent world, fostering an integrated ecosystem is critically important for companies interested in maximizing the odds of innovation success.\n\nDrawing from many years of research, this course will offer a set of frameworks, tools, and concepts in order to develop innovative strategies in a holistic way so as to achieve leadership positions.","tutor":"Raj Echambadi","provider":"Coursera","language":"English","skills":["new-moocs-2017"],"subject":"Marketing","studentsInterested":"716","courseLink":"https://www.coursera.org/learn/strategic-innovation-building-and-sustaining-innovative-organizations","classCentralLink":"https://www.class-central.com/course/coursera-strategic-innovation-building-and-sustaining-innovative-organizations-8321"},{"title":"Market and Competition in Pricing Strategy","about":"If you haven’t considered what the competition is charging, you may not be maximizing your revenue. Spend time analyzing the market and you can influence price and improve margins. In this course, we\u0027ll show you how to implement competitive pricing and avoid common legal pitfalls of market-based pricing. You will also learn how to predict, influence and respond to competitors’ pricing moves. Led by Darden faculty and Boston Consulting Group global pricing experts, this course provides an in-depth understanding of market-based pricing and how to use it to capture more revenue.","tutor":"Jean Manuel Izaret, Ronald T. Wilcox and Thomas Kohler","provider":"Coursera","language":"English","skills":["new-moocs-2017"],"subject":"Marketing","studentsInterested":"85","courseLink":"https://www.coursera.org/learn/uva-darden-bcg-pricing-strategy-market-competition","classCentralLink":"https://www.class-central.com/course/coursera-market-and-competition-in-pricing-strategy-8352"},{"title":"A Business Approach to Sustainable Landscape Restoration","about":"Integrated landscape management and large-scale landscape restoration should be in every company’s business strategy because in order to reach the Sustainable Development Goal on Land Degradation Neutrality (SDG Number 15.3) scaling up and acceleration of business-driven landscape restoration is urgently needed.\n\nThis requires business professionals with a vision, the right knowledge and skills. This MOOC aims to train the next generation of business professionals and developers to acknowledge business’ interdependency with healthy landscapes and understand the value of ecosystem resources.\n\n“Historically, we have found countless ways to justify our continued exploitation of the environment: discovery, tradition, Manifest Destiny, even Chinese hoax. But we’re all out of excuses now. Each passing day swells the data on greenhouse gases and extreme weather, shrinking reservoirs and rising sea levels, and diminishing biodiversity. Our resources are finite, the window for change if not firmly shut, is certainly closing, and all life must adapt or be doomed.”\n\nTéa Obreht,\nThe New Yorker, Dec. 19\u002626, 2016, p. 106.\n\nIt is a frightening prospect indeed – that all life on Earth must either adapt or be doomed. This course is about landscape degradation – a global and wicked problem that is contributing to the dooming prospect of depletion of Earth’s finite resources. But this course is also about the solutions to this problem – business driven landscape restoration.\nSo rather than leaving you powerless with the prospect Obreht puts fowards above, it is our hope that you learn how you can be part of the solution to making sure that Planet Earth still provides a safe and habitable home for future generations.\nWe must act big and we must act now.\nWith this course we want to pass on valuable knowledge and teach you useful skills that you can apply in your professional life that will enable you to tackle the issue of landscape degradation and restoration.\nThe issue is urgent, so let’s dive right into it.\n\nThis MOOC is developed by the ENABLE partnership, which is co-funded by the ERASMUS+ programme of the European Commission and involves a diverse, international group of organizations including Rotterdam School of Management, Erasmus University, Commonland, United Nations University Land Restoration Training Programme, the Spanish National Research Council and Estoril Global Conferences.","tutor":"Nicola Favretto, Steve Kennedy, Rob van Tulder, Simon W. Moolenaar, Johann Thorsson, Ólafur Arnalds and Asa L. Aradottir","provider":"Coursera","language":"English","skills":["new-moocs-2017"],"subject":"Business","studentsInterested":"30","courseLink":"https://www.coursera.org/learn/landscape-restoration-sustainable-development","classCentralLink":"https://www.class-central.com/course/coursera-a-business-approach-to-sustainable-landscape-restoration-8547"},{"title":"Research Proposal: Initiating Research","about":"Market Research is a growing and important field that is used in many industries around the world. Given all the data that is collected whether by organizations, industries, social media, governments, etc., it’s important that someone can review and sift through all the noise to provide valuable insights. And that’s where you come in as a market researcher. This course will only scratch the surface and provide you a foundational understanding of this field.\n\nIn this course, you will be able to define market research and identify some tools used in the industry. You will be able to discuss the importance of secondary and internal research in terms of the planning process. You will be able to define what primary research is and identify the various ways to conduct primary research. You will be able to focus on an actual research plan or proposal for your peer review project. You will be able to compose a response to a request for a proposal or research plan and be able to address the various components of the proposal and package it in a professional manner.","tutor":"Jim Fong","provider":"Coursera","language":"English","skills":["market research","new-moocs-2017"],"subject":"Business Intelligence","studentsInterested":"96","courseLink":"https://www.coursera.org/learn/research-proposal-initiating-research","classCentralLink":"https://www.class-central.com/course/coursera-research-proposal-initiating-research-9095"},{"title":"Legal Tech \u0026 Startups","about":"LegalTech is the reaction to the disruption that technology is having across all sectors of the economy. Considering that the legal sector is one of the most resistant to change, due to its conservative nature, we can see just how different the future will be. In this course, IE professor Marti Manent will guide you through the essential stages of this disruption in technology, giving you the key tools and ideas to consider when starting your online business.\n\nIn the course, Marti explains the key market trends that you will encounter and will provide you with a handy practical toolbox. The course features interviews with industry professionals as well as very motivating and interesting lectures that will help you open your mind and better understand everything in the course. Be part of this disruption that technology is having in the legal sector and join Professor Marti during this exciting new course.","tutor":"Marti Manent","provider":"Coursera","language":"English","skills":["new-moocs-2017"],"subject":"Entrepreneurship","studentsInterested":"78","courseLink":"https://www.coursera.org/learn/legal-tech-startups","classCentralLink":"https://www.class-central.com/course/coursera-legal-tech-startups-8934"},{"title":"Budgeting essentials and development","about":"The Budgeting Essentials and Development course focus on an integrative and practical view of concepts, methods, and techniques to develop a budget.\n\nAfter finishing this course, learners will be able to:\n- Develop the budget with a broad view of the corporate functions;\n- Integrate the strategic guidelines into the discussions of budgeting process;\n- Structure the budget planning and development in a logical sequence\n- Coordinate the project of budget planning with the different areas of the company\n- Actively promote assumptions discussions to improve the process of developing the budget\n- Apply financial concepts to support the budget planning process\n- Design a budget monitoring and control model to support the performance management\n- Evaluate the performance of the company by managing the results and the budget\n\nIn this course, learners will have a deeper understanding of the budgeting process, its challenges, common issues, and approaches to mitigate the problems and improve the learning curve of budget planning.\nIt is integrative by emphasizing the transition between the corporate strategy and the budget. It is practical by following a structured process of going through a framework that illustrates and demonstrates how to analyze, develop and control the budget.","tutor":"Nelson Yoshida, Roberto Dumas Damas, Fernando Fleury, Samantha Mazzero and Alberto Sansiviero Jr.","provider":"Coursera","language":"English","skills":["finance","budgets","new-moocs-2017"],"subject":"Finance","studentsInterested":"54","courseLink":"https://www.coursera.org/learn/budgeting-essentials-development","classCentralLink":"https://www.class-central.com/course/coursera-budgeting-essentials-and-development-9350"},{"title":"Research Report: Delivering Insights","about":"You have completed all the hard work of conducting your internal, secondary, and primary research. You have analyzed all the data and are able to formulate insights and recommendations based on your research proposal. But what is the best way to present your findings and be able to make a decision?\n\nIn this course, you will discuss how to incorporate a story in your marketing presentation to help you capture the attention and gain support of stakeholders and business leaders. You will choose the most effective analytical method for delivering your insights and the best presentation method for your given audience. You will incorporate data visualization best practices and use tips and tricks when presenting to your various levels of decision makers and stakeholders.","tutor":"Robin Boyar and Ashwin Aravindakshan, PhD","provider":"Coursera","language":"English","skills":["marketing","research","data insights","new-moocs-2017"],"subject":"Marketing","studentsInterested":"66","courseLink":"https://www.coursera.org/learn/marketing-research-report","classCentralLink":"https://www.class-central.com/course/coursera-research-report-delivering-insights-9456"},{"title":"First Steps in Making the Business Case for Sustainability","about":"The Business School at the University of Colorado Denver wants to help you become a change agent for sustainable business. We hope that with the skills and concepts you gain from this specialization that you will help your business reduce its social and environmental impact. Being a change agent is hard. It takes courage and passion and knowledge. To implement change also requires being able to make the case for that change in terms that people in your company or organization respond to and understand.\n\nAfter completing the specialization, you will be able to:\n* Discuss the threats and opportunities that major global trends such as climate change present to businesses;\n* Identify ways a company can improve its environmental and social performance;\n* Evaluate and compare companies’ sustainability activities and products;\n* Develop a business case for implementing sustainability investments;\n* Identify key criteria of green businesses and product design;\n* Be a change agent in your organization;\n* Understand emerging topics in sustainable business, including those in the public policy space.\n\nWe\u0027re very excited about offering this MOOC specialization and hope it gives you the first step toward learning about and taking action to make the places you work and the products you buy more sustainable.\n\nSustainable business changes daily with new products, innovations and ideas, so you will be important in keeping the class current. We look forward to learning from you as you take this green journey!\n______","tutor":"John Byrd","provider":"Coursera","language":"English","skills":["sustainability","business","new-moocs-2017"],"subject":"Strategic Management","studentsInterested":"62","courseLink":"https://www.coursera.org/learn/sustainable-business","classCentralLink":"https://www.class-central.com/course/coursera-first-steps-in-making-the-business-case-for-sustainability-9463"},{"title":"Работа с клиентской базой и входящий маркетинг","about":"В третьем курсе специализации «Основы digital маркетинга» рассматриваются способы привлечения и удержания клиентов в цифровой среде: средства входящего маркетинга и инструменты маркетинга отношений.\nВходящий маркетинг – это первый шаг к генерации стабильного потока клиентов.\nИнтернет стал безграничным медиа-пространством. Нагрузка прерывающего (interruption) маркетинга на потребителей постоянно растет. Множество компаний одновременно стремятся отвлечь потребителя, заинтересовать своим предложением - будь то рекламный баннер или видеоролик.\nПсихологически и инструментально пользователи отгораживаются от рекламы. Предпочитают самостоятельно искать необходимую информацию. Отвергают агрессивное воздействие.\nНавязчивый исходящий маркетинг уступает место входящему – доверительному, который фокусируется на создании контента, соответствующего интересам целевой аудитории и подает его в тот момент, когда потребитель заинтересован в этом. Так потребитель становится нативно информированным, а компании успешно генерируют лиды и конвертируют их в покупателей.\nСредства входящего маркетинга включают поисковый маркетинг (SEM) и маркетинг в социальных медиа (SMO).\n- SEM предоставляет контент по конкретному запросу пользователя, оптимизируя сайты под поисковые машины и улучшая их индексацию (SEO). По сути он использует стратегию блиц-крига. Ту же цель преследует контекстная реклама, представленная в этом курсе инструментом автоматизированной закупки (Programmatic).\n- SMO, напротив, основан на взращивании клиентской базы, завоевании доверия и повышении авторитета. Эффект от него не так быстр, но более долговечен.\nОсновным инструментом маркетинга отношений является CRM-система. Она понимается нами как подход к ведению бизнеса, в котором клиент ставится во главу угла деятельности компании.\n- В компаниях, где разработана CRM-стратегия, потребности потребителя обладают наивысшим приоритетом, а бизнес-процессы и корпоративная культура настроены на удовлетворение этих потребностей.\nИтак, входящий маркетинг создает поток потенциальных потребителей, а CRM-система занимается развитием отношений, конвертирует лиды в покупателей, а нейтральных покупателей превращает в лояльных клиентов. Обо всем этом мы расскажем вам в деталях на курсе.\nКурс подготовлен командой российских экспертов digital рынка, готовых поделиться своими знаниями и опытом. Мы старались сделать курс максимально практичным и полезным для вас, по принципу «Берись и делай!»\nОт лица всей команды приветствую вас на курсе! И желаю высоких конверсий!\n\nТатьяна Комиссарова,\nДекан ВШМиРБ НИУ ВШЭ","tutor":"Таргашин Павел Анатольевич, Домашенко Валерий Юрьевич, Хлызова Евгения Сергеевна and Анищенко Татьяна Сергеевна","provider":"Coursera","language":"Russian","skills":["digital marketing","marketing","new-moocs-2017"],"subject":"Marketing","studentsInterested":"8","courseLink":"https://www.coursera.org/learn/klientskaya-basa-vkhodyaschii-marketing","classCentralLink":"https://www.class-central.com/course/coursera--------9519"},{"title":"Creating New BigQuery Datasets and Visualizing Insights","about":"This is the second course in the Data to Insights specialization. Here we will cover how to ingest new external datasets into BigQuery and visualize them with Google Data Studio. We will also cover intermediate SQL concepts like multi-table JOINs and UNIONs which will allow you to analyze data across multiple data sources.\n\nNote: Even if you have a background in SQL there are BigQuery specifics (like handling query cache and table wildcards) that may be new to you.","tutor":"Google Cloud Training","provider":"Coursera","language":"English","skills":["business intelligence","business analytics","google bigquery"],"subject":"Business Intelligence","studentsInterested":"16","courseLink":"https://www.coursera.org/learn/gcp-creating-bigquery-datasets-visualizing-insights","classCentralLink":"https://www.class-central.com/course/coursera-creating-new-bigquery-datasets-and-visualizing-insights-9672"},{"title":"Effective Sales – An Overview","about":"Welcome to Strategic Sales Management specialization.\nThis specialization course focus on providing conceptual and practical guidance on sales planning and management.\nThe development of the specialization goes through the different phases of the sales planning process, keeping attention on the connection to the strategy of the company.\nConcepts discussed in this specialization aim to support the analyses on how to plan sales in alignment with the strategic guidelines of the company. The sales functions are discussed with models and frameworks that support the planning process, which includes assumptions regarding the strategic guidelines, such as aggregate revenue targets, company’s earnings, and expected cash flow from the company’s operations. These variables are all related to the strategy of the company.\nThe target audience of this specialization include professionals with some experience in sales, they might have been promoted to a managing position recently, or they have plans to improve their expertise in the sales area to apply to more challenging positions in the future.\nPrerequisite for this specialization is general knowledge of business concepts, models, and tools. Professionals who have concluded undergraduate courses of business administration, and also of different areas of knowledge, such as engineering, economics, accounting, and social sciences.\nIt’s also important to emphasize that sales involve a broad range of areas, there are products and services related to agriculture, petrochemical, automobile, aeronautics, chemical, pharmaceutical, medical, insurance, education, retail, and consulting industries, just to mention some examples. That means sales professionals are from all sectors.\nTherefore, learners of different academic backgrounds may benefit from doing this specialization, which is structured to support sales planning and management from a methodological standpoint. And this approach applies to a diverse range of sectors.\nThe primary learning outcome of this specialization is the improvement of the sales planning and management competencies and skills, by providing a set of concepts, models, tools, and techniques to support the development of the sales plan structure, which will support the sale plan development.","tutor":"Nelson Yoshida, Samantha Mazzero, Cesar Rodrigues and Edson Ito","provider":"Coursera","language":"English","skills":["sales","planning"],"subject":"Business","studentsInterested":"14","courseLink":"https://www.coursera.org/learn/effective-sales-overview","classCentralLink":"https://www.class-central.com/course/coursera-effective-sales-an-overview-9728"},{"title":"Global Trends for Business and Society","about":"In this course, you’ll learn to analyze rapidly changing global trends, their effects on consumer and labor markets, financial systems, and geopolitical relationships among countries all over the world. Professor Mauro Guillen of the Wharton School has designed this course to help you understand the magnitude of influence these trends have on the business world and society. Through real-world case studies, both historical and contemporary, you’ll examine how changes within one society affect others. By the end of this course, you’ll have gained the tools to be able to identify, analyze, and adapt to global changes as they affect your business and society.","tutor":"Mauro Guillén","provider":"Coursera","language":"English","skills":["business","global trends","business strategy"],"subject":"Strategic Management","studentsInterested":"48","courseLink":"https://www.coursera.org/learn/wharton-global-trends-business","classCentralLink":"https://www.class-central.com/course/coursera-global-trends-for-business-and-society-9800"},{"title":"Financial Acumen for Non-Financial Managers","about":"In this course, you’ll explore how financial statement data and non-financial metrics can be linked to financial performance. Professors Rick Lambert and Chris Ittner of the Wharton School have designed this course to help you gain a practical understanding of how data is used to assess what drives financial performance and forecast future financial scenarios. You’ll learn more about the frameworks of financial reporting, income statements, and cash reporting, and apply different approaches to analyzing financial performance using real-life examples to see the concepts in action. By the end of this course, you’ll have honed your skills in understanding how financial data and non-financial data interact to forecast events and be able to determine the best financial strategy for your organization.","tutor":"Richard Lambert and Christopher D. Ittner","provider":"Coursera","language":"English","skills":["finance"],"subject":"Finance","studentsInterested":"105","courseLink":"https://www.coursera.org/learn/finance-healthcare-managers","classCentralLink":"https://www.class-central.com/course/coursera-financial-acumen-for-non-financial-managers-10797"},{"title":"Marketing Digital","about":"Aprenda a desenvolver a estratégia de marketing digital para a sua empresa ou startup, nesse curso você irá aprender sobre os principais pontos do Marketing como ROI, SEO, SEM, Testes AB e como gerenciar o funil de conversão e também como usar plataformas como Google adwords e Analytics, Facebook Ads e Email Marketing.\nEsse curso é ministrado por profissionais do mercado que vão apresentar como aplicar cada um dos conceitos com aulas teóricas e práticas.\n\nNeste curso serão abordados os seguintes temas:\nDiferença entre o marketing tradicional\nImportância do ROI e como calcular\nIntrodução a funil\nGoogle Analytics\nGoogle Adwords\nTipos de canais\nComo funciona SEM\nComo funciona SEO\nComo funciona Facebook Ads\nComo funciona Email Marketing\nConfigurando e planejando campanhas\nTestes AB\nComo escolher sua estratégia\nMetrificação e iteração\n\nAo final desse curso, esperamos que você esteja familiarizado com os principais conceitos, ferramentas e metodologias do marketing digital.\n\nNão deixe de ver as perguntas frequentes antes de se inscrever\n\nConheça os nossos outros cursos:\n- Criação de Startups: Como desenvolver negócios inovadores\nhttps://www.coursera.org/learn/criacao-startups\n- UX / UI: Fundamentos para o design de interface\nhttps://www.coursera.org/learn/ux-ui-design-de-interface\n- Consolidando empresas: Estrutura jurídica e financeira\nhttps://www.coursera.org/learn/consolidando-empresas\n- Inove na gestão de equipes e negócios: o crescimento da empresa\nhttps://www.coursera.org/learn/gestao-equipes-negocios\n- Marketing e vendas B2B: fechando novos negócios\nhttps://www.coursera.org/learn/marketing-vendas-b2b","tutor":"Artur Vilas Boas and André Leme Fleury","provider":"Coursera","language":"Portuguese","skills":["digital marketing","marketing","seo"],"subject":"Marketing","studentsInterested":"103","courseLink":"https://www.coursera.org/learn/estrategia-marketing-digital","classCentralLink":"https://www.class-central.com/course/coursera-marketing-digital-10711"},{"title":"Iniciação e Planejamento de Projetos","about":"Informações sobre o curso: O Programa de Cursos Integrados de Introdução aos Princípio se Práticas ae Gestão de Projetos é uma produção em parceria com a UC Irvine.\n\nProjetos bem-sucedidos exigem um planejamento cuidadoso. Neste curso, você aprenderá os principais papéis e responsabilidades do gestor de projeto e da equipe do projeto. Você também aprenderá a responder algumas questões chave para atingir os objetivos do projeto: o que este projeto realizará? Por que esse projeto é importante? Quem se beneficia desse projeto? Como planejaremos resultados positivos?\n\nAo completar este curso, você será capaz de:\n1. Identificar as principais características de um projeto\n2. Identificar as principais restrições de projeto\n3. Definir o papel e as responsabilidades do gestor de projeto\n4. Identificar estruturas organizacionais do projeto\n5. Compreender a definição de um stakeholder ou parte interessada do projeto\n6. Identificar as partes interessadas do projeto\n7. Identificar as necessidades de informação dos stakeholders do projeto\n8. Define as responsabilidades para gerir e controlar o engajamento dos stakeholders, ou partes interessadas\n9. Definir o propósito de usar um termo de abertura projeto\n10. Resumir os elementos-chave de um plano de projeto\n11. Identificar fontes comuns de conflito dentro de um ambiente de projeto\n12. Descrever a diferença entre autoridade e influência","tutor":"Tiely Zurlo Mognhol, Tassia Farssura Lima da Silva and Silvio Burrattino Melhado","provider":"Coursera","language":"Portuguese","skills":["project management"],"subject":"Project Management","studentsInterested":"16","courseLink":"https://www.coursera.org/learn/projeto-aplicado","classCentralLink":"https://www.class-central.com/course/coursera-iniciacao-e-planejamento-de-projetos-10723"}]