[{"title":"R Programming","about":"In this course you will learn how to program in R and how to use R for effective data analysis. You will learn how to install and configure software necessary for a statistical programming environment and describe generic programming language concepts as they are implemented in a high-level statistical language. The course covers practical issues in statistical computing which includes programming in R, reading data into R, accessing R packages, writing R functions, debugging, profiling R code, and organizing and commenting R code. Topics in statistical data analysis will provide working examples.","tutor":"Roger Peng","provider":"Coursera","language":"English","skills":["r programming","usa","north america"],"subject":"Data Science","studentsInterested":"1.6k","courseLink":"https://www.coursera.org/learn/r-programming","classCentralLink":"https://www.class-central.com/course/coursera-r-programming-1713"},{"title":"The Data Scientist’s Toolbox","about":"In this course you will get an introduction to the main tools and ideas in the data scientist\u0027s toolbox. The course gives an overview of the data, questions, and tools that data analysts and data scientists work with. There are two components to this course. The first is a conceptual introduction to the ideas behind turning data into actionable knowledge. The second is a practical introduction to the tools that will be used in the program like version control, markdown, git, GitHub, R, and RStudio.","tutor":"Jeff Leek","provider":"Coursera","language":"English","skills":["usa","north america"],"subject":"Data Science","studentsInterested":"1.4k","courseLink":"https://www.coursera.org/learn/data-scientists-tools","classCentralLink":"https://www.class-central.com/course/coursera-the-data-scientist-s-toolbox-1712"},{"title":"The Analytics Edge","about":"In the last decade, the amount of data available to organizations has reached unprecedented levels. Data is transforming business, social interactions, and the future of our society. In this course, you will learn how to use data and analytics to give an edge to your career and your life. We will examine real world examples of how analytics have been used to significantly improve a business or industry. These examples include Moneyball, eHarmony, the Framingham Heart Study, Twitter, IBM Watson, and Netflix. Through these examples and many more, we will teach you the following analytics methods: linear regression, logistic regression, trees, text analytics, clustering, visualization, and optimization. We will be using the statistical software R to build models and work with data. The contents of this course are essentially the same as those of the corresponding MIT class (The Analytics Edge). It is a challenging class, but it will enable you to apply analytics to real-world applications. \nThe class will consist of lecture videos, which are broken into small pieces, usually between 4 and 8 minutes each. After each lecture piece, we will ask you a “quick question” to assess your understanding of the material. There will also be a recitation, in which one of the teaching assistants will go over the methods introduced with a new example and data set. Each week will have a homework assignment that involves working in R or LibreOffice with various data sets. (R is a free statistical and computing software environment we’ll use in the course. See the Software FAQ below for more info). In the middle of the class, we will run an analytics competition, and at the end of the class there will be a final exam, which will be similar to the homework assignments.","tutor":"Dimitris Bertsimas","provider":"edX","language":"English","skills":["mitx"],"subject":"Data Science","studentsInterested":"7.8k","courseLink":"https://www.edx.org/course/analytics-edge-mitx-15-071x-3","classCentralLink":"https://www.class-central.com/course/edx-the-analytics-edge-1623"},{"title":"Getting and Cleaning Data","about":"Before you can work with data you have to get some. This course will cover the basic ways that data can be obtained. The course will cover obtaining data from the web, from APIs, from databases and from colleagues in various formats. It will also cover the basics of data cleaning and how to make data “tidy”. Tidy data dramatically speed downstream data analysis tasks. The course will also cover the components of a complete data set including raw data, processing instructions, codebooks, and processed data. The course will cover the basics needed for collecting, cleaning, and sharing data.","tutor":"Jeff Leek","provider":"Coursera","language":"English","skills":["usa","north america"],"subject":"Data Analysis","studentsInterested":"1.0k","courseLink":"https://www.coursera.org/learn/data-cleaning","classCentralLink":"https://www.class-central.com/course/coursera-getting-and-cleaning-data-1714"},{"title":"Exploratory Data Analysis","about":"This course covers the essential exploratory techniques for summarizing data. These techniques are typically applied before formal modeling commences and can help inform the development of more complex statistical models. Exploratory techniques are also important for eliminating or sharpening potential hypotheses about the world that can be addressed by the data. We will cover in detail the plotting systems in R as well as some of the basic principles of constructing data graphics. We will also cover some of the common multivariate statistical techniques used to visualize high-dimensional data.","tutor":"Roger Peng","provider":"Coursera","language":"English","skills":["usa","north america"],"subject":"Data Analysis","studentsInterested":"904","courseLink":"https://www.coursera.org/learn/exploratory-data-analysis","classCentralLink":"https://www.class-central.com/course/coursera-exploratory-data-analysis-1715"},{"title":"Python for Data Science","about":"In the information age, data is all around us. Within this data are answers to compelling questions across many societal domains (politics, business, science, etc.). But if you had access to a large dataset, would you be able to find the answers you seek?\nThis course, part of the Data Science MicroMasters program, will introduce you to a collection of powerful, open-source, tools needed to analyze data and to conduct data science. Specifically, you’ll learn how to use:\npython\njupyter notebooks\npandas\nnumpy\nmatplotlib\ngit\nand many other tools.\nYou will learn these tools all within the context of solving compelling data science problems.\nAfter completing this course, you’ll be able to find answers within large datasets by using python tools to import data, explore it, analyze it, learn from it, visualize it, and ultimately generate easily sharable reports. \nBy learning these skills, you’ll also become a member of a world-wide community which seeks to build data science tools, explore public datasets, and discuss evidence-based findings. Last but not least, this course will provide you with the foundation you need to succeed in later courses in the Data Science MicroMasters program.","tutor":"Ilkay Altintas and Leo Porter","provider":"edX","language":"English","skills":["uc san diegox"],"subject":"Data Science","studentsInterested":"1.6k","courseLink":"https://www.edx.org/course/python-for-data-science","classCentralLink":"https://www.class-central.com/course/edx-python-for-data-science-8209"},{"title":"Introduction to Big Data","about":"Interested in increasing your knowledge of the Big Data landscape? This course is for those new to data science and interested in understanding why the Big Data Era has come to be. It is for those who want to become conversant with the terminology and the core concepts behind big data problems, applications, and systems. It is for those who want to start thinking about how Big Data might be useful in their business or career. It provides an introduction to one of the most common frameworks, Hadoop, that has made big data analysis easier and more accessible -- increasing the potential for data to transform our world!\n\nAt the end of this course, you will be able to:\n\n* Describe the Big Data landscape including examples of real world big data problems including the three key sources of Big Data: people, organizations, and sensors.\n\n* Explain the V’s of Big Data (volume, velocity, variety, veracity, valence, and value) and why each impacts data collection, monitoring, storage, analysis and reporting.\n\n* Get value out of Big Data by using a 5-step process to structure your analysis.\n\n* Identify what are and what are not big data problems and be able to recast big data problems as data science questions.\n\n* Provide an explanation of the architectural components and programming models used for scalable big data analysis.\n\n* Summarize the features and value of core Hadoop stack components including the YARN resource and job management system, the HDFS file system and the MapReduce programming model.\n\n* Install and run a program using Hadoop!\n\nThis course is for those new to data science. No prior programming experience is needed, although the ability to install applications and utilize a virtual machine is necessary to complete the hands-on assignments.\n\nHardware Requirements:\n(A) Quad Core Processor (VT-x or AMD-V support recommended), 64-bit; (B) 8 GB RAM; (C) 20 GB disk free. How to find your hardware information: (Windows): Open System by clicking the Start button, right-clicking Computer, and then clicking Properties; (Mac): Open Overview by clicking on the Apple menu and clicking “About This Mac.” Most computers with 8 GB RAM purchased in the last 3 years will meet the minimum requirements.You will need a high speed internet connection because you will be downloading files up to 4 Gb in size.\n\nSoftware Requirements:\nThis course relies on several open-source software tools, including Apache Hadoop. All required software can be downloaded and installed free of charge. Software requirements include: Windows 7+, Mac OS X 10.10+, Ubuntu 14.04+ or CentOS 6+ VirtualBox 5+.","tutor":"Natasha Balac","provider":"Coursera","language":"English","skills":["big data","data science","usa","north america"],"subject":"Big Data","studentsInterested":"660","courseLink":"https://www.coursera.org/learn/big-data-introduction","classCentralLink":"https://www.class-central.com/course/coursera-introduction-to-big-data-4164"},{"title":"Introduction to Data Science in Python","about":"This course will introduce the learner to the basics of the python programming environment, including fundamental python programming techniques such as lambdas, reading and manipulating csv files, and the numpy library. The course will introduce data manipulation and cleaning techniques using the popular python pandas data science library and introduce the abstraction of the Series and DataFrame as the central data structures for data analysis, along with tutorials on how to use functions such as groupby, merge, and pivot tables effectively. By the end of this course, students will be able to take tabular data, clean it, manipulate it, and run basic inferential statistical analyses.\n\nThis course should be taken before any of the other Applied Data Science with Python courses: Applied Plotting, Charting \u0026 Data Representation in Python, Applied Machine Learning in Python, Applied Text Mining in Python, Applied Social Network Analysis in Python.","tutor":"Christopher Brooks, Kevyn Collins-Thompson, Daniel Romero and V. G. Vinod Vydiswaran","provider":"Coursera","language":"English","skills":["data science","python","data cleaning","usa","north america"],"subject":"Data Science","studentsInterested":"479","courseLink":"https://www.coursera.org/learn/python-data-analysis","classCentralLink":"https://www.class-central.com/course/coursera-introduction-to-data-science-in-python-6671"},{"title":"Regression Models","about":"Linear models, as their name implies, relates an outcome to a set of predictors of interest using linear assumptions. Regression models, a subset of linear models, are the most important statistical analysis tool in a data scientist’s toolkit. This course covers regression analysis, least squares and inference using regression models. Special cases of the regression model, ANOVA and ANCOVA will be covered as well. Analysis of residuals and variability will be investigated. The course will cover modern thinking on model selection and novel uses of regression models including scatterplot smoothing.","tutor":"Brian Caffo","provider":"Coursera","language":"English","skills":["usa","north america"],"subject":"Data Science","studentsInterested":"638","courseLink":"https://www.coursera.org/learn/regression-models","classCentralLink":"https://www.class-central.com/course/coursera-regression-models-1718"},{"title":"Statistical Inference","about":"Statistical inference is the process of drawing conclusions about populations or scientific truths from data. There are many modes of performing inference including statistical modeling, data oriented strategies and explicit use of designs and randomization in analyses. Furthermore, there are broad theories (frequentists, Bayesian, likelihood, design based, …) and numerous complexities (missing data, observed and unobserved confounding, biases) for performing inference. A practitioner can often be left in a debilitating maze of techniques, philosophies and nuance. This course presents the fundamentals of inference in a practical approach for getting things done. After taking this course, students will understand the broad directions of statistical inference and use this information for making informed choices in analyzing data.","tutor":"Brian Caffo","provider":"Coursera","language":"English","skills":["usa","north america"],"subject":"Data Science","studentsInterested":"657","courseLink":"https://www.coursera.org/learn/statistical-inference","classCentralLink":"https://www.class-central.com/course/coursera-statistical-inference-1717"},{"title":"Introduction to Computational Thinking and Data Science","about":"6.00.2x will teach you how to use computation to accomplish a variety of goals and provides you with a brief introduction to a variety of topics in computational problem solving . This course is aimed at students with some prior programming experience in Python and a rudimentary knowledge of computational complexity. You will spend a considerable amount of time writing programs to implement the concepts covered in the course. For example, you will write a program that will simulate a robot vacuum cleaning a room or will model the population dynamics of viruses replicating and drug treatments in a patient\u0027s body.\nTopics covered include:\nAdvanced programming in Python 3\nKnapsack problem, Graphs and graph optimization\nDynamic programming\nPlotting with the pylab package\nRandom walks\nProbability, Distributions\nMonte Carlo simulations\nCurve fitting\nStatistical fallacies","tutor":"Eric Grimson and John Guttag","provider":"edX","language":"English","skills":["mitx"],"subject":"Data Science","studentsInterested":"4.5k","courseLink":"https://www.edx.org/course/introduction-computational-thinking-data-mitx-6-00-2x-6","classCentralLink":"https://www.class-central.com/course/edx-introduction-to-computational-thinking-and-data-science-1779"},{"title":"Reproducible Research","about":"This course focuses on the concepts and tools behind reporting modern data analyses in a reproducible manner. Reproducible research is the idea that data analyses, and more generally, scientific claims, are published with their data and software code so that others may verify the findings and build upon them. The need for reproducibility is increasing dramatically as data analyses become more complex, involving larger datasets and more sophisticated computations. Reproducibility allows for people to focus on the actual content of a data analysis, rather than on superficial details reported in a written summary. In addition, reproducibility makes an analysis more useful to others because the data and code that actually conducted the analysis are available. This course will focus on literate statistical analysis tools which allow one to publish data analyses in a single document that allows others to easily execute the same analysis to obtain the same results.","tutor":"Roger Peng","provider":"Coursera","language":"English","skills":["usa","north america"],"subject":"Data Science","studentsInterested":"433","courseLink":"https://www.coursera.org/learn/reproducible-research","classCentralLink":"https://www.class-central.com/course/coursera-reproducible-research-1716"},{"title":"Mastering Data Analysis in Excel","about":"Important: The focus of this course is on math - specifically, data-analysis concepts and methods - not on Excel for its own sake. We use Excel to do our calculations, and all math formulas are given as Excel Spreadsheets, but we do not attempt to cover Excel Macros, Visual Basic, Pivot Tables, or other intermediate-to-advanced Excel functionality.\n\nThis course will prepare you to design and implement realistic predictive models based on data. In the Final Project (module 6) you will assume the role of a business data analyst for a bank, and develop two different predictive models to determine which applicants for credit cards should be accepted and which rejected. Your first model will focus on minimizing default risk, and your second on maximizing bank profits. The two models should demonstrate to you in a practical, hands-on way the idea that your choice of business metric drives your choice of an optimal model.\n\nThe second big idea this course seeks to demonstrate is that your data-analysis results cannot and should not aim to eliminate all uncertainty. Your role as a data-analyst is to reduce uncertainty for decision-makers by a financially valuable increment, while quantifying how much uncertainty remains. You will learn to calculate and apply to real-world examples the most important uncertainty measures used in business, including classification error rates, entropy of information, and confidence intervals for linear regression.\n\nAll the data you need is provided within the course, all assignments are designed to be done in MS Excel, and you will learn enough Excel to complete all assignments. The course will give you enough practice with Excel to become fluent in its most commonly used business functions, and you’ll be ready to learn any other Excel functionality you might need in the future (module 1).\n\nThe course does not cover Visual Basic or Pivot Tables and you will not need them to complete the assignments. All advanced concepts are demonstrated in individual Excel spreadsheet templates that you can use to answer relevant questions. You will emerge with substantial vocabulary and practical knowledge of how to apply business data analysis methods based on binary classification (module 2), information theory and entropy measures (module 3), and linear regression (module 4 and 5), all using no software tools more complex than Excel.","tutor":"Jana Schaich Borg and Daniel Egger","provider":"Coursera","language":"English","skills":["data analysis","microsoft excel","usa","north america"],"subject":"Data Analysis","studentsInterested":"550","courseLink":"https://www.coursera.org/learn/analytics-excel","classCentralLink":"https://www.class-central.com/course/coursera-mastering-data-analysis-in-excel-4310"},{"title":"Hadoop Platform and Application Framework","about":"This course is for novice programmers or business people who would like to understand the core tools used to wrangle and analyze big data. With no prior experience, you will have the opportunity to walk through hands-on examples with Hadoop and Spark frameworks, two of the most common in the industry. You will be comfortable explaining the specific components and basic processes of the Hadoop architecture, software stack, and execution environment. In the assignments you will be guided in how data scientists apply the important concepts and techniques such as Map-Reduce that are used to solve fundamental problems in big data. You\u0027ll feel empowered to have conversations about big data and the data analysis process.","tutor":"Natasha Balac, Paul Rodriguez and Andrea Zonca","provider":"Coursera","language":"English","skills":["python","usa","north america"],"subject":"Big Data","studentsInterested":"239","courseLink":"https://www.coursera.org/learn/hadoop","classCentralLink":"https://www.class-central.com/course/coursera-hadoop-platform-and-application-framework-4269"},{"title":"Introduction to R for Data Science","about":"This course is part of the Microsoft Professional Program Certificate in Data Science.\nR is rapidly becoming the leading language in data science and statistics. Today, R is the tool of choice for data science professionals in every industry and field. Whether you are full-time number cruncher, or just the occasional data analyst, R will suit your needs.\nThis introduction to R programming course will help you master the basics of R. In seven sections, you will cover its basic syntax, making you ready to undertake your own first data analysis using R. Starting from variables and basic operations, you will eventually learn how to handle data structures such as vectors, matrices, data frames and lists. In the final section, you will dive deeper into the graphical capabilities of R, and create your own stunning data visualizations. No prior knowledge in programming or data science is required.\nWhat makes this course unique is that you will continuously practice your newly acquired skills through interactive in-browser coding challenges using the DataCamp platform. Instead of passively watching videos, you will solve real data problems while receiving instant and personalized feedback that guides you to the correct solution.\nEnjoy!","tutor":"Filip Schouwenaars","provider":"edX","language":"English","skills":["microsoft"],"subject":"Data Science","studentsInterested":"2.1k","courseLink":"https://www.edx.org/course/introduction-r-data-science-microsoft-dat204x-7","classCentralLink":"https://www.class-central.com/course/edx-introduction-to-r-for-data-science-3928"},{"title":"Digital Analytics for Marketing Professionals: Marketing Analytics in Practice","about":"This course builds on the theory and foundations of marketing analytics and focuses on practical application by demystifying the use of data in marketing and helping you realize the power of visualizing data with artful use of numbers found in the digital space.\n\nThis course is part of the iMBA offered by the University of Illinois, a flexible, fully-accredited online MBA at an incredibly competitive price. For more information, please see the Resource page in this course and onlinemba.illinois.edu.","tutor":"Kevin Hartman","provider":"Coursera","language":"English","skills":["usa","north america"],"subject":"Data Analysis","studentsInterested":"983","courseLink":"https://www.coursera.org/learn/digital-analytics","classCentralLink":"https://www.class-central.com/course/coursera-digital-analytics-for-marketing-professionals-marketing-analytics-in-practice-2754"},{"title":"Whole genome sequencing of bacterial genomes - tools and applications","about":"This course will cover the topic of Whole genome sequencing (WGS) of bacterial genomes which is becoming more and more relevant for the medical sector. WGS technology and applications are high on international political agenda, as the classical methods are being replaced by WGS technology and therefore bioinformatic tools are extremely important for allowing the people working in this sector to be able to analyze the data and obtain results that can be interpreted and used for different purposes. The course will give the learners a basis to understand and be acquainted with WGS applications in surveillance of bacteria including species identification, typing and characterization of antimicrobial resistance and virulence traits as well as plasmid characterization. It will also give the opportunity to learners to learn about online tools and what they can be used for through demonstrations on how to use some of these tools and exercises to be solved by learners with use of freely available WGS analysis tools .\n\nBy the end of this course you should be able to:\n\n1. Describe the general Principles in typing of Bacteria\n2. Give examples of the applications of Whole Genome Sequencing to Surveillance of bacterial pathogens and antimicrobial resistance\n3. Apply genomic tools for sub-typing and surveillance\n4. Define the concept of Next-Generation Sequencing and describe the sequencing data from NGS\n5. Describe how to do de novo assembly from raw reads to contigs\n6. Enumerate the methods behind the tools for species identification, MLST typing and resistance gene detection\n7. Apply the tools for species identification, MLST typing and resistance gene detection in real cases of other bacterial and pathogen genomes.\n8. Describe the methods behind the tools for Salmonella and E.coli typing, plasmid replicon detection and plasmid typing\n9. Utilize the tools for Salmonella and E.coli typing, plasmid replicon detection and plasmid typing in real cases of other bacterial and pathogen genomes.\n10. Explain the concept and be able to use the integrated bacterial analysis pipeline for batch analysis and typing of genomic data\n11. Demonstrate how to construct phylogenetic tree based on SNPs\n12. Apply the phylogenetic tool to construct phylogenetic trees and explain the relatedness of bacterial or pathogen strains\n13. Describe how to create your own sequence database\n14. Utilize the MyDbFinder tool to detect genetic markers of interest from whole genome sequencing","tutor":"Lina Cavaco and Pimlapas Leekitcharoenphon","provider":"Coursera","language":"English","skills":["epidemiology","genome sequencing","new-moocs-2017"],"subject":"Bioinformatics","studentsInterested":"469","courseLink":"https://www.coursera.org/learn/wgs-bacteria","classCentralLink":"https://www.class-central.com/course/coursera-whole-genome-sequencing-of-bacterial-genomes-tools-and-applications-8907"},{"title":"Pattern Discovery in Data Mining","about":"Learn the general concepts of data mining along with basic methodologies and applications. Then dive into one subfield in data mining: pattern discovery. Learn in-depth concepts, methods, and applications of pattern discovery in data mining. We will also introduce methods for data-driven phrase mining and some interesting applications of pattern discovery. This course provides you the opportunity to learn skills and content to practice and engage in scalable pattern discovery methods on massive transactional data, discuss pattern evaluation measures, and study methods for mining diverse kinds of patterns, sequential patterns, and sub-graph patterns.","tutor":"Jiawei Han","provider":"Coursera","language":"English","skills":["usa","north america"],"subject":"Data Mining","studentsInterested":"291","courseLink":"https://www.coursera.org/learn/data-patterns","classCentralLink":"https://www.class-central.com/course/coursera-pattern-discovery-in-data-mining-2733"},{"title":"Mining Massive Datasets","about":"We introduce the participant to modern distributed file systems and MapReduce, including what distinguishes good MapReduce algorithms from good algorithms in general.  The rest of the course is devoted to algorithms for extracting models and information from large datasets.  Participants will learn how Google\u0027s PageRank algorithm models importance of Web pages and some of the many extensions that have been used for a variety of purposes.  We\u0027ll cover locality-sensitive hashing, a bit of magic that allows you to find similar items in a set of items so large you cannot possibly compare each pair.  When data is stored as a very large, sparse matrix, dimensionality reduction is often a good way to model the data, but standard approaches do not scale well; we\u0027ll talk about efficient approaches.  Many other large-scale algorithms are covered as well, as outlined in the course syllabus.","tutor":"Jure Leskovec, Anand Rajaraman, Jeff Ullman and","provider":"Stanford OpenEdx","language":"English","skills":["data mining","usa","north america"],"subject":"Data Mining","studentsInterested":"4.3k","courseLink":"https://lagunita.stanford.edu/courses/course-v1:ComputerScience+MMDS+SelfPaced/about","classCentralLink":"https://www.class-central.com/course/stanford-openedx-mining-massive-datasets-2406"},{"title":"A Crash Course in Data Science","about":"By now you have definitely heard about data science and big data. In this one-week class, we will provide a crash course in what these terms mean and how they play a role in successful organizations. This class is for anyone who wants to learn what all the data science action is about, including those who will eventually need to manage data scientists. The goal is to get you up to speed as quickly as possible on data science without all the fluff. We\u0027ve designed this course to be as convenient as possible without sacrificing any of the essentials.\n\nThis is a focused course designed to rapidly get you up to speed on the field of data science. Our goal was to make this as convenient as possible for you without sacrificing any essential content. We\u0027ve left the technical information aside so that you can focus on managing your team and moving it forward.\n\nAfter completing this course you will know.\n\n1. How to describe the role data science plays in various contexts\n2. How statistics, machine learning, and software engineering play a role in data science\n3. How to describe the structure of a data science project\n4. Know the key terms and tools used by data scientists\n5. How to identify a successful and an unsuccessful data science project\n3. The role of a data science manager\n\n\nCourse cover image by r2hox. Creative Commons BY-SA: https://flic.kr/p/gdMuhT","tutor":"Jeff Leek, Brian Caffo and Roger Peng","provider":"Coursera","language":"English","skills":["data science","usa","north america"],"subject":"Data Science","studentsInterested":"394","courseLink":"https://www.coursera.org/learn/data-science-course","classCentralLink":"https://www.class-central.com/course/coursera-a-crash-course-in-data-science-4392"},{"title":"Data Visualization","about":"Learn the general concepts of data mining along with basic methodologies and applications. Then dive into one subfield in data mining: pattern discovery. Learn in-depth concepts, methods, and applications of pattern discovery in data mining. We will also introduce methods for pattern-based classification and some interesting applications of pattern discovery. This course provides you the opportunity to learn skills and content to practice and engage in scalable pattern discovery methods on massive transactional data, discuss pattern evaluation measures, and study methods for mining diverse kinds of patterns, sequential patterns, and sub-graph patterns.","tutor":"John Hart","provider":"Coursera","language":"English","skills":["usa","north america"],"subject":"Data Visualization","studentsInterested":"554","courseLink":"https://www.coursera.org/learn/datavisualization","classCentralLink":"https://www.class-central.com/course/coursera-data-visualization-2737"},{"title":"Developing Data Products","about":"A data product is the production output from a statistical analysis. Data products automate complex analysis tasks or use technology to expand the utility of a data informed model, algorithm or inference. This course covers the basics of creating data products using Shiny, R packages, and interactive graphics. The course will focus on the statistical fundamentals of creating a data product that can be used to tell a story about data to a mass audience.","tutor":"Brian Caffo","provider":"Coursera","language":"English","skills":["usa","north america"],"subject":"Data Science","studentsInterested":"519","courseLink":"https://www.coursera.org/learn/data-products","classCentralLink":"https://www.class-central.com/course/coursera-developing-data-products-1720"},{"title":"Finding Hidden Messages in DNA (Bioinformatics I)","about":"Named a top 50 MOOC of all time by Class Central!\n\nThis course begins a series of classes illustrating the power of computing in modern biology. Please join us on the frontier of bioinformatics to look for hidden messages in DNA without ever needing to put on a lab coat.\n\nIn the first half of the course, we investigate DNA replication, and ask the question, where in the genome does DNA replication begin? We will see that we can answer this question for many bacteria using only some straightforward algorithms to look for hidden messages in the genome.\n\nIn the second half of the course, we examine a different biological question, when we ask which DNA patterns play the role of molecular clocks. The cells in your body manage to maintain a circadian rhythm, but how is this achieved on the level of DNA? Once again, we will see that by knowing which hidden messages to look for, we can start to understand the amazingly complex language of DNA. Perhaps surprisingly, we will apply randomized algorithms, which roll dice and flip coins in order to solve problems.\n\nFinally, you will get your hands dirty and apply existing software tools to find recurring biological motifs within genes that are responsible for helping Mycobacterium tuberculosis go \"dormant\" within a host for many years before causing an active infection.","tutor":"Pavel Pevzner and Phillip Compeau","provider":"Coursera","language":"English","skills":["usa","north america"],"subject":"Bioinformatics","studentsInterested":"3.1k","courseLink":"https://www.coursera.org/learn/dna-analysis","classCentralLink":"https://www.class-central.com/course/coursera-finding-hidden-messages-in-dna-bioinformatics-i-3289"},{"title":"Algorithms for DNA Sequencing","about":"We will learn computational methods -- algorithms and data structures -- for analyzing DNA sequencing data. We will learn a little about DNA, genomics, and how DNA sequencing is used. We will use Python to implement key algorithms and data structures and to analyze real genomes and DNA sequencing datasets.","tutor":"Ben Langmead and Jacob Pritt","provider":"Coursera","language":"English","skills":["python","usa","north america"],"subject":"Bioinformatics","studentsInterested":"3.0k","courseLink":"https://www.coursera.org/learn/dna-sequencing","classCentralLink":"https://www.class-central.com/course/coursera-algorithms-for-dna-sequencing-3433"},{"title":"Process Mining: Data science in Action","about":"Process mining is the missing link between model-based process analysis and data-oriented analysis techniques. Through concrete data sets and easy to use software the course provides data science knowledge that can be applied directly to analyze and improve processes in a variety of domains.\n\nData science is the profession of the future, because organizations that are unable to use (big) data in a smart way will not survive. It is not sufficient to focus on data storage and data analysis. The data scientist also needs to relate data to process analysis. Process mining bridges the gap between traditional model-based process analysis (e.g., simulation and other business process management techniques) and data-centric analysis techniques such as machine learning and data mining. Process mining seeks the confrontation between event data (i.e., observed behavior) and process models (hand-made or discovered automatically). This technology has become available only recently, but it can be applied to any type of operational processes (organizations and systems). Example applications include: analyzing treatment processes in hospitals, improving customer service processes in a multinational, understanding the browsing behavior of customers using booking site, analyzing failures of a baggage handling system, and improving the user interface of an X-ray machine. All of these applications have in common that dynamic behavior needs to be related to process models. Hence, we refer to this as \"data science in action\".\n\nThe course explains the key analysis techniques in process mining. Participants will learn various process discovery algorithms. These can be used to automatically learn process models from raw event data. Various other process analysis techniques that use event data will be presented. Moreover, the course will provide easy-to-use software, real-life data sets, and practical skills to directly apply the theory in a variety of application domains.\n\nThis course starts with an overview of approaches and technologies that use event data to support decision making and business process (re)design. Then the course focuses on process mining as a bridge between data mining and business process modeling. The course is at an introductory level with various practical assignments.\n\nThe course covers the three main types of process mining.\n\n1. The first type of process mining is discovery. A discovery technique takes an event log and produces a process model without using any a-priori information. An example is the Alpha-algorithm that takes an event log and produces a process model (a Petri net) explaining the behavior recorded in the log.\n\n2. The second type of process mining is conformance. Here, an existing process model is compared with an event log of the same process. Conformance checking can be used to check if reality, as recorded in the log, conforms to the model and vice versa.\n\n3. The third type of process mining is enhancement. Here, the idea is to extend or improve an existing process model using information about the actual process recorded in some event log. Whereas conformance checking measures the alignment between model and reality, this third type of process mining aims at changing or extending the a-priori model. An example is the extension of a process model with performance information, e.g., showing bottlenecks. Process mining techniques can be used in an offline, but also online setting. The latter is known as operational support. An example is the detection of non-conformance at the moment the deviation actually takes place. Another example is time prediction for running cases, i.e., given a partially executed case the remaining processing time is estimated based on historic information of similar cases.\n\nProcess mining provides not only a bridge between data mining and business process management; it also helps to address the classical divide between \"business\" and \"IT\". Evidence-based business process management based on process mining helps to create a common ground for business process improvement and information systems development.\n\nThe course uses many examples using real-life event logs to illustrate the concepts and algorithms. After taking this course, one is able to run process mining projects and have a good understanding of the Business Process Intelligence field.\n\nAfter taking this course you should:\n- have a good understanding of Business Process Intelligence techniques (in particular process mining),\n- understand the role of Big Data in today’s society,\n- be able to relate process mining techniques to other analysis techniques such as simulation, business intelligence, data mining, machine learning, and verification,\n- be able to apply basic process discovery techniques to learn a process model from an event log (both manually and using tools),\n- be able to apply basic conformance checking techniques to compare event logs and process models (both manually and using tools),\n- be able to extend a process model with information extracted from the event log (e.g., show bottlenecks),\n- have a good understanding of the data needed to start a process mining project,\n- be able to characterize the questions that can be answered based on such event data,\n- explain how process mining can also be used for operational support (prediction and recommendation), and\n- be able to conduct process mining projects in a structured manner.","tutor":"Wil van der Aalst","provider":"Coursera","language":"English","skills":["europe","data analysis","netherlands"],"subject":"Data Mining","studentsInterested":"2.2k","courseLink":"https://www.coursera.org/learn/process-mining","classCentralLink":"https://www.class-central.com/course/coursera-process-mining-data-science-in-action-2445"},{"title":"Intro to Hadoop and MapReduce","about":"The Apache™ Hadoop® project develops open-source software for reliable, scalable, distributed computing. Learn the fundamental principles behind it, and how you can use its power to make sense of your Big Data.\n\n\nWhy Take This Course?\nHow Hadoop fits into the world (recognize the problems it solves)\nUnderstand the concepts of HDFS and MapReduce (find out how it solves the problems)\nWrite MapReduce programs (see how we solve the problems)\nPractice solving problems on your own","tutor":"Ian Wrigley and Sarah Sproehnle","provider":"Udacity","language":"English","skills":["big data","hadoop","mapreduce"],"subject":"Big Data","studentsInterested":"935","courseLink":"https://www.udacity.com/course/intro-to-hadoop-and-mapreduce--ud617","classCentralLink":"https://www.class-central.com/course/udacity-intro-to-hadoop-and-mapreduce-1470"},{"title":"Data Analysis with R","about":"Exploratory data analysis is an approach for summarizing and visualizing the important characteristics of a data set. Promoted by John Tukey, exploratory data analysis focuses on exploring data to understand the data’s underlying structure and variables, to develop intuition about the data set, to consider how that data set came into existence, and to decide how it can be investigated with more formal statistical methods.\nIf you\u0027re interested in supplemental reading material for the course check out the Exploratory Data Analysis book. (Not Required)\nThis course is also a part of our Data Analyst Nanodegree.\n\n\nWhy Take This Course?\nYou will...\nUnderstand data analysis via EDA as a journey and a way to explore data\nExplore data at multiple levels using appropriate visualizations\nAcquire statistical knowledge for summarizing data\nDemonstrate curiosity and skepticism when performing data analysis\nDevelop intuition around a data set and understand how the data was generated.","tutor":"Moira Burke and Dean Eckles","provider":"Udacity","language":"English","skills":["r programming"],"subject":"Data Analysis","studentsInterested":"7.0k","courseLink":"https://www.udacity.com/course/data-analysis-with-r--ud651","classCentralLink":"https://www.class-central.com/course/udacity-data-analysis-with-r-1478"},{"title":"Statistical Thinking for Data Science and Analytics","about":"This statistics and data analysis course will pave the statistical foundation for our discussion on data science.\nYou will learn how data scientists exercise statistical thinking in designing data collection, derive insights from visualizing data, obtain supporting evidence for data-based decisions and construct models for predicting future trends from data.","tutor":"Eva Ascarza , James Curley , Andrew Gelman , Lauren Hannah, David Madigan and Tian Zheng","provider":"edX","language":"English","skills":["columbiax"],"subject":"Data Science","studentsInterested":"391","courseLink":"https://www.edx.org/course/statistical-thinking-data-science-columbiax-ds101x-1","classCentralLink":"https://www.class-central.com/course/edx-statistical-thinking-for-data-science-and-analytics-4913"},{"title":"Introduction to Python for Data Science","about":"This course is part of the Microsoft Professional Program Certificate in Data Science.\nPython is a very powerful programming language used for many different applications. Over time, the huge community around this open source language has created quite a few tools to efficiently work with Python. In recent years, a number of tools have been built specifically for data science. As a result, analyzing data with Python has never been easier.\nIn this practical course, you will start from the very beginning, with basic arithmetic and variables, and learn how to handle data structures, such as Python lists, Numpy arrays, and Pandas DataFrames. Along the way, you’ll learn about Python functions and control flow. Plus, you’ll look at the world of data visualizations with Python and create your own stunning visualizations based on real data.","tutor":"Filip Schouwenaars","provider":"edX","language":"English","skills":["microsoft"],"subject":"Data Science","studentsInterested":"324","courseLink":"https://www.edx.org/course/introduction-python-data-science-microsoft-dat208x-8","classCentralLink":"https://www.class-central.com/course/edx-introduction-to-python-for-data-science-5683"},{"title":"Genomic Data Science with Galaxy","about":"Learn to use the tools that are available from the Galaxy Project. This is the second course in the Genomic Big Data Science Specialization.","tutor":"James Taylor","provider":"Coursera","language":"English","skills":["big data","data science","genomics","usa","north america"],"subject":"Bioinformatics","studentsInterested":"95","courseLink":"https://www.coursera.org/learn/galaxy-project","classCentralLink":"https://www.class-central.com/course/coursera-genomic-data-science-with-galaxy-3473"},{"title":"Python for Genomic Data Science","about":"This class provides an introduction to the Python programming language and the iPython notebook. This is the third course in the Genomic Big Data Science Specialization from Johns Hopkins University.","tutor":"Mihaela Pertea and Steven Salzberg","provider":"Coursera","language":"English","skills":["python","usa","north america"],"subject":"Bioinformatics","studentsInterested":"186","courseLink":"https://www.coursera.org/learn/python-genomics","classCentralLink":"https://www.class-central.com/course/coursera-python-for-genomic-data-science-3476"},{"title":"Statistics and R","about":"We will learn the basics of statistical inference in order to understand and compute p-values and confidence intervals, all while analyzing data with R. We provide R programming examples in a way that will help make the connection between concepts and implementation. Problem sets requiring R programming will be used to test understanding and ability to implement basic data analyses. We will use visualization techniques to explore new data sets and determine the most appropriate approach. We will describe robust statistical techniques as alternatives when data do not fit assumptions required by the standard approaches. By using R scripts to analyze data, you will learn the basics of conducting reproducible research.\nGiven the diversity in educational background of our students we have divided the series into seven parts. You can take the entire series or individual courses that interest you. If you are a statistician you should consider skipping the first two or three courses, similarly, if you are biologists you should consider skipping some of the introductory biology lectures. Note that the statistics and programming aspects of the class ramp up in difficulty relatively quickly across the first three courses. By the third course will be teaching advanced statistical concepts such as hierarchical models and by the fourth advanced software engineering skills, such as parallel computing and reproducible research concepts.\nThese courses make up 2 XSeries and are self-paced:\nPH525.1x: Statistics and R for the Life Sciences\nPH525.2x: Introduction to Linear Models and Matrix Algebra","tutor":"Michael Love and Rafael Irizarry","provider":"edX","language":"English","skills":["harvardx"],"subject":"Data Science","studentsInterested":"1.1k","courseLink":"https://www.edx.org/course/statistics-r-harvardx-ph525-1x-1","classCentralLink":"https://www.class-central.com/course/edx-statistics-and-r-2960"},{"title":"Building a Data Science Team","about":"Data science is a team sport. As a data science executive it is your job to recruit, organize, and manage the team to success. In this one-week course, we will cover how you can find the right people to fill out your data science team, how to organize them to give them the best chance to feel empowered and successful, and how to manage your team as it grows.\n\nThis is a focused course designed to rapidly get you up to speed on the process of building and managing a data science team. Our goal was to make this as convenient as possible for you without sacrificing any essential content. We\u0027ve left the technical information aside so that you can focus on managing your team and moving it forward.\n\nAfter completing this course you will know.\n\n1. The different roles in the data science team including data scientist and data engineer\n2. How the data science team relates to other teams in an organization\n3. What are the expected qualifications of different data science team members\n4. Relevant questions for interviewing data scientists\n5. How to manage the onboarding process for the team\n6. How to guide data science teams to success\n7. How to encourage and empower data science teams\n\nCommitment: 1 week of study, 4-6 hours\n\nCourse cover image by JaredZammit. Creative Commons BY-SA. https://flic.kr/p/5vuWZz","tutor":"Jeff Leek, Brian Caffo and Roger Peng","provider":"Coursera","language":"English","skills":["data science","leadership","team building","usa","north america"],"subject":"Data Science","studentsInterested":"143","courseLink":"https://www.coursera.org/learn/build-data-science-team","classCentralLink":"https://www.class-central.com/course/coursera-building-a-data-science-team-4391"},{"title":"Introduction to Genomic Technologies","about":"This course introduces you to the basic biology of modern genomics and the experimental tools that we use to measure it. We\u0027ll introduce the Central Dogma of Molecular Biology and cover how next-generation sequencing can be used to measure DNA, RNA, and epigenetic patterns. You\u0027ll also get an introduction to the key concepts in computing and data science that you\u0027ll need to understand how data from next-generation sequencing experiments are generated and analyzed.\n\nThis is the first course in the Genomic Data Science Specialization.","tutor":"Steven Salzberg, Jeff Leek and James Taylor","provider":"Coursera","language":"English","skills":["big data","data science","genomics","usa","north america"],"subject":"Bioinformatics","studentsInterested":"260","courseLink":"https://www.coursera.org/learn/introduction-genomics","classCentralLink":"https://www.class-central.com/course/coursera-introduction-to-genomic-technologies-3472"},{"title":"Data Science in Real Life","about":"Have you ever had the perfect data science experience? The data pull went perfectly. There were no merging errors or missing data. Hypotheses were clearly defined prior to analyses. Randomization was performed for the treatment of interest. The analytic plan was outlined prior to analysis and followed exactly. The conclusions were clear and actionable decisions were obvious. Has that every happened to you? Of course not. Data analysis in real life is messy. How does one manage a team facing real data analyses? In this one-week course, we contrast the ideal with what happens in real life. By contrasting the ideal, you will learn key concepts that will help you manage real life analyses.\n\nThis is a focused course designed to rapidly get you up to speed on doing data science in real life. Our goal was to make this as convenient as possible for you without sacrificing any essential content. We\u0027ve left the technical information aside so that you can focus on managing your team and moving it forward.\n\nAfter completing this course you will know how to:\n\n1, Describe the “perfect” data science experience\n2. Identify strengths and weaknesses in experimental designs\n3. Describe possible pitfalls when pulling / assembling data and learn solutions for managing data pulls.\n4. Challenge statistical modeling assumptions and drive feedback to data analysts\n5. Describe common pitfalls in communicating data analyses\n6. Get a glimpse into a day in the life of a data analysis manager.\n\nThe course will be taught at a conceptual level for active managers of data scientists and statisticians. Some key concepts being discussed include:\n1. Experimental design, randomization, A/B testing\n2. Causal inference, counterfactuals,\n3. Strategies for managing data quality.\n4. Bias and confounding\n5. Contrasting machine learning versus classical statistical inference\n\nCourse promo:\nhttps://www.youtube.com/watch?v\u003d9BIYmw5wnBI\n\nCourse cover image by Jonathan Gross. Creative Commons BY-ND https://flic.kr/p/q1vudb","tutor":"Jeff Leek, Brian Caffo and Roger Peng","provider":"Coursera","language":"English","skills":["data analytics","usa","north america"],"subject":"Data Science","studentsInterested":"233","courseLink":"https://www.coursera.org/learn/real-life-data-science","classCentralLink":"https://www.class-central.com/course/coursera-data-science-in-real-life-4389"},{"title":"DCO042 - Python For Informatics","about":"This is a course to teach basic Python programming skills through data analysis. The book and course materials are all free and licensed as Creative Commons. There is no complex math in the course, the programs are generally quite short, and the workload is no more than a few hours per week. By the time you complete the course, you will understand be able to read, parse, and manipulate data using Python. Hopefully at the end of the course you will like programming well enough to take another course in programming or web development. You can register and launch, take the course, and earn your place on the map at any time and at your own pace","tutor":"Charles Severance","provider":"Independent","language":"English","skills":["usa","north america"],"subject":"Bioinformatics","studentsInterested":"4.5k","courseLink":"https://online.dr-chuck.com/index.php","classCentralLink":"https://www.class-central.com/course/dco042-python-for-informatics-1010"},{"title":"Text Mining and Analytics","about":"This course will cover the major techniques for mining and analyzing text data to discover interesting patterns, extract useful knowledge, and support decision making, with an emphasis on statistical approaches that can be generally applied to arbitrary text data in any natural language with no or minimum human effort.\n\nDetailed analysis of text data requires understanding of natural language text, which is known to be a difficult task for computers. However, a number of statistical approaches have been shown to work well for the \"shallow\" but robust analysis of text data for pattern finding and knowledge discovery. You will learn the basic concepts, principles, and major algorithms in text mining and their potential applications.","tutor":"ChengXiang Zhai","provider":"Coursera","language":"English","skills":["usa","north america"],"subject":"Data Mining","studentsInterested":"394","courseLink":"https://www.coursera.org/learn/text-mining","classCentralLink":"https://www.class-central.com/course/coursera-text-mining-and-analytics-2736"},{"title":"Intro to Data Science","about":"The Introduction to Data Science class will survey the foundational topics in data science, namely:\nData Manipulation\nData Analysis with Statistics and Machine Learning\nData Communication with Information Visualization\nData at Scale -- Working with Big Data\nThe class will focus on breadth and present the topics briefly instead of focusing on a single topic in depth. This will give you the opportunity to sample and apply the basic techniques of data science.\nThis course is also a part of our Data Analyst Nanodegree.\n\n\nWhy Take This Course?\nYou will have an opportunity to work through a data science project end to end, from analyzing a dataset to visualizing and communicating your data analysis.\nThrough working on the class project, you will be exposed to and understand the skills that are needed to become a data scientist yourself.","tutor":"Dave Holtz","provider":"Udacity","language":"English","skills":["python"],"subject":"Data Science","studentsInterested":"1.5k","courseLink":"https://www.udacity.com/course/intro-to-data-science--ud359","classCentralLink":"https://www.class-central.com/course/udacity-intro-to-data-science-1480"},{"title":"Explore Statistics with R","about":"Do you want to learn how to harvest health science data from the Internet? Or learn to understand the world through data analysis? Start by learning R Statistics!\nSkilled professionals who can process and analyze data are in great demand today. In this course you will explore concepts in statistics to make sense out of data. You will learn the practical skills necessary to find, import, analyze and visualize data. We will take a look under the hood of statistics and equip you with broad tools for understanding statistical inference and statistical methods. You will also perform some really complicated calculations and visualizations, following in the footsteps of Karolinska Institute’s researchers.\nStatistical programming is an essential skill in our golden age of data abundance. Health science has become a field of big data, just like so many other fields of study. New techniques make it possible and affordable to generate massive data sets in biology. Researchers and clinicians can measure the activity for each of 30000 genes of a patient. They can read the complete genome sequence of a patient. Thanks to another trend of the decade, open access publishing, the results of such large scale health science are very often published for you to read free of charge. You can even access the raw data from open databases such as the gene expression database of the NCBI, National Center for Biotechnology Information.\nWe will dive into this data together. Learn how to use R, a powerful open source statistical programming language, and see why it has become the tool of choice in many industries in this introductory R statistics course. ","tutor":"Andreas Montelius","provider":"edX","language":"English","skills":["kix"],"subject":"Data Science","studentsInterested":"296","courseLink":"https://www.edx.org/course/explore-statistics-r-kix-kiexplorx-0","classCentralLink":"https://www.class-central.com/course/edx-explore-statistics-with-r-1836"},{"title":"Data Analysis: Take It to the MAX()","about":"EX101x is for all of those struggling with data analysis. That crazy data collection from your boss? Megabytes of sensor data to analyze? Looking for a smart way visualize your data in order to make sense out of it? We’ve got you covered!\nUsing video lectures and hands-on exercises, we will teach you cutting-edge techniques and best practices that will boost your data analysis and visualization skills.\nWe will take a deep dive into data analysis with spreadsheets: PivotTables, VLOOKUPS, Named ranges, what-if analyses, making great graphs - all those will be covered in the first weeks of the course. After that, we will investigate the quality of the spreadsheet model, and especially how to make sure your spreadsheet remains error-free and robust.\nFinally, once we have mastered spreadsheets, we will demonstrate other ways to store and analyze data. We will also look into how Python, a programming language, can help us with analyzing and manipulating data in spreadsheets.\nEX101x is created using Excel 2013 and Windows. Most assignments can be made using another spreadsheet program and operating system as well, but we cannot offer full support for all configurations.\nThe goal of this course is to help you to overcome data analysis challenges in your work, research or studies. Therefore we encourage you to participate actively and to raise real data analysis problems that you face in our discussion forums. ","tutor":"Felienne Hermans","provider":"edX","language":"English","skills":["delftx"],"subject":"Data Analysis","studentsInterested":"262","courseLink":"https://www.edx.org/course/data-analysis-take-it-max-delftx-ex101x-2","classCentralLink":"https://www.class-central.com/course/edx-data-analysis-take-it-to-the-max-2916"},{"title":"Data Visualization and Communication with Tableau","about":"One of the skills that characterizes great business data analysts is the ability to communicate practical implications of quantitative analyses to any kind of audience member. Even the most sophisticated statistical analyses are not useful to a business if they do not lead to actionable advice, or if the answers to those business questions are not conveyed in a way that non-technical people can understand.\n\nIn this course you will learn how to become a master at communicating business-relevant implications of data analyses. By the end, you will know how to structure your data analysis projects to ensure the fruits of your hard labor yield results for your stakeholders. You will also know how to streamline your analyses and highlight their implications efficiently using visualizations in Tableau, the most popular visualization program in the business world. Using other Tableau features, you will be able to make effective visualizations that harness the human brain’s innate perceptual and cognitive tendencies to convey conclusions directly and clearly. Finally, you will be practiced in designing and persuasively presenting business “data stories” that use these visualizations, capitalizing on business-tested methods and design principles.","tutor":"Daniel Egger and Jana Schaich Borg","provider":"Coursera","language":"English","skills":["data visualization","tableau","data stories","usa","north america"],"subject":"Data Visualization","studentsInterested":"485","courseLink":"https://www.coursera.org/learn/analytics-tableau","classCentralLink":"https://www.class-central.com/course/coursera-data-visualization-and-communication-with-tableau-4297"},{"title":"Command Line Tools for Genomic Data Science","about":"Introduces to the commands that you need to manage and analyze directories, files, and large sets of genomic data. This is the fourth course in the Genomic Big Data Science Specialization from Johns Hopkins University.","tutor":"Liliana Florea","provider":"Coursera","language":"English","skills":["big data","data science","genomics","usa","north america"],"subject":"Bioinformatics","studentsInterested":"106","courseLink":"https://www.coursera.org/learn/genomic-tools","classCentralLink":"https://www.class-central.com/course/coursera-command-line-tools-for-genomic-data-science-3474"},{"title":"Applied Data Science: An Introduction","about":"As the world\u0027s data grow exponentially, organizations across all sectors, including government and not-for-profit, need to understand, manage and use big, complex data sets—known as big data.","tutor":"Jeffrey Stanton","provider":"Open Education by Blackboard","language":"English","skills":["usa","north america"],"subject":"Data Science","studentsInterested":"3.1k","courseLink":"https://www.coursesites.com/webapps/Bb-sites-course-creation-BBLEARN/courseHomepage.htmlx?course_id\u003d_276927_1","classCentralLink":"https://www.class-central.com/course/open-education-by-blackboard-applied-data-science-an-introduction-1806"},{"title":"Data Management and Visualization","about":"Whether being used to customize advertising to millions of website visitors or streamline inventory ordering at a small restaurant, data is becoming more integral to success. Too often, we’re not sure how use data to find answers to the questions that will make us more successful in what we do. In this course, you will discover what data is and think about what questions you have that can be answered by the data – even if you’ve never thought about data before. Based on existing data, you will learn to develop a research question, describe the variables and their relationships, calculate basic statistics, and present your results clearly. By the end of the course, you will be able to use powerful data analysis tools – either SAS or Python – to manage and visualize your data, including how to deal with missing data, variable groups, and graphs. Throughout the course, you will share your progress with others to gain valuable feedback, while also learning how your peers use data to answer their own questions.","tutor":"Lisa Dierker and Jen Rose","provider":"Coursera","language":"English","skills":["data analysis","data visualization","usa","north america"],"subject":"Data Visualization","studentsInterested":"482","courseLink":"https://www.coursera.org/learn/data-visualization","classCentralLink":"https://www.class-central.com/course/coursera-data-management-and-visualization-4184"},{"title":"人群与网络","about":"本课程是北京大学开设的一门在线跨学科选修课程，主要面向信息技术、社会学和经济学等专业的本科生。课程内容涉及用计算思维的方法讨论社会学和经济学的一些经典问题。学习运用计算思维分析社会学、经济学问题的方法，加深对某些生活现象的理解，体会计算与社会科学的互动。\nLearn to analyze and reason about problems in social sciences with computational thinking, appreciate interactions between computing and social sciences, as well as gain deeper understanding of some common phenomena in life and society","tutor":"李晓明 （Li Xiaoming）, 邱泽奇 （Qiu Zeqi） and 王卫红（Wang Weihong）","provider":"Coursera","language":"Chinese","skills":["network analysis","china","data analysis","asia"],"subject":"Data Science","studentsInterested":"6","courseLink":"https://www.coursera.org/learn/renqun-wangluo","classCentralLink":"https://www.class-central.com/course/coursera--4189"},{"title":"Aplicando el análisis de datos: casos selectos","about":"En este curso integrarás lo aprendido en los cursos que componen esta especialidad. A partir de la resolución de casos en diferentes industrias representativas, utilizarás el módulo de ensamble en Watson Analytics a efecto de conjuntar la información que obtengas en la exploración y las predicciones realizadas con tus datos. El producto final es un informe de negocio con dashboards e infográficos interactivos que explicarán el problema de negocio en estos casos selectos.\n\nAgradecemos a Fundación Televisa por su participación en la producción de este curso; con lo cual colabora a inspirar y desarrollar el potencial de las personas, a través de su compromiso con la educación y la cultura.","tutor":"José Antonio Espín Brito","provider":"Coursera","language":"Spanish","skills":["data analysis","business intelligence","mexico","north america"],"subject":"Data Science","studentsInterested":"44","courseLink":"https://www.coursera.org/learn/analisis-de-datos-aplicaciones","classCentralLink":"https://www.class-central.com/course/coursera-aplicando-el-analisis-de-datos-casos-selectos-4660"},{"title":"Genome Assembly Programming Challenge","about":"In Spring 2011, thousands of people in Germany were hospitalized with a deadly disease that started as food poisoning with bloody diarrhea and often led to kidney failure. It was the beginning of the deadliest outbreak in recent history, caused by a mysterious bacterial strain that we will refer to as E. coli X. Soon, German officials linked the outbreak to a restaurant in Lübeck, where nearly 20% of the patrons had developed bloody diarrhea in a single week. At this point, biologists knew that they were facing a previously unknown pathogen and that traditional methods would not suffice – computational biologists would be needed to assemble and analyze the genome of the newly emerged pathogen.\n\nTo investigate the evolutionary origin and pathogenic potential of the outbreak strain, researchers started a crowdsourced research program. They released bacterial DNA sequencing data from one of a patient, which elicited a burst of analyses carried out by computational biologists on four continents. They even used GitHub for the project: https://github.com/ehec-outbreak-crowdsourced/BGI-data-analysis/wiki\n\nThe 2011 German outbreak represented an early example of epidemiologists collaborating with computational biologists to stop an outbreak. In this Genome Assembly Programming Challenge, you will follow in the footsteps of the bioinformaticians investigating the outbreak by developing a program to assemble the genome of the E. coli X from millions of overlapping substrings of the E.coli X genome.","tutor":"Alexander S. Kulikov","provider":"Coursera","language":"English","skills":["algorithms","genomics","capstone","programming","usa","north america"],"subject":"Bioinformatics","studentsInterested":"14","courseLink":"https://www.coursera.org/learn/assembling-genomes","classCentralLink":"https://www.class-central.com/course/coursera-genome-assembly-programming-challenge-5606"},{"title":"Sampling People, Networks and Records","about":"Good data collection is built on good samples. But the samples can be chosen in many ways. Samples can be haphazard or convenient selections of persons, or records, or networks, or other units, but one questions the quality of such samples, especially what these selection methods mean for drawing good conclusions about a population after data collection and analysis is done. Samples can be more carefully selected based on a researcher’s judgment, but one then questions whether that judgment can be biased by personal factors. Samples can also be draw in statistically rigorous and careful ways, using random selection and control methods to provide sound representation and cost control. It is these last kinds of samples that will be discussed in this course. We will examine simple random sampling that can be used for sampling persons or records, cluster sampling that can be used to sample groups of persons or records or networks, stratification which can be applied to simple random and cluster samples, systematic selection, and stratified multistage samples. The course concludes with a brief overview of how to estimate and summarize the uncertainty of randomized sampling.","tutor":"James M Lepkowski","provider":"Coursera","language":"English","skills":["data analysis","data collection","usa","north america","new-moocs-2017"],"subject":"Data Analysis","studentsInterested":"58","courseLink":"https://www.coursera.org/learn/sampling-methods","classCentralLink":"https://www.class-central.com/course/coursera-sampling-people-networks-and-records-6084"},{"title":"Basic Data Descriptors, Statistical Distributions, and Application to Business Decisions","about":"The ability to understand and apply Business Statistics is becoming increasingly important in the industry. A good understanding of Business Statistics is a requirement to make correct and relevant interpretations of data. Lack of knowledge could lead to erroneous decisions which could potentially have negative consequences for a firm. This course is designed to introduce you to Business Statistics. We begin with the notion of descriptive statistics, which is summarizing data using a few numbers. Different categories of descriptive measures are introduced and discussed along with the Excel functions to calculate them. The notion of probability or uncertainty is introduced along with the concept of a sample and population data using relevant business examples. This leads us to various statistical distributions along with their Excel functions which are then used to model or approximate business processes. You get to apply these descriptive measures of data and various statistical distributions using easy-to-follow Excel based examples which are demonstrated throughout the course.\n\nTo successfully complete course assignments, students must have access to Microsoft Excel.\n________________________________________\nWEEK 1\nModule 1: Basic Data Descriptors\nIn this module you will get to understand, calculate and interpret various descriptive or summary measures of data. These descriptive measures summarize and present data using a few numbers. Appropriate Excel functions to do these calculations are introduced and demonstrated.\n\nTopics covered include:\n• Categories of descriptive data\n• Measures of central tendency, the mean, median, mode, and their interpretations and calculations\n• Measures of spread-in-data, the range, interquartile-range, standard deviation and variance\n• Box plots\n• Interpreting the standard deviation measure using the rule-of-thumb and Chebyshev’s theorem\n________________________________________\nWEEK 2\nModule 2: Descriptive Measures of Association, Probability, and Statistical Distributions\nThis module presents the covariance and correlation measures and their respective Excel functions. You get to understand the notion of causation versus correlation. The module then introduces the notion of probability and random variables and starts introducing statistical distributions.\n\nTopics covered include:\n• Measures of association, the covariance and correlation measures; causation versus correlation\n• Probability and random variables; discrete versus continuous data\n• Introduction to statistical distributions\n________________________________________\nWEEK 3\nModule 3: The Normal Distribution\nThis module introduces the Normal distribution and the Excel function to calculate probabilities and various outcomes from the distribution.\n\nTopics covered include:\n• Probability density function and area under the curve as a measure of probability\n• The Normal distribution (bell curve), NORM.DIST, NORM.INV functions in Excel\n________________________________________\nWEEK 4\nModule 4: Working with Distributions, Normal, Binomial, Poisson\nIn this module, you\u0027ll see various applications of the Normal distribution. You will also get introduced to the Binomial and Poisson distributions. The Central Limit Theorem is introduced and explained in the context of understanding sample data versus population data and the link between the two.\n\nTopics covered include:\n• Various applications of the Normal distribution\n• The Binomial and Poisson distributions\n• Sample versus population data; the Central Limit Theorem","tutor":"Sharad Borle","provider":"Coursera","language":"English","skills":["usa","north america"],"subject":"Data Science","studentsInterested":"65","courseLink":"https://www.coursera.org/learn/descriptive-statistics-statistical-distributions-business-application","classCentralLink":"https://www.class-central.com/course/coursera-basic-data-descriptors-statistical-distributions-and-application-to-business-decisions-7025"},{"title":"Creating Dashboards and Storytelling with Tableau","about":"Leveraging the visualizations you created in the previous course, Visual Analytics with Tableau, you will create dashboards that help you identify the story within your data, and you will discover how to use Storypoints to create a powerful story to leave a lasting impression with your audience.\n\nYou will balance the goals of your stakeholders with the needs of your end-users, and be able to structure and organize your story for maximum impact. Throughout the course you will apply more advanced functions within Tableau, such as hierarchies, actions and parameters to guide user interactions. For your final project, you will create a compelling narrative to be delivered in a meeting, as a static report, or in an interactive display online.","tutor":"Govind Acharya and Suk S. Brar, M.B.A.","provider":"Coursera","language":"English","skills":["usa","north america","new-moocs-2017"],"subject":"Data Science","studentsInterested":"79","courseLink":"https://www.coursera.org/learn/dataviz-dashboards","classCentralLink":"https://www.class-central.com/course/coursera-creating-dashboards-and-storytelling-with-tableau-6806"},{"title":"Building Data Visualization Tools","about":"The data science revolution has produced reams of new data from a wide variety of new sources. These new datasets are being used to answer new questions in way never before conceived. Visualization remains one of the most powerful ways draw conclusions from data, but the influx of new data types requires the development of new visualization techniques and building blocks. This course provides you with the skills for creating those new visualization building blocks. We focus on the ggplot2 framework and describe how to use and extend the system to suit the specific needs of your organization or team. Upon completing this course, learners will be able to build the tools needed to visualize a wide variety of data types and will have the fundamentals needed to address new data types as they come about.","tutor":"Roger D. Peng, PhD and Brooke Anderson","provider":"Coursera","language":"English","skills":["usa","north america"],"subject":"Data Visualization","studentsInterested":"94","courseLink":"https://www.coursera.org/learn/r-data-visualization","classCentralLink":"https://www.class-central.com/course/coursera-building-data-visualization-tools-7176"},{"title":"Python Data Visualization","about":"This if the final course in the specialization which builds upon the knowledge learned in Python Programming Essentials, Python Data Representations, and Python Data Analysis. We will learn how to install external packages for use within Python, acquire data from sources on the Web, and then we will clean, process, analyze, and visualize that data. This course will combine the skills learned throughout the specialization to enable you to write interesting, practical, and useful programs.\n\nBy the end of the course, you will be comfortable installing Python packages, analyzing existing data, and generating visualizations of that data. This course will complete your education as a scripter, enabling you to locate, install, and use Python packages written by others. You will be able to effectively utilize tools and packages that are widely available to amplify your effectiveness and write useful programs.","tutor":"Scott Rixner and Joe Warren","provider":"Coursera","language":"English","skills":["python","data analysis","data visualization","new-moocs-2017"],"subject":"Data Analysis","studentsInterested":"123","courseLink":"https://www.coursera.org/learn/python-visualization","classCentralLink":"https://www.class-central.com/course/coursera-python-data-visualization-9552"},{"title":"Введение в биоинформатику (Introduction to Bioinformatics)","about":"Курс «Введение в биоинформатику» адресован тем, кто хочет получить расширенное представление о том, что такое биоинформатика и как она помогает биологам и медикам в их работе.\n\n\nThe course is aimed at those who would like to have a better idea of what bioinformatics is and how it helps biologists and medical scientists in research and clinical work.","tutor":"Алла Лапидус","provider":"Coursera","language":"Russian","skills":["russia"],"subject":"Bioinformatics","studentsInterested":"68","courseLink":"https://www.coursera.org/learn/bioinformatika","classCentralLink":"https://www.class-central.com/course/coursera----introduction-to-bioinformatics-1390"},{"title":"Cluster Analysis in Data Mining","about":"Discover the basic concepts of cluster analysis, and then study a set of typical clustering methodologies, algorithms, and applications. This includes partitioning methods such as k-means, hierarchical methods such as BIRCH, and density-based methods such as DBSCAN/OPTICS. Moreover, learn methods for clustering validation and evaluation of clustering quality. Finally, see examples of cluster analysis in applications.","tutor":"Jiawei Han","provider":"Coursera","language":"English","skills":["usa","north america"],"subject":"Data Mining","studentsInterested":"257","courseLink":"https://www.coursera.org/learn/cluster-analysis","classCentralLink":"https://www.class-central.com/course/coursera-cluster-analysis-in-data-mining-2735"},{"title":"医学统计学与SPSS软件（基础篇）","about":"本课程适用于医学各专业的学生以及医疗卫生工作者。 课程包括基础统计学方法及SPSS软件应用：绪论、统计描述、t检验、方差分析、卡方检验、直线回归与相关、秩和检验。通过本课程的学习，学生能掌握医学统计学的基本方法及SPSS软件的应用技能，培养统计思维能力，并在医学科研工作中能灵活地、正确地运用统计学。","tutor":"何 平平","provider":"Coursera","language":"Chinese","skills":["china","asia"],"subject":"Data Science","studentsInterested":"10","courseLink":"https://www.coursera.org/learn/spss-ruanjian","classCentralLink":"https://www.class-central.com/course/coursera-spss--3226"},{"title":"Uso de técnicas estadísticas para el análisis de datos","about":"Con frecuencia, en tu actividad profesional te enfrentas con la necesidad de analizar una gran cantidad de datos con el propósito de identificar si existe alguna relación entre ellos y de esta forma contar con información valiosa que te permita poder tomar una decisión.\n\nLos datos con los cuales se genera la información, además de requerir de un apropiado tratamiento, demandan también de una adecuada técnica para su análisis.\n\nEn este curso serás capaz de conocer y utilizar distintas técnicas basadas en el análisis estadístico con un enfoque hacia la inteligencia de negocios (Business Intelligence), los cuales te permitirán crear modelos para mejorar la comprensión de cómo los datos se relacionan con la población subyacente, validar el modelo y emplear el análisis predictivo para evaluar escenarios factibles encaminados a orientar tus decisiones futuras.\n\nAl finalizar este curso habrás desarrollado la capacidad de utilizar distintas técnicas para la construcción y evaluación de modelos que con base en criterios de desempeño preestablecidos te permitirán aprovechar el valor de los datos.\n\nAgradecemos a Fundación Televisa por su participación en la producción de este curso; con lo cual colabora a inspirar y desarrollar el potencial de las personas, a través de su compromiso con la educación y la cultura.","tutor":"Dr. José Rodolfo Torres Matus","provider":"Coursera","language":"Spanish","skills":["data analysis","business intelligence","mexico","north america"],"subject":"Data Science","studentsInterested":"111","courseLink":"https://www.coursera.org/learn/datos-tecnicas","classCentralLink":"https://www.class-central.com/course/coursera-uso-de-tecnicas-estadisticas-para-el-analisis-de-datos-4654"},{"title":"Capstone: Create Value from Open Data","about":"The Capstone project is an individual assignment.\nParticipants decide the theme they want to explore and define the issue they want to solve. Their “playing field” should provide data from various sectors (such as farming and nutrition, culture, economy and employment, Education \u0026 Research, International \u0026 Europe, Housing, Sustainable, Development \u0026 Energies, Health \u0026 Social, Society, Territories \u0026 Transport). Participants are encouraged to mix the different fields and leverage the existing information with other (properly sourced) open data sets.\n\nDeliverable 1 is the preliminary preparation and problem qualification step. The objectives is to define the what, why \u0026 how. What issue do we want to solve? Why does it promise value for public authorities, companies, citizens? How do we want to explore the provided data?\n\nFor Deliverable 2, the participant needs to present the intermediary outputs and adjustments to the analysis framework. The objectives is to confirm the how and the relevancy of the first results.\n\nFinally, with Deliverable 3, the participant needs to present the final outputs and the value case. The objective is to confirm the why. Why will it create value for public authorities, companies, and citizens.\n\nAssessment and grading: the participants will present their results to their peers on a regular basis. An evaluation framework will be provided for the participants to assess the quality of each other’s deliverables.","tutor":"Nicolas Glady","provider":"Coursera","language":"English","skills":["europe","data analysis","capstone","france","open data"],"subject":"Data Analysis","studentsInterested":"9","courseLink":"https://www.coursera.org/learn/strategic-business-analytics-capstone","classCentralLink":"https://www.class-central.com/course/coursera-capstone-create-value-from-open-data-5094"},{"title":"Математика и Python для анализа данных","about":"Анализ данных и машинное обучение существенно опираются на результаты из математического анализа, линейной алгебры, методов оптимизации, теории вероятностей. Без фундаментальных знаний по этим наукам невозможно понимать, как устроены методы анализа данных. Задача этого курса — сформировать такой фундамент. Мы обойдёмся без сложных формул и доказательств и сделаем упор на интерпретации и понимании смысла математических понятий и объектов.\n\nДля успешного применения методов анализа данных нужно уметь программировать. Фактическим стандартом для этого в наши дни является язык Python. В данном курсе мы предлагаем познакомиться с его синтаксисом, а также научиться работать с его основными библиотеками, полезными для анализа данных, например, NumPy, SciPy, Matplotlib и Pandas.","tutor":"Евгений Соколов, Эмели Драль, Виктор Кантор and Евгений Рябенко","provider":"Coursera","language":"Russian","skills":["python","machine learning","russia","data analysis","numpy"],"subject":"Data Science","studentsInterested":"34","courseLink":"https://www.coursera.org/learn/mathematics-and-python","classCentralLink":"https://www.class-central.com/course/coursera---python----5525"},{"title":"Social Media Data Analytics","about":"Learner Outcomes: After taking this course, you will be able to:\n- Utilize various Application Programming Interface (API) services to collect data from different social media sources such as YouTube, Twitter, and Flickr.\n- Process the collected data - primarily structured - using methods involving correlation, regression, and classification to derive insights about the sources and people who generated that data.\n- Analyze unstructured data - primarily textual comments - for sentiments expressed in them.\n- Use different tools for collecting, analyzing, and exploring social media data for research and development purposes.\n\nSample Learner Story: Data analyst wanting to leverage social media data.\nIsabella is a Data Analyst working as a consultant for a multinational corporation. She has experience working with Web analysis tools as well as marketing data. She wants to now expand into social media arena, trying to leverage the vast amounts of data available through various social media channels. Specifically, she wants to see how their clients, partners, and competitors view their products/services and talk about them. She hopes to build a new workflow of data analytics that incorporates traditional data processing using Web and marketing tools, as well as newer methods of using social media data.\n\nSample Job Roles requiring these skills:\n- Social Media Analyst\n- Web Analyst\n- Data Analyst\n- Marketing and Public Relations\n\nFinal Project Deliverable/ Artifact: The course will have a series of small assignments or mini-projects that involve data collection, analysis, and presentation involving various social media sources using the techniques learned in the class.","tutor":"Chirag Shah","provider":"Coursera","language":"English","skills":["usa","north america"],"subject":"Data Analysis","studentsInterested":"182","courseLink":"https://www.coursera.org/learn/social-media-data-analytics","classCentralLink":"https://www.class-central.com/course/coursera-social-media-data-analytics-7019"},{"title":"Leveraging Unstructured Data with Cloud Dataproc on Google Cloud Platform","about":"This 1-week, accelerated course builds upon previous courses in the Data Engineering on Google Cloud Platform specialization. Through a combination of video lectures, demonstrations, and hands-on labs, you\u0027ll learn how to create and manage computing clusters to run Hadoop, Spark, Pig and/or Hive jobs on Google Cloud Platform. You will also learn how to access various cloud storage options from their compute clusters and integrate Google’s machine learning capabilities into their analytics programs.\n\nIn the hands-on labs, you will create and manage Dataproc Clusters using the Web Console and the CLI, and use cluster to run Spark and Pig jobs. You will then create iPython notebooks that integrate with BigQuery and storage and utilize Spark. Finally, you integrate the machine learning APIs into your data analysis.\n\nPre-requisites\n• Google Cloud Platform Big Data \u0026 Machine Learning Fundamentals (or equivalent experience)\n• Some knowledge of Python","tutor":"Google Cloud Training","provider":"Coursera","language":"English","skills":["big data","machine learning","apache spark","google cloud","new-moocs-2017"],"subject":"Big Data","studentsInterested":"32","courseLink":"https://www.coursera.org/learn/leveraging-unstructured-data-dataproc-gcp","classCentralLink":"https://www.class-central.com/course/coursera-leveraging-unstructured-data-with-cloud-dataproc-on-google-cloud-platform-8757"},{"title":"Genomic Data Science and Clustering (Bioinformatics V)","about":"How do we infer which genes orchestrate various processes in the cell? How did humans migrate out of Africa and spread around the world? In this class, we will see that these two seemingly different questions can be addressed using similar algorithmic and machine learning techniques arising from the general problem of dividing data points into distinct clusters.\n\nIn the first half of the course, we will introduce algorithms for clustering a group of objects into a collection of clusters based on their similarity, a classic problem in data science, and see how these algorithms can be applied to gene expression data.\n\nIn the second half of the course, we will introduce another classic tool in data science called principal components analysis that can be used to preprocess multidimensional data before clustering in an effort to greatly reduce the number dimensions without losing much of the \"signal\" in the data.\n\nFinally, you will learn how to apply popular bioinformatics software tools to solve a real problem in clustering.","tutor":"Pavel Pevzner and Phillip Compeau","provider":"Coursera","language":"English","skills":["bioinformatics","clustering","usa","north america"],"subject":"Bioinformatics","studentsInterested":"147","courseLink":"https://www.coursera.org/learn/genomic-data","classCentralLink":"https://www.class-central.com/course/coursera-genomic-data-science-and-clustering-bioinformatics-v-3556"},{"title":"Managing Data Analysis","about":"This one-week course describes the process of analyzing data and how to manage that process. We describe the iterative nature of data analysis and the role of stating a sharp question, exploratory data analysis, inference, formal statistical modeling, interpretation, and communication. In addition, we will describe how to direct analytic activities within a team and to drive the data analysis process towards coherent and useful results.\n\nThis is a focused course designed to rapidly get you up to speed on the process of data analysis and how it can be managed. Our goal was to make this as convenient as possible for you without sacrificing any essential content. We\u0027ve left the technical information aside so that you can focus on managing your team and moving it forward.\n\nAfter completing this course you will know how to….\n\n1. Describe the basic data analysis iteration\n2. Identify different types of questions and translate them to specific datasets\n3. Describe different types of data pulls\n4. Explore datasets to determine if data are appropriate for a given question\n5. Direct model building efforts in common data analyses\n6. Interpret the results from common data analyses\n7. Integrate statistical findings to form coherent data analysis presentations\n\nCommitment: 1 week of study, 4-6 hours\n\nCourse cover image by fdecomite. Creative Commons BY https://flic.kr/p/4HjmvD","tutor":"Jeff Leek, Brian Caffo and Roger Peng","provider":"Coursera","language":"English","skills":["data analytics","usa","north america"],"subject":"Data Analysis","studentsInterested":"235","courseLink":"https://www.coursera.org/learn/managing-data-analysis","classCentralLink":"https://www.class-central.com/course/coursera-managing-data-analysis-4388"},{"title":"Dealing With Missing Data","about":"This course will cover the steps used in weighting sample surveys, including methods for adjusting for nonresponse and using data external to the survey for calibration. Among the techniques discussed are adjustments using estimated response propensities, poststratification, raking, and general regression estimation. Alternative techniques for imputing values for missing items will be discussed. For both weighting and imputation, the capabilities of different statistical software packages will be covered, including R®, Stata®, and SAS®.","tutor":"Richard Valliant, Ph.D.","provider":"Coursera","language":"English","skills":["r programming","regression models","sas","usa","north america"],"subject":"Data Science","studentsInterested":"87","courseLink":"https://www.coursera.org/learn/missing-data","classCentralLink":"https://www.class-central.com/course/coursera-dealing-with-missing-data-6086"},{"title":"Applied Plotting, Charting \u0026 Data Representation in Python","about":"This course will introduce the learner to information visualization basics, with a focus on reporting and charting using the matplotlib library. The course will start with a design and information literacy perspective, touching on what makes a good and bad visualization, and what statistical measures translate into in terms of visualizations. The second week will focus on the technology used to make visualizations in python, matplotlib, and introduce users to best practices when creating basic charts and how to realize design decisions in the framework. The third week will be a tutorial of functionality available in matplotlib, and demonstrate a variety of basic statistical charts helping learners to identify when a particular method is good for a particular problem. The course will end with a discussion of other forms of structuring and visualizing data.\n\nThis course should be taken after Introduction to Data Science in Python and before the remainder of the Applied Data Science with Python courses: Applied Machine Learning in Python, Applied Text Mining in Python, and Applied Social Network Analysis in Python.","tutor":"Christopher Brooks, Kevyn Collins-Thompson, Daniel Romero and V. G. Vinod Vydiswaran","provider":"Coursera","language":"English","skills":["python","data visualization","matplotlib","usa","north america","new-moocs-2017"],"subject":"Data Visualization","studentsInterested":"124","courseLink":"https://www.coursera.org/learn/python-plotting","classCentralLink":"https://www.class-central.com/course/coursera-applied-plotting-charting-data-representation-in-python-6670"},{"title":"Fundamentals of Visualization with Tableau","about":"In this first course of the specialization, you will discover just what data visualization is, and how we can use it to better see and understand data. Using Tableau, we’ll examine the fundamental concepts of data visualization and explore the Tableau interface, identifying and applying the various tools Tableau has to offer. By the end of the course you will be able to prepare and import data into Tableau and explain the relationship between data analytics and data visualization. This course is designed for the learner who has never used Tableau before, or who may need a refresher or want to explore Tableau in more depth. No prior technical or analytical background is required. The course will guide you through the steps necessary to create your first visualization story from the beginning based on data context, setting the stage for you to advance to the next course in the Specialization.","tutor":"Suk S. Brar, M.B.A. and Govind Acharya","provider":"Coursera","language":"English","skills":["usa","north america"],"subject":"Data Visualization","studentsInterested":"165","courseLink":"https://www.coursera.org/learn/data-visualization-tableau","classCentralLink":"https://www.class-central.com/course/coursera-fundamentals-of-visualization-with-tableau-6808"},{"title":"Google Cloud Platform Big Data and Machine Learning Fundamentals","about":"This 1-week accelerated on-demand course introduces participants to the Big Data and Machine Learning capabilities of Google Cloud Platform (GCP). It provides a quick overview of the Google Cloud Platform and a deeper dive of the data processing capabilities.\n\nAt the end of this course, participants will be able to:\n• Identify the purpose and value of the key Big Data and Machine Learning products in the Google Cloud Platform\n• Use CloudSQL and Cloud Dataproc to migrate existing MySQL and Hadoop/Pig/Spark/Hive workloads to Google Cloud Platform\n• Employ BigQuery and Cloud Datalab to carry out interactive data analysis\n• Choose between Cloud SQL, BigTable and Datastore\n• Train and use a neural network using TensorFlow\n• Choose between different data processing products on the Google Cloud Platform\n\nBefore enrolling in this course, participants should have roughly one (1) year of experience with one or more of the following:\n• A common query language such as SQL\n• Extract, transform, load activities\n• Data modeling\n• Machine learning and/or statistics\n• Programming in Python\n\nGoogle Account Notes:\n• You\u0027ll need a Google/Gmail account and a credit card or bank account to sign up for the Google Cloud Platform free trial (Google services are currently unavailable in China).\n• If you are a Google Cloud Platform customer with European Union (EU) and Russian billing addresses, read the VAT Overview documentation at: https://cloud.google.com/billing/docs/resources/vat-overview\n• More Google Cloud Platform free trial FAQs are available at: https://cloud.google.com/free-trial/","tutor":"Google Cloud Training","provider":"Coursera","language":"English","skills":["google","new-moocs-2017"],"subject":"Big Data","studentsInterested":"148","courseLink":"https://www.coursera.org/learn/gcp-big-data-ml-fundamentals","classCentralLink":"https://www.class-central.com/course/coursera-google-cloud-platform-big-data-and-machine-learning-fundamentals-8234"},{"title":"Building Resilient Streaming Systems on Google Cloud Platform","about":"This 1-week, accelerated on-demand course builds upon Google Cloud Platform Big Data and Machine Learning Fundamentals. Through a combination of video lectures, demonstrations, and hands-on labs, you\u0027ll learn how to build streaming data pipelines using Google Cloud Pub/Sub and Dataflow to enable real-time decision making. You will also learn how to build dashboards to render tailored output for various stakeholder audience.\n\nPrerequisites:\n• Google Cloud Platform Big Data and Machine Learning Fundamentals (or equivalent experience)\n• Some knowledge of Java\n\nObjectives:\n• Understand use-cases for real-time streaming analytics\n• Use Google Cloud PubSub asynchronous messaging service to manage data events\n• Write streaming pipelines and run transformations where necessary\n• Get familiar with both sides of a streaming pipeline: production and consumption\n• Interoperate Dataflow, BigQuery and Cloud Pub/Sub for real-time streaming and analysis","tutor":"Google Cloud Training","provider":"Coursera","language":"English","skills":["google cloud","google bigquery","new-moocs-2017"],"subject":"Big Data","studentsInterested":"28","courseLink":"https://www.coursera.org/learn/building-resilient-streaming-systems-gcp","classCentralLink":"https://www.class-central.com/course/coursera-building-resilient-streaming-systems-on-google-cloud-platform-8758"},{"title":"SQL for Data Science","about":"As data collection has increased exponentially, so has the need for people skilled at using and interacting with data; to be able to think critically, and provide insights to make better decisions and optimize their businesses. This is a data scientist, “part mathematician, part computer scientist, and part trend spotter” (SAS Institute, Inc.). According to Glassdoor, being a data scientist is the best job in America; with a median base salary of $110,000 and thousands of job openings at a time. The skills necessary to be a good data scientist include being able to retrieve and work with data, and to do that you need to be well versed in SQL, the standard language for communicating with database systems.\n\nThis course is designed to give you a primer in the fundamentals of SQL and working with data so that you can begin analyzing it for data science purposes. You will begin to ask the right questions and come up with good answers to deliver valuable insights for your organization. This course starts with the basics and assumes you do not have any knowledge or skills in SQL. It will build on that foundation and gradually have you write both simple and complex queries to help you select data from tables. You\u0027ll start to work with different types of data like strings and numbers and discuss methods to filter and pare down your results.\n\nYou will create new tables and be able to move data into them. You will learn common operators and how to combine the data. You will use case statements and concepts like data governance and profiling. You will discuss topics on data, and practice using real-world programming assignments. You will interpret the structure, meaning, and relationships in source data and use SQL as a professional to shape your data for targeted analysis purposes.\n\nAlthough we do not have any specific prerequisites or software requirements to take this course, a simple text editor is recommended for the final project. So what are you waiting for? This is your first step in landing a job in the best occupation in the US and soon the world!","tutor":"Sadie St. Lawrence","provider":"Coursera","language":"English","skills":["data science","sql"],"subject":"Databases","studentsInterested":"77","courseLink":"https://www.coursera.org/learn/sql-for-data-science","classCentralLink":"https://www.class-central.com/course/coursera-sql-for-data-science-9725"},{"title":"Fundamentals of Scalable Data Science","about":"The value of IoT can be found within the analysis of data gathered from the system under observation, where insights gained can have direct impact on business and operational transformation. Through analysis data correlation, patterns, trends, and other insight are discovered. Insight leads to better communication between stakeholders, or actionable insights, which can be used to raise alerts or send commands, back to IoT devices.\nWith a focus on the topic of Exploratory Data Analysis, the course provides an in-depth look at mathematical foundations of basic statistical measures, and how they can be used in conjunction with advanced charting libraries to make use of the world’s best pattern recognition system – the human brain. Learn how to work with the data, and depict it in ways that support visual inspections, and derive to inferences about the data. Identify interesting characteristics, patterns, trends, deviations or inconsistencies, and potential outliers. The goal is that you are able to implement end-to-end analytic workflows at scale, from data acquisition to actionable insights.\nThrough a series of lectures and exercises students get the needed skills to perform such analysis on any data, although we clearly focus on IoT Sensor Event Data.\n\nAfter completing this course, you will be able to:\n• Describe how basic statistical measures, are used to reveal patterns within the data\n• Recognize data characteristics, patterns, trends, deviations or inconsistencies, and potential outliers.\n• Identify useful techniques for working with big data such as dimension reduction and feature selection methods\n• Use advanced tools and charting libraries to:\no Automatically store data from IoT device(s)\no improve efficiency of analysis of big-data with partitioning and parallel analysis\no Visualize the data in an number of 2D and 3D formats (Box Plot, Run Chart, Scatter Plot, Pareto Chart, and Multidimensional Scaling)\n\nFor successful completion of the course, the following prerequisites are recommended:\n• Basic programming skills in any programming language (python preferred)\n• A good grasp of basic algebra and algebraic equations\n• (optional) “A developer\u0027s guide to the Internet of Things (IoT)” - a Coursera course\n• Basic SQL is a plus\n\nIn order to complete this course, the following technologies will be used:\n(These technologies are introduced in the course as necessary so no previous knowledge is required.)\n• IBM Watson IoT Platform (MQTT Message Broker as a Service, Device Management and Operational Rule Engine)\n• IBM Bluemix (Open Standard Platform Cloud)\n• Node-Red\n• Cloudant NoSQL (Apache CouchDB)\n• ApacheSpark\n• Languages: R, Scala and Python (focus on Python)\n\nThis course takes four weeks, 4-6h per week","tutor":"Romeo Kienzler","provider":"Coursera","language":"English","skills":["data science","internet of things","data analysis","iot"],"subject":"Data Science","studentsInterested":"53","courseLink":"https://www.coursera.org/learn/ds","classCentralLink":"https://www.class-central.com/course/coursera-fundamentals-of-scalable-data-science-10631"},{"title":"Big Data Integration and Processing","about":"At the end of the course, you will be able to:\n\n*Retrieve data from example database and big data management systems\n*Describe the connections between data management operations and the big data processing patterns needed to utilize them in large-scale analytical applications\n*Identify when a big data problem needs data integration\n*Execute simple big data integration and processing on Hadoop and Spark platforms\n\nThis course is for those new to data science. Completion of Intro to Big Data is recommended. No prior programming experience is needed, although the ability to install applications and utilize a virtual machine is necessary to complete the hands-on assignments. Refer to the specialization technical requirements for complete hardware and software specifications.\n\nHardware Requirements:\n(A) Quad Core Processor (VT-x or AMD-V support recommended), 64-bit; (B) 8 GB RAM; (C) 20 GB disk free. How to find your hardware information: (Windows): Open System by clicking the Start button, right-clicking Computer, and then clicking Properties; (Mac): Open Overview by clicking on the Apple menu and clicking “About This Mac.” Most computers with 8 GB RAM purchased in the last 3 years will meet the minimum requirements.You will need a high speed internet connection because you will be downloading files up to 4 Gb in size.\n\nSoftware Requirements:\nThis course relies on several open-source software tools, including Apache Hadoop. All required software can be downloaded and installed free of charge (except for data charges from your internet provider). Software requirements include: Windows 7+, Mac OS X 10.10+, Ubuntu 14.04+ or CentOS 6+ VirtualBox 5+.","tutor":"Ilkay Altintas and Amarnath Gupta","provider":"Coursera","language":"English","skills":["usa","north america"],"subject":"Big Data","studentsInterested":"1.5k","courseLink":"https://www.coursera.org/learn/big-data-integration-processing","classCentralLink":"https://www.class-central.com/course/coursera-big-data-integration-and-processing-6467"},{"title":"Essential Design Principles for Tableau","about":"In this course, you will analyze and apply essential design principles to your Tableau visualizations. This course assumes you understand the tools within Tableau and have some knowledge of the fundamental concepts of data visualization. You will define and examine the similarities and differences of exploratory and explanatory analysis as well as begin to ask the right questions about what’s needed in a visualization. You will assess how data and design work together, including how to choose the appropriate visual representation for your data, and the difference between effective and ineffective visuals. You will apply effective best practice design principles to your data visualizations and be able to illustrate examples of strategic use of contrast to highlight important elements. You will evaluate pre-attentive attributes and why they are important in visualizations. You will exam the importance of using the \"right\" amount of color and in the right place and be able to apply design principles to de-clutter your data visualization.","tutor":"Govind Acharya and Suk S. Brar, M.B.A.","provider":"Coursera","language":"English","skills":["usa","north america"],"subject":"Data Visualization","studentsInterested":"60","courseLink":"https://www.coursera.org/learn/dataviz-design","classCentralLink":"https://www.class-central.com/course/coursera-essential-design-principles-for-tableau-6809"},{"title":"Advanced R Programming","about":"This course covers advanced topics in R programming that are necessary for developing powerful, robust, and reusable data science tools. Topics covered include functional programming in R, robust error handling, object oriented programming, profiling and benchmarking, debugging, and proper design of functions. Upon completing this course you will be able to identify and abstract common data analysis tasks and to encapsulate them in user-facing functions. Because every data science environment encounters unique data challenges, there is always a need to develop custom software specific to your organization’s mission. You will also be able to define new data types in R and to develop a universe of functionality specific to those data types to enable cleaner execution of data science tasks and stronger reusability within a team.","tutor":"Roger D. Peng, PhD and Brooke Anderson","provider":"Coursera","language":"English","skills":["r programming","usa","north america"],"subject":"Data Science","studentsInterested":"90","courseLink":"https://www.coursera.org/learn/advanced-r","classCentralLink":"https://www.class-central.com/course/coursera-advanced-r-programming-7174"},{"title":"Serverless Data Analysis with Google BigQuery and Cloud Dataflow","about":"This 1-week, accelerated on-demand course builds upon Google Cloud Platform Big Data and Machine Learning Fundamentals. Through a combination of instructor-led presentations, demonstrations, and hands-on labs, students learn how to carry out no-ops data warehousing, analysis and pipeline processing.\n\nPrerequisites:\n• Google Cloud Platform Big Data and Machine Learning Fundamentals\n• Experience using a SQL-like query language to analyze data\n• Knowledge of either Python or Java\n\nGoogle Account Notes:\n• You\u0027ll need a Google/Gmail account and a credit card or bank account to sign up for the Google Cloud Platform free trial (Google services are currently unavailable in China).\n• If you are a Google Cloud Platform customer with European Union (EU) and Russian billing addresses, read the VAT Overview documentation at: https://cloud.google.com/billing/docs/resources/vat-overview\n• More Google Cloud Platform free trial FAQs are available at: https://cloud.google.com/free-trial/","tutor":"Google Cloud Training","provider":"Coursera","language":"English","skills":["data analysis","devops","google cloud","google bigquery","new-moocs-2017"],"subject":"Data Analysis","studentsInterested":"28","courseLink":"https://www.coursera.org/learn/serverless-data-analysis-bigquery-cloud-dataflow-gcp","classCentralLink":"https://www.class-central.com/course/coursera-serverless-data-analysis-with-google-bigquery-and-cloud-dataflow-8759"},{"title":"Введение в науку о данных (An Introduction to Data Science)","about":"Наука о данных включает большой спектр подходов и методов сбора, обработки, анализа и визуализации массивов данных любого размера. Отдельным практически важным направлением данной науки является работа с большими данными с помощью новых принципов математического и вычислительного моделирования, когда классические методы перестают работать ввиду невозможности их масштабирования.\nНастоящий курс призван помочь обучающемуся изучить основы предметной области через постановку и решение типичных задач, с которыми исследователь в области науки о данных может столкнуться в своей работе. Чтобы научить слушателя решать такие задачи, авторы курса предоставляют обучающемуся необходимый теоретический минимум и показывают, как пользоваться инструментальной базой на практике.","tutor":"Камалов Михаил Валерьевич, Вольф Дмитрий Александрович, Севрюков Сергей Юрьевич, Просолупов Евгений Викторович, Утешев Алексей Юрьевич, Блеканов Иван Станиславович , Малютин Евгений Алексеевич, Коротков Павел Алексеевич and Мишенин Алексей Николаевич","provider":"Coursera","language":"Russian","skills":["data science","new-moocs-2017"],"subject":"Data Science","studentsInterested":"3","courseLink":"https://www.coursera.org/learn/vvedeniye-v-nauku-o-dannykh","classCentralLink":"https://www.class-central.com/course/coursera------an-introduction-to-data-science-9656"},{"title":"Practical Time Series Analysis","about":"Welcome to Practical Time Series Analysis!\n\nMany of us are \"accidental\" data analysts. We trained in the sciences, business, or engineering and then found ourselves confronted with data for which we have no formal analytic training. This course is designed for people with some technical competencies who would like more than a \"cookbook\" approach, but who still need to concentrate on the routine sorts of presentation and analysis that deepen the understanding of our professional topics.\n\nIn practical Time Series Analysis we look at data sets that represent sequential information, such as stock prices, annual rainfall, sunspot activity, the price of agricultural products, and more. We look at several mathematical models that might be used to describe the processes which generate these types of data. We also look at graphical representations that provide insights into our data. Finally, we also learn how to make forecasts that say intelligent things about what we might expect in the future.\n\nPlease take a few minutes to explore the course site. You will find video lectures with supporting written materials as well as quizzes to help emphasize important points. The language for the course is R, a free implementation of the S language. It is a professional environment and fairly easy to learn.\n\nYou can discuss material from the course with your fellow learners. Please take a moment to introduce yourself!\n\nTime Series Analysis can take effort to learn- we have tried to present those ideas that are \"mission critical\" in a way where you understand enough of the math to fell satisfied while also being immediately productive. We hope you enjoy the class!","tutor":"Tural Sadigov and William","provider":"Coursera","language":"English","skills":["data analysis"],"subject":"Data Analysis","studentsInterested":"116","courseLink":"https://www.coursera.org/learn/practical-time-series-analysis","classCentralLink":"https://www.class-central.com/course/coursera-practical-time-series-analysis-10151"},{"title":"Spatial Data Science and Applications","about":"Spatial (map) is considered as a core infrastructure of modern IT world, which is substantiated by business transactions of major IT companies such as Apple, Google, Microsoft, Amazon, Intel, and Uber, and even motor companies such as Audi, BMW, and Mercedes. Consequently, they are bound to hire more and more spatial data scientists. Based on such business trend, this course is designed to present a firm understanding of spatial data science to the learners, who would have a basic knowledge of data science and data analysis, and eventually to make their expertise differentiated from other nominal data scientists and data analysts. Additionally, this course could make learners realize the value of spatial big data and the power of open source software\u0027s to deal with spatial data science problems.\n\nThis course will start with defining spatial data science and answering why spatial is special from three different perspectives - business, technology, and data in the first week. In the second week, four disciplines related to spatial data science - GIS, DBMS, Data Analytics, and Big Data Systems, and the related open source software\u0027s - QGIS, PostgreSQL, PostGIS, R, and Hadoop tools are introduced together. During the third, fourth, and fifth weeks, you will learn the four disciplines one by one from the principle to applications. In the final week, five real world problems and the corresponding solutions are presented with step-by-step procedures in environment of open source software\u0027s.","tutor":"Joon Heo","provider":"Coursera","language":"English","skills":["data science","spatial data analytics"],"subject":"Data Science","studentsInterested":"22","courseLink":"https://www.coursera.org/learn/spatial-data-science","classCentralLink":"https://www.class-central.com/course/coursera-spatial-data-science-and-applications-10168"},{"title":"Introdução ao Big Data","about":"Este curso é indicado para profissionais que desejam entender de forma fácil o que é Big Data, conhecer algumas tecnologias de Big Data, ter acesso a algumas aplicações de Analytics, Internet das Coisas - IOT e de Big Data. Ao final do curso você será capaz de participar de um projeto de Big Data contribuindo com estratégias e direcionando o projeto para a escolha da adequada técnica de análise de dados.","tutor":"Alessandra Montini","provider":"Coursera","language":"Portuguese","skills":["big data"],"subject":"Big Data","studentsInterested":"20","courseLink":"https://www.coursera.org/learn/introducao-big-data","classCentralLink":"https://www.class-central.com/course/coursera-introducao-ao-big-data-10714"},{"title":"Data Analysis Tools","about":"In this course, you will develop and test hypotheses about your data. You will learn a variety of statistical tests, as well as strategies to know how to apply the appropriate one to your specific data and question. Using your choice of two powerful statistical software packages (SAS or Python), you will explore ANOVA, Chi-Square, and Pearson correlation analysis. This course will guide you through basic statistical principles to give you the tools to answer questions you have developed. Throughout the course, you will share your progress with others to gain valuable feedback and provide insight to other learners about their work.","tutor":"Jen Rose","provider":"Coursera","language":"English","skills":["data science","data analysis","usa","north america"],"subject":"Data Analysis","studentsInterested":"299","courseLink":"https://www.coursera.org/learn/data-analysis-tools","classCentralLink":"https://www.class-central.com/course/coursera-data-analysis-tools-4169"},{"title":"Machine Learning for Data Analysis","about":"Are you interested in predicting future outcomes using your data? This course helps you do just that! Machine learning is the process of developing, testing, and applying predictive algorithms to achieve this goal. Make sure to familiarize yourself with course 3 of this specialization before diving into these machine learning concepts. Building on Course 3, which introduces students to integral supervised machine learning concepts, this course will provide an overview of many additional concepts, techniques, and algorithms in machine learning, from basic classification to decision trees and clustering. By completing this course, you will learn how to apply, test, and interpret machine learning algorithms as alternative methods for addressing your research questions.","tutor":"Jen Rose","provider":"Coursera","language":"English","skills":["machine learning","data analysis","usa","north america"],"subject":"Data Analysis","studentsInterested":"198","courseLink":"https://www.coursera.org/learn/machine-learning-data-analysis","classCentralLink":"https://www.class-central.com/course/coursera-machine-learning-for-data-analysis-4354"},{"title":"Big Data - Capstone Project","about":"Welcome to the Capstone Project for Big Data! In this culminating project, you will build a big data ecosystem using tools and methods form the earlier courses in this specialization. You will analyze a data set simulating big data generated from a large number of users who are playing our imaginary game \"Catch the Pink Flamingo\". During the five week Capstone Project, you will walk through the typical big data science steps for acquiring, exploring, preparing, analyzing, and reporting. In the first two weeks, we will introduce you to the data set and guide you through some exploratory analysis using tools such as Splunk and Open Office. Then we will move into more challenging big data problems requiring the more advanced tools you have learned including KNIME, Spark\u0027s MLLib and Gephi. Finally, during the fifth and final week, we will show you how to bring it all together to create engaging and compelling reports and slide presentations. As a result of our collaboration with Splunk, a software company focus on analyzing machine-generated big data, learners with the top projects will be eligible to present to Splunk and meet Splunk recruiters and engineering leadership.","tutor":"Ilkay Altintas and Amarnath Gupta","provider":"Coursera","language":"English","skills":["big data","capstone","usa","north america"],"subject":"Big Data","studentsInterested":"12","courseLink":"https://www.coursera.org/learn/big-data-project","classCentralLink":"https://www.class-central.com/course/coursera-big-data-capstone-project-6468"},{"title":"The R Programming Environment","about":"This course provides a rigorous introduction to the R programming language, with a particular focus on using R for software development in a data science setting. Whether you are part of a data science team or working individually within a community of developers, this course will give you the knowledge of R needed to make useful contributions in those settings. As the first course in the Specialization, the course provides the essential foundation of R needed for the following courses. We cover basic R concepts and language fundamentals, key concepts like tidy data and related \"tidyverse\" tools, processing and manipulation of complex and large datasets, handling textual data, and basic data science tasks. Upon completing this course, learners will have fluency at the R console and will be able to create tidy datasets from a wide range of possible data sources.","tutor":"Roger D. Peng, PhD and Brooke Anderson","provider":"Coursera","language":"English","skills":["r programming","usa","north america"],"subject":"Data Science","studentsInterested":"104","courseLink":"https://www.coursera.org/learn/r-programming-environment","classCentralLink":"https://www.class-central.com/course/coursera-the-r-programming-environment-7170"},{"title":"Building R Packages","about":"Writing good code for data science is only part of the job. In order to maximizing the usefulness and reusability of data science software, code must be organized and distributed in a manner that adheres to community-based standards and provides a good user experience. This course covers the primary means by which R software is organized and distributed to others. We cover R package development, writing good documentation and vignettes, writing robust software, cross-platform development, continuous integration tools, and distributing packages via CRAN and GitHub. Learners will produce R packages that satisfy the criteria for submission to CRAN.","tutor":"Roger D. Peng, PhD and Brooke Anderson","provider":"Coursera","language":"English","skills":["r programming","usa","north america"],"subject":"Data Science","studentsInterested":"38","courseLink":"https://www.coursera.org/learn/r-packages","classCentralLink":"https://www.class-central.com/course/coursera-building-r-packages-7175"},{"title":"Введение в данные","about":"Этот курс - первый в специализации \"Анализ данных\". Курс будет особенно полезен тем, кто имеет небольшой опыт работы с данными, или хочет освежить знания по теории вероятностей, математической статистике и типах данных.\nСначала мы вспомним основы теории вероятностей и поговорим о случайных величинах и их свойствах, об основных распределениях случайных величин.\nЗатем перейдем к основным характеристикам распределений: мерам центра и мерам вариативности. Далее обсудим основные типы шкал измерения признаков, а также основные ограничения, которые тип шкалы накладывает на применимые методы анализа данных.\nТретья неделя курса посвящена графическому анализу данных и способам визуализации распределений, индивидуальных или совместных. Завершающий модуль курса посвящен выборкам и способам их формирования, а также принципам и инструментам работы с пропущенными и неопределенными значениями.\nВы сможете применить полученные знания, выполнив небольшой проект на реальных данных, предоставленных компанией 2GIS.\nПрисоединяйтесь!","tutor":"Ольга Ечевская, Наталья Галанова and Виктор Дёмин","provider":"Coursera","language":"Russian","skills":["data analysis","new-moocs-2017"],"subject":"Data Analysis","studentsInterested":"5","courseLink":"https://www.coursera.org/learn/vvedeniye-dannyye","classCentralLink":"https://www.class-central.com/course/coursera----9443"},{"title":"Python Data Analysis","about":"This course will continue the introduction to Python programming that started with Python Programming Essentials and Python Data Representations. We\u0027ll learn about reading, storing, and processing tabular data, which are common tasks. We will also teach you about CSV files and Python\u0027s support for reading and writing them. CSV files are a generic, plain text file format that allows you to exchange tabular data between different programs. These concepts and skills will help you to further extend your Python programming knowledge and allow you to process more complex data.\n\nBy the end of the course, you will be comfortable working with tabular data in Python. This will extend your Python programming expertise, enabling you to write a wider range of scripts using Python.\n\nThis course uses Python 3. While most Python programs continue to use Python 2, Python 3 is the future of the Python programming language. This course uses basic desktop Python development environments, allowing you to run Python programs directly on your computer.","tutor":"Scott Rixner and Joe Warren","provider":"Coursera","language":"English","skills":["python","data analysis","new-moocs-2017"],"subject":"Data Analysis","studentsInterested":"145","courseLink":"https://www.coursera.org/learn/python-analysis","classCentralLink":"https://www.class-central.com/course/coursera-python-data-analysis-9551"},{"title":"Data Science in Stratified Healthcare and Precision Medicine","about":"An increasing volume of data is becoming available in biomedicine and healthcare, from genomic data, to electronic patient records and data collected by wearable devices. Recent advances in data science are transforming the life sciences, leading to precision medicine and stratified healthcare.\n\nIn this course, you will learn about some of the different types of data and computational methods involved in stratified healthcare and precision medicine. You will have a hands-on experience of working with such data. And you will learn from leaders in the field about successful case studies.\n\nTopics include: (i) Sequence Processing, (ii) Image Analysis, (iii) Network Modelling, (iv) Probabilistic Modelling, (v) Machine Learning, (vi) Natural Language Processing, (vii) Process Modelling and (viii) Graph Data.\n\nWatch the course promo video here: http://edin.ac/2pn350P","tutor":"Dr Areti Manataki and Dr Frances Wong","provider":"Coursera","language":"English","skills":["data science","public health data","health data analysis"],"subject":"Data Science","studentsInterested":"48","courseLink":"https://www.coursera.org/learn/datascimed","classCentralLink":"https://www.class-central.com/course/coursera-data-science-in-stratified-healthcare-and-precision-medicine-10645"},{"title":"Introduction to Data Exploration and Visualization","about":"This course answers the questions, What is data visualization and What is the power of visualization? It also introduces core concepts such as dataset elements, data warehouses and exploratory querying, and combinations of visual variables for graphic usefulness, as well as the types of statistical graphs, tools that are essential to exploratory data analysis.","tutor":"Ross Maciejewsk and K. Selcuk Candan","provider":"Coursera","language":"English","skills":["statistics","data visualization","graphs"],"subject":"Data Visualization","studentsInterested":"31","courseLink":"https://www.coursera.org/learn/intro-to-data-exploration","classCentralLink":"https://www.class-central.com/course/coursera-introduction-to-data-exploration-and-visualization-11220"},{"title":"Data Science: Productivity Tools","about":"A typical data analysis project may involve several parts, each including several data files and different scripts with code. Keeping all this organized can be challenging.\n\nIn this course, you will learn how to use Unix/Linux as a tool for managing files and directories on your computer system and how to keep the file system organized. You will be introduced to the version control systems git which is a powerful tool for keeping track of changes in your scripts and reports. We also introduce you to GitHub and demonstrate how you can use this service to keep your work in a repository that facilitates collaborations.\n\nFinally, you will learn to write reports in R markdown which permits you to incorporate text and code into a document. We\u0027ll put it all together using the powerful integrated desktop environment RStudio.","tutor":"Rafael Irizarry","provider":"edX","language":"English","skills":["data science","harvardx","github","productivity"],"subject":"Data Science","studentsInterested":"31","courseLink":"https://www.edx.org/course/data-science-productivity-tools-harvardx-ph125-5x","classCentralLink":"https://www.class-central.com/course/edx-data-science-productivity-tools-10350"},{"title":"Introduction to Bioconductor: Annotation and Analysis of Genomes and Genomic Assays","about":"We begin with an introduction to the biology, explaining what we measure and why. Then we focus on the two main measurement technologies: next generation sequencing and microarrays. We then move on to describing how raw data and experimental information are imported into R and how we use Bioconductor classes to organize these data, whether generated locally, or harvested from public repositories or institutional archives. Genomic features are generally identified using intervals in genomic coordinates, and highly efficient algorithms for computing with genomic intervals will be examined in detail. Statistical methods for testing gene-centric or pathway-centric hypotheses with genome-scale data are found in packages such as limma, some of these techniques will be illustrated in lectures and labs.\nGiven the diversity in educational background of our students we have divided the series into seven parts. You can take the entire series or individual courses that interest you. If you are a statistician you should consider skipping the first two or three courses, similarly, if you are biologists you should consider skipping some of the introductory biology lectures. Note that the statistics and programming aspects of the class ramp up in difficulty relatively quickly across the first three courses. By the third course will be teaching advanced statistical concepts such as hierarchical models and by the fourth advanced software engineering skills, such as parallel computing and reproducible research concepts.\nThese courses make up 2 XSeries and are self-paced:\nPH525.1x: Statistics and R for the Life Sciences","tutor":"Michael Love and Rafael Irizarry","provider":"edX","language":"English","skills":["harvardx"],"subject":"Bioinformatics","studentsInterested":"202","courseLink":"https://www.edx.org/course/introduction-bioconductor-annotation-harvardx-ph525-5x-2","classCentralLink":"https://www.class-central.com/course/edx-introduction-to-bioconductor-annotation-and-analysis-of-genomes-and-genomic-assays-2970"},{"title":"Case Studies in Functional Genomics","about":"We will explain how to start with raw data, and perform the standard processing and normalization steps to get to the point where one can investigate relevant biological questions. Throughout the case studies, we will make use of exploratory plots to get a general overview of the shape of the data and the result of the experiment. We start with RNA-seq data analysis covering basic concepts of RNA-seq and a first look at FASTQ files. We will also go over quality control of FASTQ files; aligning RNA-seq reads; visualizing alignments and move on to analyzing RNA-seq at the gene-level: counting reads in genes; Exploratory Data Analysis and variance stabilization for counts; count-based differential expression; normalization and batch effects. Finally, we cover RNA-seq at the transcript-level: inferring expression of transcripts (i.e. alternative isoforms); differential exon usage. We will learn the basic steps in analyzing DNA methylation data, including reading the raw data, normalization, and finding regions of differential methylation across multiple samples. The course will end with a brief description of the basic steps for analyzing ChIP-seq datasets, from read alignment, to peak calling, and assessing differential binding patterns across multiple samples.\nGiven the diversity in educational background of our students we have divided the series into seven parts. You can take the entire series or individual courses that interest you. If you are a statistician you should consider skipping the first two or three courses, similarly, if you are biologists you should consider skipping some of the introductory biology lectures. Note that the statistics and programming aspects of the class ramp up in difficulty relatively quickly across the first three courses. By the third course will be teaching advanced statistical concepts such as hierarchical models and by the fourth advanced software engineering skills, such as parallel computing and reproducible research concepts.","tutor":"Michael Love and Rafael Irizarry","provider":"edX","language":"English","skills":["harvardx"],"subject":"Data Science","studentsInterested":"120","courseLink":"https://www.edx.org/course/case-studies-functional-genomics-harvardx-ph525-7x-1","classCentralLink":"https://www.class-central.com/course/edx-case-studies-in-functional-genomics-2976"},{"title":"High-performance Computing for Reproducible Genomics","about":"If you’re interested in data analysis and interpretation, then this is the data science course for you.\nEnhanced throughput: Almost all recently manufactured laptops and desktops include multiple core CPUs. With R, it is very easy to obtain faster turnaround times for analyses by distributing tasks among the cores for concurrent execution. We will discuss how to use Bioconductor to simplify parallel computing for efficient, fault-tolerant, and reproducible high-performance analyses. This will be illustrated with common multicore architectures and Amazon’s EC2 infrastructure.  \nEnhanced interactivity: New approaches to programming with R and Bioconductor allow researchers to use the web browser as a highly dynamic interface for data interrogation and visualization. We will discuss how to create interactive reports that enable us to move beyond static tables and one-off graphics so that our analysis outputs can be transformed and explored in real time.\nEnhanced reproducibility: New methods of virtualization of software environments, exemplified by the Docker ecosystem, are useful for achieving reproducible distributed analyses. The Docker Hub includes a considerable number of container images useful for important Bioconductor-based workflows, and we will illustrate how to use and extend these for sharable and reproducible analysis.\nGiven the diversity in educational background of our students we have divided the series into seven parts. You can take the entire series or individual courses that interest you. If you are a statistician you should consider skipping the first two or three courses, similarly, if you are biologists you should consider skipping some of the introductory biology lectures. Note that the statistics and programming aspects of the class ramp up in difficulty relatively quickly across the first three courses. By the third course will be teaching advanced statistical concepts such as hierarchical models and by the fourth advanced software engineering skills, such as parallel computing and reproducible research concepts.","tutor":"Michael Love and Rafael Irizarry","provider":"edX","language":"English","skills":["harvardx"],"subject":"Bioinformatics","studentsInterested":"104","courseLink":"https://www.edx.org/course/high-performance-computing-reproducible-harvardx-ph525-6x-1","classCentralLink":"https://www.class-central.com/course/edx-high-performance-computing-for-reproducible-genomics-2973"},{"title":"Data Warehouse Concepts, Design, and Data Integration","about":"This is the second course in the Data Warehousing for Business Intelligence specialization. Ideally, the courses should be taken in sequence.\n\nIn this course, you will learn exciting concepts and skills for designing data warehouses and creating data integration workflows.\nThese are fundamental skills for data warehouse developers and administrators. You will have hands-on experience for data warehouse design and use open source products for manipulating pivot tables and creating data integration workflows.You will also gain conceptual background about maturity models, architectures, multidimensional models, and management practices, providing an organizational perspective about data warehouse development. If you are currently a business or information technology professional and want to become a data warehouse designer or administrator, this course will give you the knowledge and skills to do that. By the end of the course, you will have the design experience, software background, and organizational context that prepares you to succeed with data warehouse development projects.\n\nIn this course, you will create data warehouse designs and data integration workflows that satisfy the business intelligence needs of organizations. When you’re done with this course, you’ll be able to:\n* Evaluate an organization for data warehouse maturity and business architecture alignment;\n* Create a data warehouse design and reflect on alternative design methodologies and design goals;\n* Create data integration workflows using prominent open source software;\n* Reflect on the role of change data, refresh constraints, refresh frequency trade-offs, and data quality goals in data integration process design; and\n* Perform operations on pivot tables to satisfy typical business analysis requests using prominent open source software","tutor":"Michael Mannino","provider":"Coursera","language":"English","skills":["business intelligence","data warehousing","usa","north america"],"subject":"Data Science","studentsInterested":"657","courseLink":"https://www.coursera.org/learn/dwdesign","classCentralLink":"https://www.class-central.com/course/coursera-data-warehouse-concepts-design-and-data-integration-4230"},{"title":"Введение в Биоинформатику: Метагеномика (Introduction to Bioinformatics: Metagenomics)","about":"Метагеномика — раздел геномики, изучающий геном не отдельного организма, а совокупности обитателей микробных сообществ, живущих в разных природных условиях. На протяжении 4,5 миллиардов лет микроорганизмы являются доминирующей формой жизни на Земле. При этом только 3-4% из них может быть выращено в лабораторных условиях, а об остальных мы не знаем практически ничего.\n\nДетальный анализ состава и функционирования сложных сообществ позволяет ответить на многие вопросы, связанные со здоровьем человека, охраной окружающей среды, хранением и переработкой продуктов питания, разработкой альтернативных источников энергии, и т.д. Такой анализ возможен только в результате биоинформатической обработки огромных массивов данных, получаемых при секвенировании суммарной метагеномной ДНК и/или отдельных генов.\n\nВ предлагаемом курсе «Введение в биоинформатику: метагеномика» мы затронем вопросы подготовки метагеномных проб и особенностей их анализа; математических подходов, лежащих в основе созданных специально для этого типа данных программных продуктов; вопросы секвенирования и сборки метагеномов, их аннотации и применения.\nВ ходе курса участникам будет предложен проект, в котором они смогут на практике применить полученные знания.\nВ рамках этого проекта учащиеся будут самостоятельно работать с реальными данными, проведут самостоятельный анализ и сделают выводы о составе и функции выбранного для этого проекта сообщества.\n\nКурс «Введение в биоинформатику: метагеномика» преследует три главные цели:\n1. ознакомить вас с задачами, которые ставит необходимость исследования сложных микробных сообществ перед медиками, биологами, программистами и математиками; методами их решения; программными продуктами и аналитическими платформами, созданными для работы с метагеномными данными; математическими алгоритмами, лежащими в основе этих программ\n2. привить экспериментальные навыки работы с метагеномными данными, умение правильно планировать эксперимент, оценивать сложность задачи и требуемых для ее решения ресурсов (лабораторных и компьютерных), оценивать качество произведенных данных с точки зрения поставленной задачи,\n3. научить правильно выбирать, а при необходимости и создавать, программные продукты для решения поставленной задачи\n\n\n\nMetagenomics – part of the genomics studies considering not a single organisms, but the whole microbial communities living in different environments. Over 4.5 billion years bacteria are the dominant form of life on Earth. However, only 3-4% of them can be grown in laboratories, and we know almost nothing about others.\n\nA detailed analysis of the composition and functioning of complex communities allows to answer a lot ot questions related to human health, environmental protection, food storage and processing, the development of alternative energy sources, etc. The only way do it is processing of huge amounts of bioinformatics data obtained by sequencing of the total metagenomic DNA or individual genes.\n\nIn the course \"Introduction to bioinformatics: Metagenomics\" we will address the issues of sample preparation and metagenomic analysis; mathematical approaches used in such analysis; metagenome sequencing and assembling issues, annotation and application of the data.\n\nDuring the course, learners will be offered a project where they can apply acquired knowledge in practice. In this project, students will work with the real data, conduct independent analysis and draw conclusions about the composition and functions of the microbila community selected for the project.\n\nThe course \"Introduction to bioinformatics: Metagenomics\" has three main objectives:\n\n1. Give you outline of the problems the physicians, biologists, mathematicians and programmers meets studying complex microbial communities; methods to solve these problems; software and analytic platform designed to work with metagenomic data; mathematical algorithms underlying these programs\n2. Make you familiar with experimental skills for metagenomic analysis, the ability to plan an experiment, to assess the problem complexity and the required resources (wet lab and computational), to assess the quality of the obtained data for the given problem.\n3. Teach how to choose and, if necessary, create software for the given tasks","tutor":"Михаил Райко, Екатерина Черняева, Alla Lapidus, Павел Добрынин and Николай Вяххи","provider":"Coursera","language":"Russian","skills":["russia","new-moocs-2017"],"subject":"Bioinformatics","studentsInterested":"18","courseLink":"https://www.coursera.org/learn/bioinformatics-metagenomics","classCentralLink":"https://www.class-central.com/course/coursera-----introduction-to-bioinformatics-metagenomics-7777"},{"title":"Data, Models and Decisions in Business Analytics","about":"In today’s world, managerial decisions are increasingly based on data-driven models and analysis using statistical and optimization methods that have dramatically changed the way businesses operate in most domains including service operations, marketing, transportation, and finance.\nThe main objectives of this course are the following:\nIntroduce fundamental techniques towards a principled approach for data-driven decision-making.\nQuantitative modeling of dynamic nature of decision problems using historical data, and\nLearn various approaches for decision-making in the face of uncertainty\nTopics covered include probability, statistics, regression, stochastic modeling, and linear, nonlinear and discrete optimization.\nMost of the topics will be presented in the context of practical business applications to illustrate its usefulness in practice. ","tutor":"Vineet Goyal","provider":"edX","language":"English","skills":["columbiax"],"subject":"Data Science","studentsInterested":"93","courseLink":"https://www.edx.org/course/data-models-decisions-business-analytics-columbiax-bamm-102x-0","classCentralLink":"https://www.class-central.com/course/edx-data-models-and-decisions-in-business-analytics-8218"}]