[{"title":"A Life of Happiness and Fulfillment","about":"What are the determinants of a happy and fulfilling life?\n\nThis is surely one of life’s biggest questions, and a question that has interested many of our ancestors. Buddha famously gave up his kingdom in search of happiness. Several Greek philosophers (from Aristotle to Epicurus and Plato to Socrates) had their own views on what it takes to be happy. And of course, we all have our own theories about happiness too.\n\nHow valid are our theories?\n\nUntil recently, if you wished for an answer to this question, you would\u0027ve been forced to base it on discussions with spiritual leaders. Or, if you were lucky, you could\u0027ve based it on late-night (and perhaps intoxicant-fueled) conversations with friends and family. Happily, all that has changed now. Over the past decade-and-a-half, scientists have gotten into the act big time. We now have a pretty good idea of what it takes to lead a happy and fulfilling life.\n\nThis course, based on the award-winning class offered both at the Indian School of Business and at the McCombs School of Business at The University of Texas at Austin, developed by Prof. Raj Raghunathan (aka \"Dr. Happy-smarts\") draws content from a variety of fields, including psychology, neuroscience, and behavioral decision theory to offer a tested and practical recipe for leading a life of happiness and fulfillment.\n\nAlthough not mandatory, reading Prof. Raj\u0027s forthcoming book, titled If you\u0027re so smart, why aren\u0027t you happy? can help you review and assimilate the material covered in this book at your leisure.\n\nFor Coursera learners alone, the hardcover version of the book is available for a deep discount of 50%, plus shipping and handling. You can order the hardcover for 50% off by writing to Aaron at: Aaron@800ceoread.com. Please mention that you are a student of the \"coursera happiness course\" in your email.\n\nThe course will feature guest appearances by several well-known thought leaders, including:\n- Dan Ariely (author of Predictably Irrational and, soon to be released, Irrationally Yours),\n- Ed Diener (“Dr. Happiness”),\n- Mihaly Csikszentmihalyi (author of Flow),\n\nBy taking this course, you will discover the answers to questions such as:\n- Why aren’t the smart-and-the-successful as happy as they could—or should—be\n- What are the “7 Deadly Happiness Sins” that even the smart and the successful commit?, and\n- What are the “7 Habits of the Highly Happy” and how can you implement them in your life?\n\nBy the end of the course, I expect students who have been diligent with the lectures and exercises to not just gain a deeper understanding of the science of happiness, but to also be significantly happier.","tutor":"Rajagopal Raghunathan","provider":"Coursera","language":"English","skills":["india","asia"],"subject":"Philosophy","studentsInterested":"34.7k","courseLink":"https://www.coursera.org/learn/happiness","classCentralLink":"https://www.class-central.com/course/coursera-a-life-of-happiness-and-fulfillment-2860"},{"title":"Modern \u0026 Contemporary American Poetry (“ModPo”)","about":"ModPo is a fast-paced introduction to modern and contemporary U.S. poetry, with an emphasis on experimental verse, from Emily Dickinson and Walt Whitman to the present. Participants (who need no prior experience with poetry) will learn how to read poems that are supposedly \"difficult.\" We encounter and discuss the poems one at a time. It\u0027s much easier than it seems! Join us and try it!\n\nEven though we are currently in our offseason (\"SloPo\"), you are welcome to enroll now. You will have access to the entire ModPo site. Explore; meet some ModPo\u0027ers who are conversing in the site year-round; read poems and watch videos. Then join us again when the intense \"symposium mode\" starts up again in September.\n\nYes, the next live, interactive 10-week session of ModPo will begin on September 8, 2018, and will conclude on November 19, 2018. Al Filreis will be in touch with you by email before the September 8 start of the course with all the information you\u0027ll need to participate. If you have questions, you can email the ModPo team at modpo@writing.upenn.edu.\n\nDuring the 10 weeks of the course, you will be guided through poems, video discussions of each poem, and community discussions of each poem. And (unique among open online courses) we offer weekly, interactive live webcasts. Our famed TAs also offer office hours throughout the week. We help arrange meet-ups and in-site study groups.\n\nIf you are curious about the ModPo team, type \"ModPo YouTube introduction\" into Google or your favorite search engine, and watch the 20-minute introductory video. You will get an overview of the course and will meet the brilliant TAs, who will be encountering the poems with you all the way to the end.\n\nIf you use Facebook, join the always-thriving ModPo group: from inside Facebook, search for \"Modern \u0026 Contemporary American Poetry\" and then request to be added as a member. If you have any questions about ModPo, you can post a question to the FB group and you\u0027ll receive an almost instant reply.\n\nWe tweet all year long at @ModPoPenn and you can also find ModPo colleagues using the hashtag #ModPoLive.\n\nModPo is hosted by—and is housed at—the Kelly Writers House at 3805 Locust Walk on the campus of the University of Pennsylvania in Philadelphia USA. All ModPo\u0027ers are welcome to visit the Writers House when they are in our area. Our discussions are filmed there. Our live webcasts take place in the famed \"Arts Cafe\" of the House. To find out what\u0027s going on at the Writers House any time, just dial 215-746-POEM.","tutor":"Al Filreis","provider":"Coursera","language":"English","skills":["poetry","usa","north america"],"subject":"Literature","studentsInterested":"11.8k","courseLink":"https://www.coursera.org/learn/modpo","classCentralLink":"https://www.class-central.com/course/coursera-modern-contemporary-american-poetry-modpo-356"},{"title":"Introduction to Philosophy","about":"This course will introduce you to some of the main areas of research in contemporary philosophy. Each module a different philosopher will talk you through some of the most important questions and issues in their area of expertise. We’ll begin by trying to understand what philosophy is – what are its characteristic aims and methods, and how does it differ from other subjects? Then we’ll spend the rest of the course gaining an introductory overview of several different areas of philosophy.\n\nTopics you’ll learn about will include:\n\nEpistemology, where we’ll consider what our knowledge of the world and ourselves consists in, and how we come to have it;\n\nPhilosophy of science, where we’ll investigate foundational conceptual issues in scientific research and practice;\n\nPhilosophy of Mind, where we’ll ask questions about what it means for something to have a mind, and how minds should be understood and explained;\n\nPolitical Philosophy, where we\u0027ll investigate whether we have an obligation to obey the law;\n\nMoral Philosophy, where we’ll attempt to understand the nature of our moral judgements and reactions – whether they aim at some objective moral truth, or are mere personal or cultural preferences, and;\n\nMetaphysics, where we’ll think through some fundamental conceptual questions about free will and the nature of reality.\n\nThe development of this MOOC has been led by the University of Edinburgh\u0027s Eidyn research centre.\n\nTo accompany \u0027Introduction to Philosophy\u0027, we are pleased to announce a tie-in book from Routledge entitled \u0027Philosophy for Everyone\u0027. This course companion to the \u0027Introduction to Philosophy\u0027 course was written by the Edinburgh Philosophy team expressly with the needs of MOOC students in mind. \u0027Philosophy for Everyone\u0027 contains clear and user-friendly chapters, chapter summaries, glossary, study questions, suggestions for further reading and guides to online resources. Please click \"Start Here\" and navigate to the \"Optional Reading\" page for more information.","tutor":"Dave Ward, Duncan Pritchard, Michela Massimi, Suilin Lavelle, Matthew Chrisman, Allan Hazlett and Alasdair Richmond","provider":"Coursera","language":"English","skills":["europe","scotland"],"subject":"Philosophy","studentsInterested":"4.5k","courseLink":"https://www.coursera.org/learn/philosophy","classCentralLink":"https://www.class-central.com/course/coursera-introduction-to-philosophy-418"},{"title":"Basic Spanish 2: One Step Further","about":"¡Bienvenidos y bienvenidas! (Welcome!) In this Spanish course, you will learn basic vocabulary to talk about yourself and your everyday life, in the present and in the past, in simple and brief communication situations, as well as about plans for an immediate future. At the end of the course you will be able to communicate in everyday situations according to the A1 proficiency level as described in the Common European Framework of Reference for Languages (CEFRL, Council of Europe).\nThe course, which is designed for English speakers, offers a variety of exercises after going through the stages of content presentation, comprehension and production. You have videos, small texts and audios to improve your pronunciation, glossaries, activities for oral practice with other course students, quizzes, grammar cards and recommendations on external Internet resources to continue learning more and more Spanish.\nThe topics on which the activities revolve are work life, family life, city life and outdoor life. As you can see, a bit of everything to be able talk about yourself and to engage in everyday communication.\nWe hope you like our menu. ¡Buen provecho! (Bon appétit!)","tutor":"Dra. Ana Gimeno, Ms. Cristina Navarro, Dra. Virginia González and Begoña García Migura","provider":"edX","language":"English","skills":["upvalenciax"],"subject":"Foreign Language","studentsInterested":"1.4k","courseLink":"https://www.edx.org/course/basic-spanish-2-one-step-further-upvalenciax-bsp102x-0","classCentralLink":"https://www.class-central.com/course/edx-basic-spanish-2-one-step-further-8672"},{"title":"Tsinghua Chinese: Start Talking with 1.3 Billion People","about":"This introductory Chinese language course will emphasize basic language skills for everyday life in Mandarin speaking countries.\nThe course utilizes pinyin, the standard system of Romanized spelling for transliterating Chinese, so learners will find it easy to understand and study the language.\nThe course is composed of several parts: Dialogues (taught through pinyin), listening comprehension exercises (in real-world situations), Chinese characters (frequently used in daily life), Mandarin songs, and Tea Time (tips for self-study).\nThis course is for anyone interested in learning Mandarin Chinese, especially if you plan to work or study in Mandarin-speaking countries. The course is also a good start toward the HSK Chinese proficiency test.","tutor":"Xia Ding, Xiaoning Wang, Li Lu and Yuan Li","provider":"edX","language":"English","skills":["tsinghuax"],"subject":"Foreign Language","studentsInterested":"4.8k","courseLink":"https://www.edx.org/course/tsinghua-chinese-start-talking-1-3-tsinghuax-tm01x-0","classCentralLink":"https://www.class-central.com/course/edx-tsinghua-chinese-start-talking-with-1-3-billion-people-5426"},{"title":"Shakespeare Matters","about":"Shakespeare’s work has influenced the way we think about our relationships and ourselves. His plays are still as relevant today as when they were written almost 400 years ago.\nIn this introductory course, you will learn how Shakespeare uses emotion in his plays, how his characters experience and manipulate emotions, and how the emotional resonance of the plays makes them powerfully relevant to the modern world.\nAs you follow and engage with the emotional journeys of characters in tragedy, comedy, tragicomedy, and history; you will discover patterns of plot, action, and speech that will help you appreciate, understand, and discuss Shakespeare’s plays.\nEach week of the course will focus on a different emotion. You’ll cover the range of emotions found in Hamlet, A Midsummer Night’s Dream, Othello, The Winter’s Tale, and King Henry V.\nThis course includes interactive activities, and interviews with a range of people engaged creatively and professionally with Shakespeare’s plays. You’ll be encouraged to interpret Shakespeare in your own way - to find ‘your Shakespeare.’\nYou will learn how to read a Shakespeare play and gain the tools you need to interpret its language. You will also have the opportunity to experience what it’s like to direct scenes from the plays. And you’ll learn about the various kinds of Shakespearean drama, and the dramatic and poetic techniques Shakespeare uses to investigate the human condition.","tutor":"Dr. Lucy Potter , Dr. Joy McEntee , Galen Cuthbertson , Dr. Edward Palmer , Aidan Coleman , Mahendra Chitrarasu and Prasanna Nidumolu","provider":"edX","language":"English","skills":["adelaidex"],"subject":"Literature","studentsInterested":"216","courseLink":"https://www.edx.org/course/shakespeare-matters-adelaidex-bard101x","classCentralLink":"https://www.class-central.com/course/edx-shakespeare-matters-8731"},{"title":"The Bible\u0027s Prehistory, Purpose, and Political Future","about":"With its walls razed to ground by Babylon’s armies, Jerusalem joined a long line of ancient vanquished cities—from Ur and Nineveh and Persepolis to Babylon itself. While some recovered from the destruction, others did not. But none responded to political catastrophe by fashioning the kind of elaborate and enduring monument to their own downfall that we find in the Bible. Most conquered populations viewed their subjugation as a source of shame. They consigned it to oblivion, opting instead to extol the golden ages of the past. The biblical authors in contrast reacted to loss by composing extensive writings that acknowledge collective failure, reflect deeply upon its causes, and discover thereby a ground for collective hope.\n\nWorking through colorful biblical and ancient Near Eastern texts, and drawing on an array of comparative examples, the course illustrates the thoroughgoing manner with which biblical authors responded to defeat by advancing a demotic agenda that places the community at the center. The aim of the biblical authors was to create a nation, and they sought to realize this goal via a shared text, which includes stories and songs, wisdom and laws. This corpus of writings belongs, without a doubt, to humanity’s greatest achievements. Whereas the great civilizations of the Near East invested their energies and resources into monuments of stone that could be destroyed by invading armies, the biblical authors left a literary legacy that has been intensively studied until the present day. More important, these authors’ visionary response to defeat brought to light a radical new wisdom: the notion that a people is greater than the state which governs it, and that a community can survive collapse when all of its members can claim a piece of the pie and therefore have a reason to take an active part in its collective life.","tutor":"Jacob Wright","provider":"Coursera","language":"English","skills":["bible","biblical studies","biblical history","christianity","usa","north america"],"subject":"Religion","studentsInterested":"8.3k","courseLink":"https://www.coursera.org/learn/bible-history","classCentralLink":"https://www.class-central.com/course/coursera-the-bible-s-prehistory-purpose-and-political-future-1406"},{"title":"Moralities of Everyday Life","about":"How can we explain kindness and cruelty? Where does our sense of right and wrong come from? Why do people so often disagree about moral issues? This course explores the psychological foundations of our moral lives.","tutor":"Paul Bloom","provider":"Coursera","language":"English","skills":["usa","north america"],"subject":"Philosophy","studentsInterested":"11.5k","courseLink":"https://www.coursera.org/learn/moralities","classCentralLink":"https://www.class-central.com/course/coursera-moralities-of-everyday-life-911"},{"title":"Grammar and Punctuation","about":"Course 1: Grammar and Punctuation\n\nDo you need to review English grammar? Have you forgotten the grammar you once studied? If so, this course is perfect for you.\n\nThe first course in this specialization is a refresher on some tools needed for good writing. It will help prepare you for the other courses. You will need about 10 hours to complete this first course. Writing is a skill and to learn a skill well, you need to practice. In this course, you will watch short video lectures and then practice and discuss what you have learned. Make sure you take good notes and use the peer discussions to ask questions. Then you\u0027ll be able to remember the rules you learn in this course when you start writing essays in the next course.\n\nAfter completing this course, you will be able to:\n- identify the correct verb tenses to use\n- use commas effectively\n- utilize several different sentence types\n- write more effectively in English\n\nPlease note that the free version of this class gives you access to all of the instructional videos and handouts. The peer feedback and quizzes are only available in the paid version.","tutor":"Tamy Chapman","provider":"Coursera","language":"English","skills":["grammar","usa","north america"],"subject":"Grammar \u0026 Writing","studentsInterested":"8.2k","courseLink":"https://www.coursera.org/learn/grammar-punctuation","classCentralLink":"https://www.class-central.com/course/coursera-grammar-and-punctuation-4236"},{"title":"The Ancient Greeks","about":"This is a survey of ancient Greek history from the Bronze Age to the death of Socrates in 399 BCE. Along with studying the most important events and personalities, we will consider broader issues such as political and cultural values and methods of historical interpretation.","tutor":"Andrew Szegedy-Maszak","provider":"Coursera","language":"English","skills":["usa","north america"],"subject":"History","studentsInterested":"5.4k","courseLink":"https://www.coursera.org/learn/ancient-greeks","classCentralLink":"https://www.class-central.com/course/coursera-the-ancient-greeks-502"},{"title":"The Modern World, Part One: Global History from 1760 to 1910","about":"This is a survey of modern history from a global perspective. Part One begins with the political and economic revolutions of the late 1700s and tracks the transformation of the world during the 1800s. Part One concludes as these bewildering changes seem to be running beyond the capacity of older institutions to handle them. Throughout the course we try to grasp what is happening and ask: Why? And the answers often turn on very human choices.","tutor":"Philip Zelikow","provider":"Coursera","language":"English","skills":["usa","north america"],"subject":"History","studentsInterested":"5.5k","courseLink":"https://www.coursera.org/learn/modern-world","classCentralLink":"https://www.class-central.com/course/coursera-the-modern-world-part-one-global-history-from-1760-to-1910-430"},{"title":"The Emergence of the Modern Middle East - Part I","about":"This course will discuss the emergence of the modern Middle East from the fall of the Ottoman Empire, at the end of the First World War to the present. It will discuss the Ottoman legacy in the region and the Western imperial impact on the creation of the Arab state system. The course will discuss the rise and retreat of Arab nationalism, the problems of internal cohesion of the Arab states, issues of religion and state, and the evolution of Islamist politics. It will also focus on the evolution of the Arab-Israeli conflict and its impact on the region and will conclude with an in depth analysis of the “Arab Spring” by placing these contemporary revolutionary events in their historical context.","tutor":"Asher Susser and Duygu Atlas","provider":"Coursera","language":"English","skills":["asia","israel"],"subject":"History","studentsInterested":"3.7k","courseLink":"https://www.coursera.org/learn/modern-middle-east-1","classCentralLink":"https://www.class-central.com/course/coursera-the-emergence-of-the-modern-middle-east-part-i-976"},{"title":"English Grammar and Style","about":"With the rise of social media and the Internet, many people are writing more today for different mediums than ever before. We’ll present materials that cover grammatical principles, word usage, writing style, sentence and paragraph structure, and punctuation. We’ll introduce you to some marvelous resources that we have annotated for your guidance. We’ll show you video clips of interviews conducted with distinguished grammarians, challenge you with quizzes and writing activities that will give you strategies to help you to build skills that will enhance the quality of your writing, and invite you to participate in discussions and assess the work of your peers.","tutor":"Roslyn Petelin","provider":"edX","language":"English","skills":["uqx"],"subject":"Grammar \u0026 Writing","studentsInterested":"3.0k","courseLink":"https://www.edx.org/course/english-grammar-style-uqx-write101x-6","classCentralLink":"https://www.class-central.com/course/edx-english-grammar-and-style-2022"},{"title":"Tibetan Buddhist Meditation and the Modern World: Lesser Vehicle","about":"Tibetan Buddhist Meditation and the Modern World explores the immense variety of meditation practices past and present. We present their histories, their philosophical underpinnings, their transformations in the modern global world, and we give you a chance to reflect upon meditation practices through secular contemplations designed just for this course.\n\nWe use a traditional, if overly simplistic, way of grouping Buddhist philosophical systems and ritual-contemplative practices into “three vehicles”, three programs of theory and practice supporting the personal journey from suffering to enlightenment. This scheme became normative in India and Tibet: (i) the Lesser Vehicle (Hīnayāna), (ii) the Great Vehicle (Mahāyāna), and (iii) the Adamantine Vehicle (Vajrayāna), also referred to as “esoteric Buddhism” or “Buddhist tantra”. To this, we will add a fourth Vehicle which is explicit in many Tibetan materials, though no standard term ever emerged that was accepted by all sectarian traditions - we will thus term it as the “Natural Vehicle” or “Post Tantra”. We follow an indigenous Tibetan tradition in terms of characterizing each with a specific orientational paradigm - repression, refinement, transformation, and natural freedom. These twelve meditative traditions constitute the framework for the course’s discussion of the main streams of Tibetan Buddhist meditation.\n\nThe five modules of the present course, dedicated to \"Lesser Vehicle\" practices and perspectives, treat the first five of these twelve types. Each module in turn has four components: (i) the specific Buddhist meditation in its traditional presentation and practice; (ii) modern scientific research into its efficacy and dynamics, or on practices, principles, and processes related to this type of meditation in our analysis; (iii) the fact, problems, and opportunities of modern secular adaptations in a variety of educational, professional, and personal settings; and (iv) secular practices for experimentation, which are either direct adaptations or new practices designed to give an experiential sense of some of the principles underlying the Buddhist meditative practice.","tutor":"Kurtis Schaeffer and David Germano","provider":"Coursera","language":"English","skills":["usa","north america"],"subject":"Religion","studentsInterested":"669","courseLink":"https://www.coursera.org/learn/buddhist-meditation","classCentralLink":"https://www.class-central.com/course/coursera-tibetan-buddhist-meditation-and-the-modern-world-lesser-vehicle-1342"},{"title":"Philosophy, Science and Religion: Philosophy and Religion","about":"Philosophy, Science and Religion mark three of the most fundamental modes of thinking about the world and our place in it. Are these modes incompatible? Put another way: is the intellectually responsible thing to do to ‘pick sides’ and identify with one of these approaches at the exclusion of others? Or, are they complementary or mutually supportive? As is typical of questions of such magnitude, the devil is in the details. For example, it is important to work out what is really distinctive about each of these ways of inquiring about the world. In order to gain some clarity here, we’ll be investigating what some of the current leading thinkers in philosophy, science and religion are actually doing.\n\nThis course, entitled ‘Philosophy and Religion’, is the second of three related courses in our Philosophy, Science and Religion Online series, and in this course we will ask important questions about the age-old debate between science and religion, such as:\n\n• What kind of conflicts are there between religion and science?\n• Does current cognitive science of religion effectively explain away God?\n• If there is a God who has made us so that we can know him, why do some people not believe?\n• Is belief in science also a kind of fundamentalism?\n• What makes us good at getting, giving, or sharing, knowledge? Is this different when it is religious knowledge?\n\nThe first course in the Philosophy, Science and Religion series, \u0027Science and Philosophy\u0027 was launched early in 2017 and you can sign up to it at any time. The third course —‘Religion and Science’—will be launched early in 2018. Completing all three courses will give you a broader understanding of this fascinating topic. Look for:\n\n• Philosophy, Science and Religion I: Science and Philosophy https://www.coursera.org/learn/philosophy-science-religion-1/\n• Philosophy, Science and Religion III: Religion and Science\n\nUpon successful completion of all three courses, students will:\n\n(1) Understand the main parameters at stake in the current debate between science and religion.\n(2) Have some familiarity with the relevant areas of science that feature in the debate—including cosmology, evolution, and the neurosciences—and will have begun to engage with them conceptually.\n(3) Have encountered key philosophical approaches to the interface between science and religion, and will have had the opportunity to engage them in practice.\n(4) Have embarked constructively in cross-disciplinary conversations.\n(5) Have demonstrated an openness to personal growth through a commitment to dialogue across intellectual and spiritual boundaries.\n\nYou can also follow us on Twitter at https://twitter.com/EdiPhilOnline and you can follow the hashtag #psrmooc","tutor":"Dr J Adam Carter, Dr Orestis Palermos, Dr Mark Harris, Dr Mog Stapleton and Professor Duncan Pritchard","provider":"Coursera","language":"English","skills":["new-moocs-2017"],"subject":"Philosophy","studentsInterested":"1.0k","courseLink":"https://www.coursera.org/learn/philosophy-science-religion-2","classCentralLink":"https://www.class-central.com/course/coursera-philosophy-science-and-religion-philosophy-and-religion-9085"},{"title":"How to Write an Essay","about":"College Writing 2.1x is an introduction to academic writing for English Language Learners, focusing on essay development, grammatical correctness, and self-editing. The five-week course includes a review of basic grammar terminology and understanding; writing effective sentences and paragraphs; introductions and conclusions; strategies for writing longer texts; and thesis statements. The course materials will be offered via readings and videos. An optional course workbook, in ebook form, may be used for additional writing work. Students will participate in online discussions as well as peer review. Students will complete an essay for this part of the course.\nIn partnership with the U.S. Department of State\nUC Berkeley is partnering with the U.S. Department of State to extend the reach of College Writing 2X. Participating U.S. Embassies will host in-person, facilitated discussions sessions around the course content in order to maximize the learning experience. The State Department-supported EducationUSA network will also offer facilitated discussions in some locations for students interested in pursuing higher education in the United States. This partnership is part of the English Education Alliance (E2A), a global effort of the U.S. Department of State to address the global demand for 21st century English language skills.","tutor":"Maggie Sokolik","provider":"edX","language":"English","skills":["uc berkeleyx"],"subject":"Grammar \u0026 Writing","studentsInterested":"1.7k","courseLink":"https://www.edx.org/course/how-write-essay-uc-berkeleyx-colwri2-1x-3","classCentralLink":"https://www.class-central.com/course/edx-how-to-write-an-essay-1333"},{"title":"The Modern and the Postmodern (Part 1)","about":"This course examines how the idea of \"the modern\" develops at the end of the 18th century in European philosophy and literature, and how being modern (or progressive, or hip) became one of the crucial criteria for understanding and evaluating cultural change. Are we still in modernity, or have we moved beyond the modern to the postmodern?","tutor":"Michael S. Roth","provider":"Coursera","language":"English","skills":["usa","north america"],"subject":"History","studentsInterested":"5.6k","courseLink":"https://www.coursera.org/learn/modern-postmodern-1","classCentralLink":"https://www.class-central.com/course/coursera-the-modern-and-the-postmodern-part-1-598"},{"title":"Chinese for Beginners","about":"Nowadays, there is an increasing number of people who are interested in Chinese culture and language. And it is useful to know about the language when coming to China for travel or business. This is an ABC Chinese course for beginners, including introduction of phonetics and daily expressions. After taking this class, learners can have a basic understanding of Chinese Mandarin and make basic conversations of daily living such as exchanging personal information, talking about daily arrangements and food, asking about price, introducing the city and the weather, telling your hobbies etc. Selected topics and situations come from real life scenarios and can be used for everyday communications. In addition to the dialogues, the selection of reading materials and practice activities will make the content as rich and varied as possible, in order to stimulate the learners’ interests. This is an elementary course on Chinese speaking. The learners don’t need to study Chinese characters, so it is easier to follow and complete this course.","tutor":"Xiaoyu Liu","provider":"Coursera","language":"English","skills":["language teaching","china","asia"],"subject":"Foreign Language","studentsInterested":"955","courseLink":"https://www.coursera.org/learn/learn-chinese","classCentralLink":"https://www.class-central.com/course/coursera-chinese-for-beginners-2353"},{"title":"The French Revolution","about":"The French Revolution was one of the most important upheavals in world history. This course examines its origins, course and outcomes.\n\nThis course is designed for you to work through successfully on your own. However you will not be alone on this journey. Use the resources included in the course and take part in the suggested learning activities to get the most out of your learning. To successfully complete this course, it is recommended that you devote at least six hours to every module over the six weeks of the course. In that time you should watch the video lectures, reflect and respond to in-video pause points, and complete the quizzes.\n\nAs part of the required reading for this course, during each week of this course you will have free access to a chapter of Peter McPhee\u0027s textbook, The French Revolution, which is also available for purchase as an e-book.\n\nView the MOOC promotional video here: http://tinyurl.com/gstw4vv","tutor":"Peter McPhee","provider":"Coursera","language":"English","skills":["australia"],"subject":"History","studentsInterested":"3.8k","courseLink":"https://www.coursera.org/learn/french-revolution","classCentralLink":"https://www.class-central.com/course/coursera-the-french-revolution-1705"},{"title":"Greek and Roman Mythology","about":"Myths are traditional stories that have endured over a long time. Some of them have to do with events of great importance, such as the founding of a nation. Others tell the stories of great heroes and heroines and their exploits and courage in the face of adversity. Still others are simple tales about otherwise unremarkable people who get into trouble or do some great deed. What are we to make of all these tales, and why do people seem to like to hear them? This course will focus on the myths of ancient Greece and Rome, as a way of exploring the nature of myth and the function it plays for individuals, societies, and nations. We will also pay some attention to the way the Greeks and Romans themselves understood their own myths. Are myths subtle codes that contain some universal truth? Are they a window on the deep recesses of a particular culture? Are they a set of blinders that all of us wear, though we do not realize it? Or are they just entertaining stories that people like to tell over and over? This course will investigate these questions through a variety of topics, including the creation of the universe, the relationship between gods and mortals, human nature, religion, the family, sex, love, madness, and death.\n***********************************************************************************************************\n\nCOURSE SCHEDULE\n\n• Week 1: Introduction\nWelcome to Greek and Roman Mythology! This first week we’ll introduce the class, paying attention to how the course itself works. We’ll also begin to think about the topic at hand: myth! How can we begin to define \"myth\"? How does myth work? What have ancient and modern theorists, philosophers, and other thinkers had to say about myth? This week we’ll also begin our foray into Homer’s world, with an eye to how we can best approach epic poetry.\nReadings: No texts this week, but it would be a good idea to get started on next week\u0027s reading to get ahead of the game.\nVideo Lectures: 1.1-1.7\nQuiz: Complete the quiz by the end of the week.\n\n• Week 2: Becoming a Hero\nIn week 2, we begin our intensive study of myth through Homer’s epic poem, the Odyssey. This core text not only gives us an exciting story to appreciate on its own merits but also offers us a kind of laboratory where we can investigate myth using different theoretical approaches. This week we focus on the young Telemachus’ tour as he begins to come of age; we also accompany his father Odysseus as he journeys homeward after the Trojan War. Along the way, we’ll examine questions of heroism, relationships between gods and mortals, family dynamics, and the Homeric values of hospitality and resourcefulness.\nReadings: Homer, Odyssey, books 1-8\nVideo Lectures: 2.1-2.10\nQuiz: Complete the quiz by the end of the week.\n\n• Week 3: Adventures Out and Back\nThis week we’ll follow the exciting peregrinations of Odysseus, \"man of twists and turns,\" over sea and land. The hero’s journeys abroad and as he re-enters his homeland are fraught with perils. This portion of the Odyssey features unforgettable monsters and exotic witches; we also follow Odysseus into the Underworld, where he meets shades of comrades and relatives. Here we encounter some of the best-known stories to survive from all of ancient myth.\nReadings: Homer, Odyssey, books 9-16\nVideo Lectures: 3.1-3.10\nQuiz: Complete the quiz by the end of the week.\n\n• Week 4: Identity and Signs\nAs he makes his way closer and closer to re-taking his place on Ithaca and with his family, a disguised Odysseus must use all his resources to regain his kingdom. We’ll see many examples of reunion as Odysseus carefully begins to reveal his identity to various members of his household—his servants, his dog, his son, and finally, his wife Penelope—while also scheming against those who have usurped his place.\nReadings: Homer, Odyssey, books 17-24\nVideo Lectures: 4.1-4.8\nQuiz: Complete the quiz by the end of the week.\n\n• Week 5: Gods and Humans\nWe will take a close look at the most authoritative story on the origin of the cosmos from Greek antiquity: Hesiod’s Theogony. Hesiod was generally considered the only poet who could rival Homer. The Theogony, or \"birth of the gods,\" tells of an older order of gods, before Zeus, who were driven by powerful passions—and strange appetites! This poem presents the beginning of the world as a time of fierce struggle and violence as the universe begins to take shape, and order, out of chaos.\nReadings: Hesiod, Theogony *(the Works and Days is NOT required for the course)*\nVideo Lectures: 5.1-5.9\nQuiz: Complete the quiz by the end of the week.\n\n• Week 6: Ritual and Religion\nThis week’s readings give us a chance to look closely at Greek religion in its various guises. Myth, of course, forms one important aspect of religion, but so does ritual. How ancient myths and rituals interact teaches us a lot about both of these powerful cultural forms. We will read two of the greatest hymns to Olympian deities that tell up-close-and-personal stories about the gods while providing intricate descriptions of the rituals they like us humans to perform.\nReadings: Homeric Hymn to Apollo; Homeric Hymn to Demeter (there are two hymns to each that survive, only the LONGER Hymn to Apollo and the LONGER Hymn to Demeter are required for the course)\nVideo Lectures: 6.1-6.7\nQuiz: Complete the quiz by the end of the week.\n\n• Week 7: Justice\nWhat counts as a just action, and what counts as an unjust one? Who gets to decide? These are trickier questions than some will have us think. This unit looks at one of the most famously thorny issues of justice in all of the ancient world. In Aeschylus’ Oresteia—the only surviving example of tragedy in its original trilogy form—we hear the story of Agamemnon’s return home after the Trojan War. Unlike Odysseus’ eventual joyful reunion with his wife and children, this hero is betrayed by those he considered closest to him. This family\u0027s cycle of revenge, of which this story is but one episode, carries questions of justice and competing loyalties well beyond Agamemnon’s immediate family, eventually ending up on the Athenian Acropolis itself.\nReadings: Aeschylus, Agamemnon; Aeschylus, Eumenides\nVideo Lectures: 7.1-7.10\nQuiz: Complete the quiz by the end of the week.\n\n• Week 8: Unstable Selves\nThis week we encounter two famous tragedies, both set at Thebes, that center on questions of guilt and identity: Sophocles’ Oedipus Rex and Eurpides’ Bacchae. Oedipus is confident that he can escape the unthinkable fate that was foretold by the Delphic oracle; we watch as he eventually realizes the horror of what he has done. With Odysseus, we saw how a great hero can re-build his identity after struggles, while Oedipus shows us how our identities can dissolve before our very eyes. The myth of Oedipus is one of transgressions—intentional and unintentional—and about the limits of human knowledge. In Euripides’ Bacchae, the identity of gods and mortals is under scrutiny. Here, Dionysus, the god of wine and of tragedy, and also madness, appears as a character on stage. Through the dissolution of Pentheus, we see the terrible consequences that can occur when a god’s divinity is not properly acknowledged.\nReadings: Sophocles, Oedipus Rex; Euripides, Bacchae\nVideo Lectures: 8.1-8.9\nQuiz: Complete the quiz by the end of the week.\n\n• Week 9: The Roman Hero, Remade\nMoving ahead several centuries, we jump into a different part of the Mediterranean to let the Romans give us their take on myth. Although many poets tried to rewrite Homer for their own times, no one succeeded quite like Vergil. His epic poem, the Aeneid, chronicles a powerful re-building of a culture that both identifies with and defines itself against previously told myths. In contrast to the scarcity of information about Homer, we know a great deal about Vergil’s life and historical context, allowing us insight into myth-making in action.\nReadings: Vergil, Aeneid, books 1-5\nVideo Lectures: 9.1-9.10\nQuiz: Complete the quiz by the end of the week.\n\n• Week 10: Roman Myth and Ovid\u0027s Metamorphoses\nOur consideration of Vergil’s tale closes with his trip to the underworld in book 6. Next, we turn to a more playful Roman poet, Ovid, whose genius is apparent in nearly every kind of register. Profound, witty, and satiric all at once, Ovid’s powerful re-tellings of many ancient myths became the versions that are most familiar to us today. Finally, through the lens of the Romans and others who \"remythologize,\" we wrap up the course with a retrospective look at myth.\nReadings: Vergil, Aeneid, book 6; Ovid, Metamorphoses, books 3, 12, and 13.\nVideo Lectures: 10.1-10.9.\nQuiz: Complete the quiz by the end of the week.\n\n***********************************************************************************************************\nREADINGS\nThere are no required texts for the course, however, Professor Struck will make reference to the following texts in the lecture:\n• Greek Tragedies, Volume 1, David Grene and Richmond Lattimore, trans. (Chicago)\n• Greek Tragedies, Volume 3, David Grene and Richmond Lattimore , trans. (Chicago)\n• Hesiod, Theogony and Works and Days, M. L. West, trans. (Oxford)\n• Homeric Hymns, Sarah Ruden, trans. (Hackett)\n• Homer, The Odyssey, Robert Fagles, trans. (Penguin)\n• Virgil, The Aeneid, Robert Fitzgerald, trans. (Vintage)\n• Ovid, Metamorphoses, David Raeburn, trans. (Penguin)\n\nThese translations are a pleasure to work with, whereas many of the translations freely available on the internet are not. If you do not want to purchase them, they should also be available at many libraries. Again, these texts are not required, but they are helpful.","tutor":"Peter Struck","provider":"Coursera","language":"English","skills":["usa","north america"],"subject":"Humanities","studentsInterested":"5.9k","courseLink":"https://www.coursera.org/learn/mythology","classCentralLink":"https://www.class-central.com/course/coursera-greek-and-roman-mythology-353"},{"title":"Magic in the Middle Ages","about":"Magical thought has always attracted human imagination. In this course we will introduce you to the Middle Ages through a wide conception of magic. Students will have an approach to medieval culture, beliefs and practices from the perspective of History and History of Science. Popular magic, as well as learned magic (alchemy, geomancy and necromancy) will be addressed. Moreover, we will also deal with how eastern practices and texts influenced western culture. In July 2016, the course will contain a brand-new module devoted to astrology. Magic in the Middle Ages offers a captivating overview of medieval society and promotes reflection about certain stereotypes associated with this period.\n\nAt the end of the course, the students:\n\na) will have overcome the usual prejudices about the Middle Ages,\nb) will be able to analyze historical documentation from the Middle Ages and recognize the most common patterns of juridical documents regarding witchcraft, and\nc) will be capable of distinguishing between popular magic and the magic of the learned people; will have a notion of which spiritual practices were allowed in medieval Europe and which ones were related to the devil, and will be aware of the link between a cultural product and the society that produced it.\n\nThis course is taught in English, although subtitles in English, Catalan and Spanish will also be provided.\n\nCOURSE SYLLABUS\n\nWeek 1. Introduction to medieval magic (Pau Castell).\n\nWeek 2. Magic \u0026 Heresy (Delfi I. Nieto-Isabel).\n\nWeek 3. From Magic to Witchcraft (Pau Castell).\n\nWeek 4. Magic in Islam (Godefroid de Callataÿ and Sébastien Moureau).\n\nWeek 5. Astrology \u0026 Geomancy (Theo Loinaz, Delfi I. Nieto-Isabel, Godefroid de Callataÿ and Blanca Villuendas).\n\n© Gemma Pellissa Prades (coord.), Delfi I. Nieto-Isabel and Joana Palau Mumany\nMagic in the Middle Ages by Gemma Pellissa Prades (coord.), Delfi I. Nieto-Isabel and Joana Palau Mumany is licensed under a Creative Commons Attribution-NonCommercial-NoDerivatives 4.0 International License.","tutor":"Noemí Alvarez da Silva, Godefroid de Callataÿ, Pau Castell Granados, Sébastien Moureau, Gemma Pellissa Prades and Delfi Nieto-Isabel","provider":"Coursera","language":"English","skills":["spain","europe","middle ages","alchemy","magic"],"subject":"History","studentsInterested":"852","courseLink":"https://www.coursera.org/learn/magic-middle-ages","classCentralLink":"https://www.class-central.com/course/coursera-magic-in-the-middle-ages-3477"},{"title":"Patrick Henry: Forgotten Founder","about":"“Give me liberty, or give me death:” Remembering Patrick Henry, the Forgotten Founder\n\nPatrick Henry was enormously popular during the American Revolution. Even Thomas Jefferson, who over time developed a deep loathing of Henry (some would say jealousy), had to admit that “it is not now easy to say what we should have done without Patrick Henry.” Edmund Randolph, a patriot leader in his own right, explained that “It was Patrick Henry … awakening the genius of his country, and binding a band of patriots together to hurl defiance at the tyranny of so formidable a nation as Great Britain.”\nYet, today, Patrick Henry is ill-remembered; most Americans might recall at best perhaps a snippet from a famous speech: “give me liberty, or give me death.” The reasons for our historic forgetfulness are several: after the Revolution, Henry chose to oppose ratification of the U.S. Constitution, believing that it created a distant and too-powerful government, and he refused proffered position in George Washington’s administration, diminishing his historic memory. Equally important, Henry died in 1799 shortly after a political campaign in which, at Washington’s behest, he opposed Jefferson’s and James Madison’s ill-advised radical states’ rights attack on the U.S. government, and Jefferson spent the next twenty-six years systematically attacking Henry’s legacy.\nPatrick Henry, who helped to ignite a revolution, deserves better. This course will explore how he over¬came challenges to reach the pinnacle of Virginia politics and unite Americans behind a challenge to Britain – the eighteenth century’s super-power, why he opposed the U.S. Constitu¬tion, and why he then came out of retirement to defend the people’s Constitution against the attacks of Jefferson and Madison.\nParticipants should evaluate Henry’s role in proclaiming a revolution and consider whether he had an equally important role in saving it. The course should also develop an improved appreciation for the complex political, economic, and religious forces that shaped the early republic. As a biographical course, it also demonstrates how personalities play an important role in even the most foundational national history.\n\n\nImage Attribution:\nThe background image for this webpage is Patrick Henry before the Virginia House of Burgesses by Peter F. Rothermel (1851) with special thanks to the owner, the Patrick Henry Memorial Foundation. The painting of Patrick Henry\u0027s 1765 \"Caesar had his Brutus\" speech (discussed in the second lecture) is entirely romanticized -- neither Henry nor the House of Burgesses looked at all like this -- but it does show that hagiography of Henry, almost god-like veneration, began shortly after this death.","tutor":"John Ragosta","provider":"Coursera","language":"English","skills":["new-moocs-2017"],"subject":"History","studentsInterested":"497","courseLink":"https://www.coursera.org/learn/henry","classCentralLink":"https://www.class-central.com/course/coursera-patrick-henry-forgotten-founder-8669"},{"title":"English Composition I","about":"You will gain a foundation for college-level writing valuable for nearly any field. Students will learn how to read carefully, write effective arguments, understand the writing process, engage with others\u0027 ideas, cite accurately, and craft powerful prose.\n\nCourse Learning Objectives\n• Summarize, analyze, question, and evaluate written and visual texts\n• Argue and support a position\n• Recognize audience and disciplinary expectations\n• Identify and use the stages of the writing process\n• Identify characteristics of effective prose\n• Apply proper citation practices\n• Discuss applying your writing knowledge to other writing occasions","tutor":"Denise Comer","provider":"Coursera","language":"English","skills":["usa","north america"],"subject":"Grammar \u0026 Writing","studentsInterested":"1.6k","courseLink":"https://www.coursera.org/learn/english-composition","classCentralLink":"https://www.class-central.com/course/coursera-english-composition-i-617"},{"title":"The Great Poem Series: Unbinding Prometheus","about":"Note: The next iteration of the MOOC, revised to include ten of Shelley\u0027s major works along with Prometheus Unbound, will run on Open Learning  starting February 17th, 2017 and run until June 9th, 2017.\nOver 8 weeks, we will encounter and discuss one long poem, Percy Shelley\u0027s Prometheus Unbound.  \nShelley wrote this as a lyrical drama, most likely intending its performance primarily to be in the minds of his readers. Marcia Hepps, Peter Schwarz and Jim Schlatter of the Unbinding Prometheus team are producing an abridged  live concert performance at Kelly Writers House at the University of Pennsylvania on September 18th, 2014.  This course will make use of the performance video to consider and discuss aspects of the performance of Shelley\u0027s work.  Additionally, Unbinding Prometheus is also producing a complete, unabridged studio recording of the entire poem. Our MOOC students will thus be able to utilise a complete, multi-part audio-video-text alignment to assist their studies.  \nOur video-recorded lessons are various. About half consist of a mix of short lectures, interviews and conversations with literary critics and scholars, poets, as well as philosophers, actors, directors, historians, and groups of students. \nAnother half are collaborative close seminar readings by the Unbinding Prometheus seminar group, led by Eric Alan Weinstein.  These offer sample models of readers\u0027 engagement with, and interpretations of, this unique and  powerful poem. \nFinally, twice a week there will be opportunities to participate in live, global, online seminars where you get to join us, and become part of our course\u0027s shared video content. You do not need to participate in these live events if you would prefer not to---but we gently encourage you to do so. They\u0027re fun!","tutor":"Eric Alan Weinstein","provider":"OpenLearning","language":"English","skills":["poetry"],"subject":"Literature","studentsInterested":"2.7k","courseLink":"https://www.openlearning.com/courses/percyshelley-unbindingprometheus","classCentralLink":"https://www.class-central.com/course/openlearning-the-great-poem-series-unbinding-prometheus-2425"},{"title":"SciWrite: Writing in the Sciences","about":"This course teaches scientists to become more effective writers, using practical examples and exercises. Topics include: principles of good writing, tricks for writing faster and with less anxiety, the format of a scientific manuscript, and issues in publication and peer review. Students from non-science disciplines can benefit from the training provided in the first four weeks (on general principles of effective writing).","tutor":"Kristin Sainani","provider":"Stanford OpenEdx","language":"English","skills":["usa","north america"],"subject":"Grammar \u0026 Writing","studentsInterested":"2.4k","courseLink":"https://lagunita.stanford.edu/courses/Medicine/SciWrite-SP/SelfPaced/about","classCentralLink":"https://www.class-central.com/course/stanford-openedx-sciwrite-writing-in-the-sciences-1183"},{"title":"Getting Started with Essay Writing","about":"Course 2: Getting Started with Essay Writing\n\nThis is the second course in the Academic English: Writing specialization. By introducing you to three types of academic essays, this course will especially help prepare you for work in college classes, but anyone who wants to improve his or her writing skills can benefit from this course.\n\nAfter completing this course, you will be able to:\n- create effective thesis statements for your essays\n- plan and write compare/contrast, cause/effect, and argument essays\n- write well-developed body paragraphs\n\nNote: The lectures and practice activities are available for free, but you must upgrade to the pay version in order to take the quizzes and get feedback on writing assignments.","tutor":"Tamy Chapman","provider":"Coursera","language":"English","skills":["essay writing","college writing","usa","north america"],"subject":"Grammar \u0026 Writing","studentsInterested":"3.3k","courseLink":"https://www.coursera.org/learn/getting-started-with-essay-writing","classCentralLink":"https://www.class-central.com/course/coursera-getting-started-with-essay-writing-4363"},{"title":"Empire: the Controversies of British Imperialism","about":"Explore the British Empire through six controversial themes\nOver six weeks, we’ll explore the British Empire through six themes - money, violence, race, religion, gender and sex, and propaganda. You’ll get to hear the stories of the fascinating individuals who contributed to both its rise and fall.\nAlong the way, you’ll be able to debate the questions these themes raise with learners from around the world, and draw your own conclusions.\nYou can start to explore the Empire and find out more about the Centre for Imperial and Global History on its blog, Imperial \u0026 Global Forum, or by following @ExeterCIGH on Twitter.\nThis course is intended for anyone with an interest in imperial history. It doesn’t require any reading before you start or previous experience of studying the subject.","tutor":"Richard Toye","provider":"FutureLearn","language":"English","skills":["europe","history","uk"],"subject":"History","studentsInterested":"322","courseLink":"https://www.futurelearn.com/courses/empire","classCentralLink":"https://www.class-central.com/course/futurelearn-empire-the-controversies-of-british-imperialism-2868"},{"title":"England in the Time of King Richard III","about":"Travel back to the 15th century and explore life during the time of Richard III\nThe discovery of the skeleton of Richard III in a Leicester car park - and the recent revelations of an infidelity within his family’s bloodline - have made headline news around the world.\nGo beyond the headlines with this online course. You’ll learn from scholars at the University of Leicester not only about the discovery of Richard III, but about England during his life time. Each week you’ll examine a different aspect of the 15th century period, including medieval warfare, food and culture, death and commemoration and more. Now’s your chance to travel back in time.\nAnyone interested in medieval England or the recent discovery and reburial of Richard III will find something to fuel their interest here. No prior knowledge or expertise are needed.","tutor":"Deirdre O\u0027Sullivan","provider":"FutureLearn","language":"English","skills":["europe","uk"],"subject":"History","studentsInterested":"606","courseLink":"https://www.futurelearn.com/courses/england-of-richard-third","classCentralLink":"https://www.class-central.com/course/futurelearn-england-in-the-time-of-king-richard-iii-1250"},{"title":"Writing for Young Readers: Opening the Treasure Chest","about":"This course is for curious students and aspiring authors with a passion for writing for young readers. Participate in a dynamic online community of writers as you experiment with your own writing and develop your voice. This course will guide you with a combination of video lectures, online readings, peer reviews, and guest appearances from world-renowned children’s authors. As you work through the writing exercises, you will give and receive feedback from your peers and gain tools and techniques for improving your writing.\n\nDuring this course you will identify stories that matter to you, explore cultural significance and boundaries, and shape your identity as a writer; become familiar with standard elements of narrative (character, setting, plot, theme, language, dialogue, point of view); reflect on your own work and practice essential self-editing skills; see the different ways in which words and art interact, and the possibilities of longer narrative forms; come away with practical insights into publishing options; and create a plan for pursuing your enthusiasm for writing. By the end of the course, you will have ten to twelve extracts of writing that you can develop into a portfolio.\n\nJoin a dynamic community of many voices from around the world. Find inspiration in your own voice, heart, and place so that you can tell the stories for young readers you’ve always wanted to tell.","tutor":"Maria Gill and David Hill","provider":"Coursera","language":"English","skills":["writing","europe","children","uk"],"subject":"Grammar \u0026 Writing","studentsInterested":"1.6k","courseLink":"https://www.coursera.org/learn/writing-for-children","classCentralLink":"https://www.class-central.com/course/coursera-writing-for-young-readers-opening-the-treasure-chest-3884"},{"title":"Introduction to Logic","about":"This course is an introduction to Logic from a computational perspective. It shows how to encode information in the form of logical sentences; it shows how to reason with information in this form; and it provides an overview of logic technology and its applications - in mathematics, science, engineering, business, law, and so forth.","tutor":"Michael Genesereth","provider":"Coursera","language":"English","skills":["usa","north america"],"subject":"Philosophy","studentsInterested":"1.1k","courseLink":"https://www.coursera.org/learn/logic-introduction","classCentralLink":"https://www.class-central.com/course/coursera-introduction-to-logic-329"},{"title":"Start Writing Fiction","about":"Discover the rituals and approaches that successful fiction writers use\nOn this online course, established writers – including Louis de Bernières, Patricia Duncker, Alex Garland, Abdulrazak Gurnah, Tim Pears, Michèle Roberts and Monique Roffey – will talk about how they started writing.\nYou’ll consider the rituals of writing and keeping a journal; learn how to develop your ideas; reflect on your own writing and editing; hear writers talk about their approach to research; and start turning events into plot.\nYou’ll also have the opportunity to review the work of fellow writers and receive comments on your own, learning to read as a writer and respond to feedback.\nThis course is intended for those with an interest in starting to write fiction or improving their fiction writing, and does not require any previous experience of studying this subject.\nPlease be aware that participation in this course involves reviewing work posted by other learners. You may find some material used in these stories is of an adult nature (e.g. language, sex, violence) and although captured in context, may offend. Learners on this course are instructed to place warnings at the top of their work to indicate use of such content.\nRecommended for learners age 16+.","tutor":"Derek Neale","provider":"FutureLearn","language":"English","skills":["europe","uk"],"subject":"Grammar \u0026 Writing","studentsInterested":"6.0k","courseLink":"https://www.futurelearn.com/courses/start-writing-fiction","classCentralLink":"https://www.class-central.com/course/futurelearn-start-writing-fiction-1759"},{"title":"First Step Korean","about":"This is an elementary-level Korean language course, consisting of 5 lessons with 4 units, and covers 4 skills: reading, writing, listening and speaking. The main topics include basic expressions used in everyday life, such as greetings, introducing yourself, talking about your family and a daily life and so on. Each lesson covers dialogues, pronunciation, vocabulary, grammar, quizzes and role-plays.\n\nAfter completing this course, you will be able to\n1. read and write Korean alphabet.\n2. communicate in Korean with basic expressions.\n3. learn basic knowledge on Korean culture.\n\nIt’s fun and easy to follow! Enjoy it!","tutor":"Seung Hae Kang","provider":"Coursera","language":"English","skills":["asia","korean language","korean","south korea"],"subject":"Foreign Language","studentsInterested":"487","courseLink":"https://www.coursera.org/learn/learn-korean","classCentralLink":"https://www.class-central.com/course/coursera-first-step-korean-5730"},{"title":"The Emergence of the Modern Middle East - Part II","about":"This course will discuss the developments in the Middle East from the early 20th century to the present. It will discuss the rise and retreat of Arab nationalism, the problems of internal cohesion of the Arab states, issues of religion and state, and the evolution of Islamist politics. It will also focus on the evolution of the Arab-Israeli conflict and its impact on the region and will conclude with an in depth analysis of the “Arab Spring” by placing these contemporary revolutionary events in their historical context.\n\nPlease note that this course builds upon a previous course - The Emergence of the Modern Middle East - Part I\n\nLearn about the history of the Middle East for a deeper understanding of current regional developments!","tutor":"Asher Susser and Duygu Atlas","provider":"Coursera","language":"English","skills":["asia","israel"],"subject":"History","studentsInterested":"2.2k","courseLink":"https://www.coursera.org/learn/modern-middle-east-2","classCentralLink":"https://www.class-central.com/course/coursera-the-emergence-of-the-modern-middle-east-part-ii-3204"},{"title":"Søren Kierkegaard - Subjectivity, Irony and the Crisis of Modernity","about":"It is often claimed that relativism, subjectivism and nihilism are typically modern philosophical problems that emerge with the breakdown of traditional values, customs and ways of life. The result is the absence of meaning, the lapse of religious faith, and feeling of alienation that is so widespread in modernity.\n\nThe Danish thinker Søren Kierkegaard (1813-55) gave one of the most penetrating analyses of this complex phenomenon of modernity. But somewhat surprisingly he seeks insight into it not in any modern thinker but rather in an ancient one, the Greek philosopher Socrates.\n\nIn this course created by former associate professor at the Søren Kierkegaard Research Centre, Jon Stewart, we will explore how Kierkegaard deals with the problems associated with relativism, the lack of meaning and the undermining of religious faith that are typical of modern life. His penetrating analyses are still highly relevant today and have been seen as insightful for the leading figures of Existentialism, Post-Structuralism and Post-Modernism.","tutor":"Jon Stewart","provider":"Coursera","language":"English","skills":["denmark","north america"],"subject":"Philosophy","studentsInterested":"1.9k","courseLink":"https://www.coursera.org/learn/kierkegaard","classCentralLink":"https://www.class-central.com/course/coursera-soren-kierkegaard-subjectivity-irony-and-the-crisis-of-modernity-667"},{"title":"Plagues, Witches, and War: The Worlds of Historical Fiction","about":"A unique and exciting introduction to the genre and craft of historical fiction, for curious students, aspiring authors--anyone with a passion for the past. Read classics of the genre, encounter bestselling writers of historical fiction, and discover your own historical archive while interacting with a global community of interested readers.","tutor":"Bruce Holsinger","provider":"Coursera","language":"English","skills":["usa","north america"],"subject":"Literature","studentsInterested":"3.7k","courseLink":"https://www.coursera.org/learn/historical-fiction","classCentralLink":"https://www.class-central.com/course/coursera-plagues-witches-and-war-the-worlds-of-historical-fiction-1173"},{"title":"Creative Writing: The Craft of Plot","about":"In this course aspiring writers will be introduced to perhaps the most elemental and often the most challenging element of story: plot. We will learn what keeps it moving, how it manipulates our feelings, expectations, and desires. We will examine the choices storytellers make to snag our imaginations, drag them into a fictional world, and keep them there. We will learn how to outline and structure a plot, discuss narrative arc, pacing and reversals and reveal the inevitable surprise: connecting the beginning, middle and end.","tutor":"Brando Skyhorse","provider":"Coursera","language":"English","skills":["creative writing","plot development","usa","north america"],"subject":"Grammar \u0026 Writing","studentsInterested":"4.7k","courseLink":"https://www.coursera.org/learn/craft-of-plot","classCentralLink":"https://www.class-central.com/course/coursera-creative-writing-the-craft-of-plot-5625"},{"title":"Constitutional Struggles in the Muslim World","about":"Learn what motivates the restive Muslim youth from Tunis to Tehran, what political positions Islamists from Mali to Chechnya are fighting for, where the seeming obsession with Islamic law comes from, where the secularists have vanished to, and whether it makes sense to speak of an Islamic state.\n\nSince 2009 there has been a renewed wave of popular unrest sweeping throughout much of the Muslim world. Secular, but generally repressive and inefficient autocracies have come under pressure or been swept aside entirely. At the same, the various Islamic Republics have not fared much better, but been convulsed by internal unrest, economic and social decline. Throughout the Muslim lands, existing constitutional arrangements are being challenged, often very violently.\nThis course is a survey of the constitutional ideas and institutions that have developed since the mid 19th century throughout predominantly Muslim countries, but its focus will lie on the actors that have dominated this discourse and shaped its outcomes. We will look at the large body of classical writings on the Islamic state only in so far as it is necessary to understand the contemporary debate, but concentrate on the legal and political developments of the 20th and 21st centuries.\n\nThree common themes will characterise the course: \n\nWe privilege the study of the legal and social reality and seek to highlight where it is at odds with dogmatic stipulations, be they religious or constitutional. \n\nWe seek to illustrate the practical tensions posed by limited administrative capabilities and political legitimacy that resulted from the incomplete reception of modern bureaucratic statehood. \n\nWe seek to examine how popular dissatisfaction with the practical performance of Muslim governments has fuelled demands for greater accountability under the guise of cultural authenticity. \n\nUltimately, the course aims to equip participants to better understand Muslim contemporary discourse about the res publica, better contextualise the demands for religious law in public life, and to better ascertain the theoretical and practical feasibility of postulated religious alternatives to the still-dominant secular model of governance.","tutor":"Ebrahim Afsah","provider":"Coursera","language":"English","skills":["denmark","north america"],"subject":"History","studentsInterested":"3.2k","courseLink":"https://www.coursera.org/learn/muslim-world","classCentralLink":"https://www.class-central.com/course/coursera-constitutional-struggles-in-the-muslim-world-663"},{"title":"Creative Writing: The Craft of Setting and Description","about":"In this course aspiring writers will be introduced to the techniques that masters of fiction use to ground a story in a concrete world. From the most realist settings to the most fantastical, writers will learn how to describe the physical world in sharp, sensory detail. We will also learn how to build credibility through research, and to use creative meditation exercises to deepen our own understanding of our story worlds, so that our readers can see all that we imagine.","tutor":"Amity Gaige","provider":"Coursera","language":"English","skills":["creative writing","fiction","usa","north america"],"subject":"Grammar \u0026 Writing","studentsInterested":"1.0k","courseLink":"https://www.coursera.org/learn/craft-of-setting-and-description","classCentralLink":"https://www.class-central.com/course/coursera-creative-writing-the-craft-of-setting-and-description-5623"},{"title":"The Kennedy Half Century","about":"When John F. Kennedy entered the presidential limousine at Love Field in Dallas, Texas on November 22, 1963, he began his ride into history. That journey continues even today and we call it the Kennedy legacy.\n\nThis course will explore the Presidency, assassination, and lasting legacy of President John F. Kennedy. Students will learn how JFK’s life, administration, and tragic death have influenced the general public, the media, and each of the nine U.S. presidents who followed.\n\nUnderstanding the Kennedy legacy and being able to identify elements of his legacy within the context of modern politics helps understand many of the vexing problems that developed over the last half century as well as many of the challenges that confront us today.\n\nNovember 22, 1963 was so powerful a moment that in the fifty years since the assassination, every U.S. President that followed JFK has used Kennedy’s words and actions in an effort to craft their own political image. Why does Kennedy’s influence persist, and will it continue? What are the effects?\n\nWe’ll address these questions and more as we explore The Kennedy Half Century.\n\nFollow on Twitter: @JFKclass.","tutor":"Larry Sabato","provider":"Coursera","language":"English","skills":["usa","north america"],"subject":"History","studentsInterested":"909","courseLink":"https://www.coursera.org/learn/kennedy","classCentralLink":"https://www.class-central.com/course/coursera-the-kennedy-half-century-1172"},{"title":"Ancient Philosophy: Plato \u0026 His Predecessors","about":"What is philosophy? How does it differ from science, religion, and other modes of human discourse? This course traces the origins of philosophy in the Western tradition in the thinkers of Ancient Greece. We begin with the Presocratic natural philosophers who were active in Ionia in the 6th century BCE and are also credited with being the first scientists. Thales, Anaximander, and Anaximines made bold proposals about the ultimate constituents of reality, while Heraclitus insisted that there is an underlying order to the changing world. Parmenides of Elea formulated a powerful objection to all these proposals, while later Greek theorists (such as Anaxagoras and the atomist Democritus) attempted to answer that objection. In fifth-century Athens, Socrates insisted on the importance of the fundamental ethical question—“How shall I live?”—and his pupil, Plato, and Plato’s pupil, Aristotle, developed elaborate philosophical systems to explain the nature of reality, knowledge, and human happiness. After the death of Aristotle, in the Hellenistic period, Epicureans and Stoics developed and transformed that earlier tradition. We will study the major doctrines of all these thinkers. Part I will cover Plato and his predecessors. Part II will cover Aristotle and his successors.","tutor":"Susan Sauvé Meyer","provider":"Coursera","language":"English","skills":["greek philosophy","plato","socrates","usa","north america"],"subject":"Philosophy","studentsInterested":"5.7k","courseLink":"https://www.coursera.org/learn/plato","classCentralLink":"https://www.class-central.com/course/coursera-ancient-philosophy-plato-his-predecessors-5237"},{"title":"Age of Jefferson","about":"This course provides an overview of Thomas Jefferson\u0027s work and perspectives presented by the University of Virginia in partnership with Thomas Jefferson’s Monticello. Together, UVA and Monticello are recognized internationally as a UNESCO World Heritage Site.","tutor":"Peter Onuf","provider":"Coursera","language":"English","skills":["usa","north america"],"subject":"History","studentsInterested":"1.6k","courseLink":"https://www.coursera.org/learn/ageofjefferson","classCentralLink":"https://www.class-central.com/course/coursera-age-of-jefferson-1343"},{"title":"Ancient Philosophy: Aristotle and His Successors","about":"What is philosophy? How does it differ from science, religion, and other modes of human discourse? This course traces the origins of philosophy in the Western tradition in the thinkers of Ancient Greece. We begin with the Presocratic natural philosophers who were active in Ionia in the 6th century BCE and are also credited with being the first scientists. Thales, Anaximander, and Anaximines made bold proposals about the ultimate constituents of reality, while Heraclitus insisted that there is an underlying order to the changing world. Parmenides of Elea formulated a powerful objection to all these proposals, while later Greek theorists (such as Anaxagoras and the atomist Democritus) attempted to answer that objection. In fifth-century Athens, Socrates insisted on the importance of the fundamental ethical question—“How shall I live?”—and his pupil, Plato, and Plato’s pupil, Aristotle, developed elaborate philosophical systems to explain the nature of reality, knowledge, and human happiness. After the death of Aristotle, in the Hellenistic period, Epicureans and Stoics developed and transformed that earlier tradition. We will study the major doctrines of all these thinkers. Part I will cover Plato and his predecessors. Part II will cover Aristotle and his successors.","tutor":"Susan Sauvé Meyer","provider":"Coursera","language":"English","skills":["greek philosophy","aristotle","usa","north america"],"subject":"Philosophy","studentsInterested":"1.1k","courseLink":"https://www.coursera.org/learn/aristotle","classCentralLink":"https://www.class-central.com/course/coursera-ancient-philosophy-aristotle-and-his-successors-5238"},{"title":"Sharpened Visions: A Poetry Workshop","about":"Why just write poems when you can write better ones? This course is built on the notion that the most exciting writing begins after the first draft. It is specifically for folks who believe that writing poems just to express oneself is like using the Internet just for email. After all, poetry can change the way you and your readers think of the world and its inhabitants; it can break new ground for language; turn a blank sheet of paper into a teeming concert of voices and music.\n\nThough any of us may have the potential to make that happen, having an understanding of how several tools of poetic composition can be used (and audaciously “mis-used”) gives you more ways to try (and if we do this right, we might surprise ourselves most of all).\n\nWe\u0027ll cover key poetic terms and devices by studying poems by a handful of modern and contemporary poets and then get a chance to try our own hand at writing new poem drafts from a select number of prompts. Throughout the course you will have the opportunity to workshop your poem drafts and get feedback on your work, working towards a more polished poem.","tutor":"Douglas Kearney","provider":"Coursera","language":"English","skills":["poetry","usa","north america"],"subject":"Literature","studentsInterested":"799","courseLink":"https://www.coursera.org/learn/poetry-workshop","classCentralLink":"https://www.class-central.com/course/coursera-sharpened-visions-a-poetry-workshop-4185"},{"title":"Creative Writing: The Craft of Style","about":"Your style is as unique and distinctive as your face, your voice, except that you can choose it, you can can work on it, enhance it. In this course we will introduce aspiring writers to the art of putting pressure on written language. We will study the use of metaphor and imagery, and demonstrate how clarity, grace, and inventiveness in word choice are imperative to a story’s success. Writers will emerge with the revision skills essential to all writers of good stories and good prose.","tutor":"Salvatore Scibona","provider":"Coursera","language":"English","skills":["storytelling","creative writing","usa","north america"],"subject":"Grammar \u0026 Writing","studentsInterested":"1.9k","courseLink":"https://www.coursera.org/learn/craft-of-style","classCentralLink":"https://www.class-central.com/course/coursera-creative-writing-the-craft-of-style-5621"},{"title":"Calvin - Histoire et réception d\u0027une Réforme","about":"Course in French with English subtitles --\n\nCe cours introduit à la vie et à la pensée du réformateur Jean Calvin (1509-1564) ainsi qu’à son influence sur le monde moderne et contemporain. La démarche proposée se veut critique, il ne s’agit ni de canoniser ni de condamner Calvin, mais de comprendre sa pensée avec toute la distance requise et d’en analyser les enjeux.\n\nAu cours de la première semaine, nous explorerons les principales étapes de la vie de Calvin. Les semaines 2 et 3 seront consacrées à l’étude de sa pensée théologique et de son éthique. Enfin, lors des semaines 4 et 5, nous nous interrogerons sur la diffusion du calvinisme dans le monde et la pertinence actuelle de la pensée de Calvin.\n\n--\nThis course is an introduction to the life and thought of the reformer John Calvin (1509-1564) and to his influence on the modern and contemporary world. The approach we develop is critical: we intend neither to canonize nor to condemn Calvin or his thought. Our goal, rather, is to avoid any rash evaluation in order to understand his thought and analyze the issues at stake in it.\n\nDuring five weeks, we will explore together the life and work of the Reformer. During the first week, we will study the main aspects of Calvin’s life. Weeks 2 and 3 will focus on his theology and his ethics. During the last two weeks (weeks 4 and 5), we will ponder how Calvinism became a worldwide phenomenon and ask ourselves what kind of relevance Calvin’s thought may still have today.","tutor":"Christophe Chalamet, Michel Grandjean, François Dermange and Sarah Nicolet","provider":"Coursera","language":"French","skills":["europe","switzerland"],"subject":"Philosophy","studentsInterested":"49","courseLink":"https://www.coursera.org/learn/calvin","classCentralLink":"https://www.class-central.com/course/coursera-calvin-histoire-et-reception-d-une-reforme-659"},{"title":"The Fall and Rise of Jerusalem","about":"The destruction of the First Temple in Jerusalem and the Babylonian Exile were a great catastrophe in the history of the Jewish Nation.\nWhat really happened during that dark, fateful age, and how did new opportunities arise from the ashes?","tutor":"Oded Lipschits and Ido Koch","provider":"Coursera","language":"English","skills":["asia","israel"],"subject":"History","studentsInterested":"308","courseLink":"https://www.coursera.org/learn/jerusalem","classCentralLink":"https://www.class-central.com/course/coursera-the-fall-and-rise-of-jerusalem-974"},{"title":"Writing in the Sciences","about":"This course teaches scientists to become more effective writers, using practical examples and exercises. Topics include: principles of good writing, tricks for writing faster and with less anxiety, the format of a scientific manuscript, peer review, grant writing, ethical issues in scientific publication, and writing for general audiences.","tutor":"Kristin Sainani","provider":"Coursera","language":"English","skills":["usa","north america"],"subject":"Grammar \u0026 Writing","studentsInterested":"2.7k","courseLink":"https://www.coursera.org/learn/sciwrite","classCentralLink":"https://www.class-central.com/course/coursera-writing-in-the-sciences-464"},{"title":"Intellectual Humility: Practice","about":"We live in a polarised world where all too often people talk past each other. But do you know when to believe what others say? For example, how quick should we be to accept something that someone else tells us is true, and what should we be looking out for when assessing a person\u0027s trustworthiness? Meanwhile, what should we do when we encounter disagreements with people who seem to be our equals? How and when should we adjust our beliefs, and how does the appropriate response vary depending on the evidence? These challenges may be especially important in the arena of religious disagreements. How should we weigh the evidence for and against various theistic and atheistic stances?\n\nExperts in psychology, philosophy, theology and education are conducting exciting new research on these questions, and the results have important, real-world applications. Faced with difficult questions people often tend to dismiss and marginalize dissent. Political and moral disagreements can be incredibly polarizing, and sometimes even dangerous. And whether it’s Christian fundamentalism, Islamic extremism, or militant atheism, religious dialogue remains tinted by arrogance, dogma, and ignorance. The world needs more people who are sensitive to reasons both for and against their beliefs, and are willing to consider the possibility that their political, religious and moral beliefs might be mistaken. The world needs more intellectual humility.\n\nIn this course. we will examine the following major questions about applied issues surrounding intellectual humility:\n\n• Should you believe what people say?\n• How should we handle disagreement?\n• What is the role of evidence in resolving religious disagreements?\n\nAll lectures are delivered by leading specialists, and the course is organised around a number of interesting readings and practical assignments which will help you address issues related to humility in your daily life.\n\nThis course can be taken as a part of a series which explores the theory, the science and the applied issues surrounding intellectual humility. Before, we considered how to define and measure intellectual humility, what intellectual virtue is, whether we are born or can become humble, and what cognition and emotions can tell us about intellectual humility. If you are interested, complete all three courses to gain a broader understanding of this fascinating topic. Look for:\n\n• Intellectual Humility: Theory - https://www.coursera.org/learn/intellectual-humility-theory\n• Intellectual Humility: Science - https://www.coursera.org/learn/intellectual-humility-science\n\nCheck out our trailer to hear more - https://youtu.be/x_CWjrYxKZU.","tutor":"Dr Ian Church, Professor Duncan Pritchard and Dr. Emma Gordon","provider":"Coursera","language":"English","skills":["europe","scotland","new-moocs-2017"],"subject":"Philosophy","studentsInterested":"884","courseLink":"https://www.coursera.org/learn/intellectual-humility-practice","classCentralLink":"https://www.class-central.com/course/coursera-intellectual-humility-practice-7656"},{"title":"Smarter Eating For Better Performance","about":"This course explores the fundamentals of nutrition for athletes, and examines the impact diet has on training and competition.\nWhat foods should we eat before, during and after training?\nWhy are protein and carbohydrate essential after exercise?\nWhat is the most effective way to keep hydrated?\nThe course is led by Prof. Ron Maughan.\nProfessor Ron Maughan is Programme Director at sportsoracle and Chair of the Nutrition Working Group established by the IOC Medical Commission in 2002. He has published numerous books and articles on sports nutrition and exercise biochemistry, and is an editorial board member for several journals including the International Journal of Sports Medicine and Nutrition and the Journal of Sports Sciences.\nThe course will take around 1 hour 30 minutes to complete.","tutor":"Ron Maughan","provider":"Independent","language":"English","skills":["ioc","athletic performance","diet \u0026 exercise"],"subject":"Sports","studentsInterested":"2.9k","courseLink":"https://www.http://onlinecourse.olympic.org/course/view.php?id\u003d5","classCentralLink":"https://www.class-central.com/course/smarter-eating-for-better-performance-2202"},{"title":"The Rise of Superheroes and Their Impact On Pop Culture","about":"Join the Smithsonian, and comic book industry legend Stan Lee, in this self-paced course to explore the history of the comic book and the rise of superheroes.\nThe ancient gods of Egyptian, Greek and Roman myths still exist, but today, they have superpowers, human foibles and secret identities. They come from comic books and graphic novels, and have taken over pop culture on the stage, screen, video games, and animation.\nFrom Superman® and Spider-Man®, to The Avengers® and The Hulk® and beyond, who are these heroes? And, how have they evolved from folklore and myth, across all cultures and religions?\nLearn from Smithsonian and industry experts including:\nStan Lee, who was one of the creators of the modern superhero template. His early comics featuring Spider-Man, Iron Man®, The Hulk, Thor®, and The Avengers led Marvel to success. He continues to reinvent himself to create modern global superheroes and appear in cameos in superhero films and TV, such as Avengers: Age of Ultron.\nMichael Uslan, executive producer of top grossing, award winning movies, including The Dark Knight series, Lego® Movie, the animated Batman films and Batman® VS Superman.\nIn this self-paced course, we explore the following questions:\nWhy did superheroes first arise in 1938 and experience what we refer to as their “Golden Age” during World War II?","tutor":"David Uslan, Michael Uslan and Stan Lee","provider":"edX","language":"English","skills":["smithsonianx"],"subject":"Culture","studentsInterested":"1.6k","courseLink":"https://www.edx.org/course/rise-superheroes-impact-pop-culture-smithsonianx-popx1-5x","classCentralLink":"https://www.class-central.com/course/edx-the-rise-of-superheroes-and-their-impact-on-pop-culture-3322"},{"title":"Big History: Connecting Knowledge","about":"We currently face unprecedented challenges on a global scale. These problems do not neatly fall into disciplines. They are complicated, complex, and connected. Join us on this epic journey of 13.8 billion years starting at the Big Bang and travelling through time all the way to the future. Discover the connections in our world, the power of collective learning, how our universe and our world has evolved from incredible simplicity to ever-increasing complexity. Experience our modern scientific origin story through Big History and discover the important links between past, current, and future events. You will find two different types of lectures. ‘Zooming In’ lectures from multiple specialists enable you to understand key concepts through the lens of different disciplines, whilst David Christian\u0027s ‘Big History Framework’ lectures provide the connective overview for a journey through eight thresholds of Big History.","tutor":"David Baker","provider":"Coursera","language":"English","skills":["big history","australia"],"subject":"History","studentsInterested":"3.6k","courseLink":"https://www.coursera.org/learn/big-history","classCentralLink":"https://www.class-central.com/course/coursera-big-history-connecting-knowledge-4485"},{"title":"生活英语听说 | Conversational English Skills","about":"Are you finding it difficult to start the conversation, or find the right words when communicating in English? Do you know how to start and end conversations in a polite way? Do you want to learn more about American, British, Canadian, Australian, South Korean, Colombian, and Chinese cultures? If so, you’ve come to the right course!\n语言最重要的功能就是交流。在交流中我们要知道如何开始一个对方感兴趣的话题，回答别人的提问，自然、流畅地完成一个对话。本课程选取了8个主题，由50多位来自美国、英国、加拿大、澳大利亚、哥伦比亚、中国的老师及各个年龄段的学生，在真实的场景中，用最地道的表达和最纯正的英语，带你谈论日常生活、学习的方方面面。\n\n本课程分为八个单元，每个单元有一个主题，分别是：\n\n1、个人信息的介绍与交换\n2、我们的家人和朋友\n3、饮食与用餐\n4、英语学习的目的和方法\n5、假日活动和难忘的经历\n6、兴趣爱好\n7、情感表达\n8、保持健康\n\n每个主题由十余组对话和小组讨论，外籍老师的中西方文化差异介绍，中国老师的重点词汇、句型讲解，听力理解练习和口语测试构成。通过学习和练习，你将可以和讲英语的朋友们自如地交谈、讨论与主题相关的任何问题。本课程的学习方法有很多。英语学习者可以在反复地听和跟读对话的过程中，不断积累语言素材，和你身边的朋友或同课程的学习者进行对话练习；英语教师可以选用本课程中适合的主题，组织学生进行听说训练，组织高效课堂。也许你不能理解每段对话的全部内容，只需听懂大意，随着课程的进展，你听懂的内容会越来越多。让我们一起实现一次英语听说的飞跃吧。\n本门课程在制作过程中得到了香港伟新教育基金和Google公司的资助，特此鸣谢。    ","tutor":"Thomas H. Piachaud, Glenn M. Davis, Fang Yang and Wenxia Zhang","provider":"edX","language":"English","skills":["tsinghuax"],"subject":"Foreign Language","studentsInterested":"2.1k","courseLink":"https://www.edx.org/course/sheng-huo-ying-yu-ting-shuo-tsinghuax-30640014x","classCentralLink":"https://www.class-central.com/course/edx--conversational-english-skills-3337"},{"title":"Chinese Language and Culture","about":"This course provides you with insights into the rich fabric of the cultures of China. You will develop a basic understanding of written Chinese, its history and expression in calligraphy. We will also explore the origins and variety of Chinese cuisine, the role of food in festivals and the etiquette of Chinese dining and tea drinking. You will also look at the origins of some of the values that underpin Chinese society and how these are being affected by economic development and urbanisation. You will uncover some of the symbolism of numbers and colours and the Chinese Zodiac and get a feel for how traditional values and beliefs are expressed in Chinese opera and architecture.\nAfter completing this course you will have a greater understanding of Chinese language and culture how contemporary China has been framed by both tradition and its place in our increasingly globalised world. You will have a menu from which to choose topics that you may wish to pursue through further studies.\nWhat will I learn?\nYou will understand the long heritage of Chinese society and the diversity of the Chinese landscape, its cultures and nationalities.\nYou will acquire a broad appreciation of, philosophies and social values that underpin contemporary Chinese society, and how these are evolving in modern China.\nYou will understand the origins of and the high value placed on education and writing, including Chinese calligraphy.","tutor":"Professor Liu Cheng (Brady)","provider":"Open2Study","language":"English","skills":[],"subject":"Foreign Language","studentsInterested":"489","courseLink":"https://www.open2study.com/courses/chinese-language-culture","classCentralLink":"https://www.class-central.com/course/open2study-chinese-language-and-culture-1818"},{"title":"Writing for the Web","about":"Understanding the difference between writing for print versus writing for the web starts with learning about how readers behave differently online. This course brings to light how to accommodate the needs of online readers through web design, writing style, structure and search engine optimisation.\nFind out how content can impact the reader\u0027s experience, as well as how the reader\u0027s experience can impact the way they interpret online content.\nWhat will I learn?\nTechniques for writing for your online readers, such as:\nwhat to consider before you start writing\ncharacteristics of good online content\nhow to write for your audience\nhow to maintain your content\nMore specifically you will learn:\nhow to structure a web page\nconsiderations for search engines and accessibility requirements\nmaking your content scannable\nusing keywords, headings, lists and links","tutor":"Frankie Madden","provider":"Open2Study","language":"English","skills":[],"subject":"Grammar \u0026 Writing","studentsInterested":"4.4k","courseLink":"https://www.open2study.com/courses/writing-for-the-web","classCentralLink":"https://www.class-central.com/course/open2study-writing-for-the-web-905"},{"title":"How to Succeed at: Writing Applications","about":"##\nExperts from The Careers Service here at The University of Sheffield share their top tips to help you write exceptional applications, CVs (or résumés), covering letters and personal statements.\nYou’ll also hear from employers and admissions tutors to find out what they really look for in a candidate. And once you’ve written that perfect application, prepare for the next stage with our course: How to Succeed at: Interviews.\nThis course is designed for anyone applying for jobs or courses. It will be of particular interest to those in the early stages of their career, or those who are out of practice and need to update their skills. No prior knowledge or expertise are needed.","tutor":"Hilary Jones and Pamela Hafekost","provider":"FutureLearn","language":"English","skills":["europe","uk"],"subject":"Grammar \u0026 Writing","studentsInterested":"445","courseLink":"https://www.futurelearn.com/courses/writing-applications","classCentralLink":"https://www.class-central.com/course/futurelearn-how-to-succeed-at-writing-applications-2248"},{"title":"Scribble: Writing for New Writers","about":"This course will take students through the process of writing from simple paragraphs to more complex writing structures and eventually research writing. Writing is often seen as something we do in order to remember grammatical forms and words to learn. However, I\u0027d argue that we need grammar and words in order to write. Writing is becoming increasingly important as we communicate even more online. And increasingly we have to communicate with people from other countries. This means that we have to be able to express our ideas clearly and in a way that people can understand. If you want to get more information on writing, this is the course for you.\n\nWriting is a process and simply taking this course will NOT make you a great writer over night. It\u0027s hard work and takes practice. What I hope for this course is that it will give you some easy tips to help move your writing in a positive direction. That said, you will still need help with your writing, so where possible, ask someone to help check and proof read your work.","tutor":"Simon Williams","provider":"OpenLearning","language":"English","skills":["writing"],"subject":"Grammar \u0026 Writing","studentsInterested":"1.7k","courseLink":"https://www.openlearning.com/courses/scribere","classCentralLink":"https://www.class-central.com/course/openlearning-scribble-writing-for-new-writers-3755"},{"title":"Basic Mandarin Chinese – Level 1","about":"Introductory Mandarin is the first in a series of six courses designed to teach you how to speak Mandarin Chinese. This course will introduce you to the basic language you will need to eat, live, and get around in Mandarin speaking countries.\nSince this is a language course, we recommend taking this course with a friend or group of friends. Practicing with others by speaking the language will help you learn it more effectively. Additionally, Mandarin is a tonal language, which means that in order to truly master it, you will need to say the words out loud! Join the community of over 900 million native Mandarin speakers and start learning today! ","tutor":"Estella Y. M. Chen","provider":"edX","language":"English","skills":["mandarinx"],"subject":"Foreign Language","studentsInterested":"365","courseLink":"https://www.edx.org/course/basic-mandarin-chinese-level-1-mandarinx-mx101x-0","classCentralLink":"https://www.class-central.com/course/edx-basic-mandarin-chinese-level-1-3534"},{"title":"China (Part 1): Political and Intellectual Foundations: From the Sage Kings to Confucius and the Legalists","about":"China (Part 1): Political and Intellectual Foundations: From the Sage Kings to Confucius and the Legalists is the first of ten parts of ChinaX, that collectively span over 6,000 years of history. Each part consists of 4 to 8 weekly \"modules,\" each with videos, readings, interactive engagements, assessments, and discussion forums. There are a total of 52 modules in ChinaX.\nParts 1-5 make up China: Civilization and Empire, taught by Professor Peter K. Bol. Parts 6-10 make up China and the Modern World, taught by Professor William C. Kirby. \nFor more information about ChinaX, please visit the ChinaX page.\nHarvardX requires individuals who enroll in its courses on edX to abide by the terms of the edX honor code. HarvardX will take appropriate corrective action in response to violations of the edX honor code, which may include dismissal from the HarvardX course; revocation of any certificates received for the HarvardX course; or other remedies as circumstances warrant. No refunds will be issued in the case of corrective action for such violations. Enrollees who are taking HarvardX courses as part of another program will also be governed by the academic policies of those programs.\nHarvardX pursues the science of learning. By registering as an online learner in an HX course, you will also participate in research about learning. Read our research statement to learn more.\nHarvard University and HarvardX are committed to maintaining a safe and healthy educational and work environment in which no member of the community is excluded from participation in, denied the benefits of, or subjected to discrimination or harassment in our program. All members of the HarvardX community are expected to abide by Harvard policies on nondiscrimination, including sexual harassment, and the edX Terms of Service. If you have any questions or concerns, please contact and/or .","tutor":"Peter K. Bol and William C. Kirby","provider":"edX","language":"English","skills":["harvardx"],"subject":"Culture","studentsInterested":"3.0k","courseLink":"https://www.edx.org/course/china-part-1-political-intellectual-harvardx-sw12-1-0","classCentralLink":"https://www.class-central.com/course/edx-china-part-1-political-and-intellectual-foundations-from-the-sage-kings-to-confucius-and-the-legalists-941"},{"title":"Introduction to Philosophy: God, Knowledge and Consciousness","about":"This philosophy course has two goals. The first goal is to introduce you to the things that philosophers think about. We will look at some perennial philosophical problems:\nIs there a God?\nWhat is knowledge, and how do we get it?\nWhat is the place of our consciousness in the physical world?\nDo we have free will?\nHow do we persist over time, as our bodily and psychological traits change?\nThe second goal is to get you thinking philosophically yourself. This will help you develop your critical reasoning and argumentative skills more generally. Along the way we will draw from late, great classical authors and influential contemporary figures.\nTo help enhance your learning experience, this course offers instructor grading. If you choose to pursue a verified certificate, a professional philosopher will carefully read, grade and comment upon your work. Though all residential philosophy courses at MIT, and other major universities, offer instructor grading, this is an innovation in the world of MOOCs. Students will test their ideas against, and receive individual advice from, professional philosophers. We believe that this is the best way to learn philosophy.\nVerified learners will be eligible for the MITx Philosophy Award and (for students presently in high school) the MITx High School Philosophy Award. The awards will be given for outstanding written work by the MIT Philosophy Department. In addition, award winners will be profiled on the MIT Philosophy website.","tutor":"Caspar Hare","provider":"edX","language":"English","skills":["mitx"],"subject":"Philosophy","studentsInterested":"10.0k","courseLink":"https://www.edx.org/course/introduction-philosophy-god-knowledge-mitx-24-00x-2","classCentralLink":"https://www.class-central.com/course/edx-introduction-to-philosophy-god-knowledge-and-consciousness-926"},{"title":"紅樓夢：母神崇拜(The Red Chamber Dream 2)","about":"《紅樓夢》不只是一部青春紀事，更是一闋母神的頌歌；它既熱烈地宣揚了少女之美，卻也莊嚴地禮讚著母性力量。本次課程將聚焦在女媧─警幻─賈母─元妃─王夫人─劉姥姥六位成熟女性，針對其在書中扮演角色的功能與位置，進行深入的剖析，重新辨明這些「母神」具備的崇高形象。","tutor":"歐麗娟 Li-chuan Ou","provider":"Coursera","language":"Chinese","skills":["asia","taiwan"],"subject":"Literature","studentsInterested":"16","courseLink":"https://www.coursera.org/learn/rcd2","classCentralLink":"https://www.class-central.com/course/coursera---the-red-chamber-dream-2-2359"},{"title":"English for Business and Entrepreneurship","about":"Welcome to English for Business and Entrepreneurship, a course created by the University of Pennsylvania, and funded by the U.S. Department of State Bureau of Educational and Cultural Affairs, Office of English Language Programs.\n\nTo enroll in this course for free, click on “Enroll now” and then select \"Full Course. No certificate.\"\n\nThis course is designed for non-native English speakers who are interested in learning more about the global business economy. In this course, you will learn about topics and language necessary to succeed in the international workplace. You will explore business English through authentic readings and video lectures, while learning about business vocabulary, concepts, and issues. Unit 1 will provide an introduction to entrepreneurship by examining ideas, products, and opportunities. In unit 2, you will learn about the basics of market research, including how to identify an opportunity. The next unit in the course will focus on business plans, why these plans are important, and will give you a chance to practice composing a business plan. In the final unit of the course, we will present basics for funding a business and will help you create a persuasive presentation, or pitch, based on a business plan.\n\nUnless otherwise noted, all course materials are available for re-use, repurposing and free distribution under a Creative Commons 4.0 Attribution license.\n\nSupplemental reading materials were provided by Newsela, which publishes daily news articles at a level that\u0027s just right for each English language learner.","tutor":"Amy Nichols and James Riedel","provider":"Coursera","language":"English","skills":["esl","business english","usa","north america"],"subject":"ESL","studentsInterested":"2.9k","courseLink":"https://www.coursera.org/learn/business","classCentralLink":"https://www.class-central.com/course/coursera-english-for-business-and-entrepreneurship-6010"},{"title":"Adjectives and Adjective Clauses","about":"Being able to adeptly use adjective clauses in speaking and writing is useful for upper level English learners. Adjectives and adjective clauses are very common in English, so students need to be able to understand them when they see them or hear them. Students often struggle to bring complexity to their speaking and writing and adjective clauses can be a great way to do this.\n\nPlease note that all of the lectures and practice activities are available for free, but taking the quizzes and getting feedback on assignments are only available in the paid version","tutor":"Tamy Chapman","provider":"Coursera","language":"English","skills":["english language","grammar","usa","north america"],"subject":"Grammar \u0026 Writing","studentsInterested":"356","courseLink":"https://www.coursera.org/learn/adjective-clauses","classCentralLink":"https://www.class-central.com/course/coursera-adjectives-and-adjective-clauses-6293"},{"title":"Научные тексты — учимся писать на русском и английском","about":"В современном научном мире письменная коммуникация является одним из мощнейших инструментов выстраивания успешной академической и исследовательской карьеры ученого.\nКурс «Научные тексты — учимся писать на русском и английском» поможет магистрам, аспирантам и молодым начинающим ученым\n• сформировать навык правильного и уместного использования грамматических конструкций научного стиля речи на русском и английском языках;\n• овладеть методикой написания аннотации, тезисов, научной статьи на русском и английском языках;\n• развить индивидуальные письменные коммуникативные способности.","tutor":"Голубева Ольга Владимировна, Яремчук Ольга Васильевна, Макарова Анна Анатольевна, Маркевич Елена Владиславовна, Строилова Алевтина Георгиевна, Комочкина Елена Анатольевна, Курнаев Александр Алексеевич, Сицына-Кудрявцева Алевтина Николаевна, Алешинская Евгения Владимировна, Мустафина Анна Александровна, Барминова Светлана Викторовна and Бакланова Ирина Ивановна","provider":"Coursera","language":"Russian","skills":["russia"],"subject":"Grammar \u0026 Writing","studentsInterested":"18","courseLink":"https://www.coursera.org/learn/naychnie-teksti","classCentralLink":"https://www.class-central.com/course/coursera---------7746"},{"title":"Intellectual Change in Early China: Warring States and Han","about":"This sequence of four courses will propose a multi-disciplinary approach to the study of Chinese cultural history conceived of as a succession of modes of rationality (philosophical, bureaucratic, and economic). The focus will be on the moments of paradigm shift from one mode of rationality to another. For each of these moments, cultural facts and artifacts—thought, literature, ritual—will be examined in relationship to changing social, political, and economic systems.\n\nThe first two courses will cover the periods of the Warring States (481-256 BCE) and the Period of Division (220-589 CE), with a brief excursion into the Han (206 BCE-220 CE). The Warring States laid the social and cultural foundations for the emergence of the imperial mode of rationality; the Period of Division saw the Buddhist “conquest” of China and the emergence of a rationality defined by the opposition of the Three Teachings to shamanism, that is, of a clear contrast between elite and popular culture.\n\nThe third and fourth courses will focus on the emergence of modern China in the Song-Yuan (960-1368) and of today’s China 1850 to the present. We will see how the modern attack on religion, redefined as \"superstition\", led not only to religious reform movements but also to a society in which science and the nation became the primary value systems promoted by the state.\n\nThe courses are listed below:\n\nA Critical Cultural History of China - Early China I: Intellectual Change in the Warring States and Han (481 BCE-220 CE)\nA Critical Cultural History of China - Early China II: Religious Transformation in the Period of Division (220-589 CE) (To be launched in late 2018)\nA Critical Cultural History of China - Modern China I: Religion and Thought in the Song, Jin, and Yuan (960-1368) (To be launched in late 2018)\nA Critical Cultural History of China - Modern China II: Structuring Values (1850-2015) (To be launched in late 2018)","tutor":"Prof. John Lagerwey","provider":"Coursera","language":"English","skills":["culture","philosophy","china","history"],"subject":"History","studentsInterested":"31","courseLink":"https://www.coursera.org/learn/intellectual-change-early-china-the-warring-states-han","classCentralLink":"https://www.class-central.com/course/coursera-intellectual-change-in-early-china-warring-states-and-han-10759"},{"title":"What is news?","about":"This course will guide you through the basic elements of professional journalism and the news values and ethics of covering real-world issues and events. The overview and examples of the types of news coverage helps introduce the different types of journalism, such as social media, multimedia, print, visual and broadcast, and how professional journalists effectively use each format.","tutor":"Eric Freedman, Jeremy Steele, Joe Grimm, Joanne Gerstner, Lucinda D. Davenport and David Poulson","provider":"Coursera","language":"English","skills":["journalism","ethics","usa","north america"],"subject":"Humanities","studentsInterested":"975","courseLink":"https://www.coursera.org/learn/what-is-news","classCentralLink":"https://www.class-central.com/course/coursera-what-is-news-5520"},{"title":"品读道家的智慧","about":"儒家和道家，都是中国文化的主流。儒家塑造着国人的社会人格，道家则成就着国人的自然人格。道家的智慧，博大精深，学理深奥，以“道”为核心，以“自然”与“无为”为基本范畴，对为人处事与政治哲学有着深远的影响，具有重要的现代价值。\n本课程主要分三大部分：道家的渊源和宗旨；老子其人其书其道；庄子其人其书其道。着重阐述了道家的渊源和宗旨，老子和庄子的智慧精要及其现代价值。","tutor":"张 莹莎 and 鹏杰","provider":"Coursera","language":"Chinese","skills":["philosophy","china","asia","taoism"],"subject":"Philosophy","studentsInterested":"2","courseLink":"https://www.coursera.org/learn/daojiao","classCentralLink":"https://www.class-central.com/course/coursera--6220"},{"title":"Chinese for HSK 1","about":"Nǐ hǎo! 你好！Welcome to Chinese for HSK Level 1 - a Chinese course for beginners. My name is YU Bin. I am very happy to meet you here!\n\nHSK stands for Hànyǔ (Chinese) Shuǐpíng (level) Kǎoshì (test), which is the most important Chinese proficiency test in use today. It assesses non-native Chinese speakers’ abilities in using Chinese in their daily, academic and professional lives.\n\nChinese for HSK Level 1 is the first part of the 6 levels and assesses test takers’ abilities in the application of everyday Chinese. It is the counterpart of Level 1 of the Chinese Language Proficiency Scales for Speakers of Other Languages and the A1 Level of the Common European Framework of Reference for Languages. You will learn:\n\n 30 video lectures with dialogue role plays by PKU students;\n More than 150 commonly used words;\n Around 50 key grammar points;\n New words and texts via audio;\n Quizzes for each lesson and HSK test papers;\n Videos for 70 basic Chinese characters (optional);\n Supplementary materials about China (optional).\n\nIn short, the course covers the four skills although only listening and reading are tested in HSK. At the end of the course, you will be able to understand and use simple Chinese phrases, meet basic needs for communication and possess the ability to further your Chinese language studies.\n\nHave a fantastic journey of Chinese learning.\n\nFor more information about HSK please visit: http://english.hanban.org/node_7581.htm.","tutor":"YU Bin","provider":"Coursera","language":"English","skills":["china","asia"],"subject":"Foreign Language","studentsInterested":"172","courseLink":"https://www.coursera.org/learn/hsk-1","classCentralLink":"https://www.class-central.com/course/coursera-chinese-for-hsk-1-7141"},{"title":"Writing in English at University","about":"Acquiring good academic research and writing skills early on is essential for your success both at university and in your professional life.\n\nThis course aims:\n- to give you an understanding of the conventions of academic writing in English and to teach you the components and benefits of what is called process writing.\n- to help you to put together your own “toolbox” of academic writing skills, as well as to give you a chance to test out these tools and to reflect on your own development as a writer.\n- to encourage reflection on discipline specific conventions; although the course deals with generic skills, you will be able to apply these generic skills to meet the particular needs of your own discipline.\n\nThe course consists of four modules:\n1. Writing in English at university: An introduction\n2. Structuring your text and conveying your argument\n3. Using sources in academic writing\n4. The writer’s toolbox: Editing and proofreading\n\nIn each module you will find video lectures and reading assignments and assignments, such as quizzes, reflective self-assessment questions, as well as some peer review exercises in which you will have an opportunity to interact with other students taking the course.","tutor":"Satu Manninen, Ellen Turner and Cecilia Wadsö Lecaros","provider":"Coursera","language":"English","skills":["europe","sweden"],"subject":"Grammar \u0026 Writing","studentsInterested":"200","courseLink":"https://www.coursera.org/learn/writing-english-university","classCentralLink":"https://www.class-central.com/course/coursera-writing-in-english-at-university-7189"},{"title":"A Journey through Western Christianity: from Persecuted Faith to Global Religion (200 - 1650)","about":"This course follows the extraordinary development of Western Christianity from its early persecution under the Roman Empire in the third century to its global expansion with the Jesuits of the early modern world. We explore the dynamic and diverse character of a religion with an enormous cast characters. We will meet men and women who tell stories of faith as well as of violence, suppression, and division. Along the way, we encounter Perpetua and her martyrdom in Carthage; the struggles of Augustine the bishop in North Africa; the zeal of Celtic monks and missionaries; the viciousness of the Crusades; the visions of Brigit of Sweden; and the fracturing of Christianity by Martin Luther’s protest. We hear the voices of great theologians as well as of those branded heretics by the Church, a powerful reminder that the growth of Christianity is a story with many narratives of competing visions of reform and ideals, powerful critiques of corruption and venality, and exclusion of the vanquished. The troubled history of Christian engagement with Jews and Muslims is found in pogroms and expulsions, but also in the astonishing ways in which the culture of the West was transformed by Jewish and Islamic learning.\n\nWe shall explore the stunning beauty of the Book of Kells, exquisitely prepared by monks as the Vikings terrorized the coast of England. We will experience the blue light of the windows of Chartres, and ponder the opening questions of Thomas Aquinas’ great Summa. We will read from the Gutenberg Bible of the fifteenth century, which heralded the revolution brought by the printing press. We will travel from Calvin’s Geneva to Elizabeth’s England to Trent, where a Catholic Council met to inaugurate a modern, missionary Catholic church. We will walk through the great Escorial of Philip II of Spain, hear the poetry of John of the Cross, and follow the Jesuits to Brazil and China.\n\nChristianity in the West was forged in the fires of conflict and tumult, and it brought forth both creativity and violence. It echoed with calls for God’s world to be transformed, it inspired the most sublime art and architecture, yet it also revealed the power of the union of cross and sword to destroy. The course is a journey through the formation of the West as one strand of Christianity, as one chapter in a global story. It is a journey that has shaped our world.","tutor":"Bruce Gordon","provider":"Coursera","language":"English","skills":["usa","north america","new-moocs-2017"],"subject":"Religion","studentsInterested":"734","courseLink":"https://www.coursera.org/learn/western-christianity-200-1650","classCentralLink":"https://www.class-central.com/course/coursera-a-journey-through-western-christianity-from-persecuted-faith-to-global-religion-200-1650-8106"},{"title":"發展心理學：哲學觀與方法論 (Developmental Psychology: Philosophical Bases and Methodology)","about":"人性本質的開端是善或惡？成長與改變的原因是源自遺傳或環境？人類發展的過程是如小樹苗漸成大樹般的量變、還是如毛毛蟲變成蝴蝶般的質變？這些哲學爭辯顯示了同一個發展現象背後可能有不同的立場，因而需以縱貫追蹤或橫跨不同世代的跨齡研究設計探討人類發展的本質。此外，發展心理學欲瞭解的對象往往包括無法聽從研究者指示、或無法以語言、文字充分表達自己的嬰幼兒與兒童，因此需以特殊的研究派典才能回答發展趨勢、發展歷程是否為連續、以及個別差異是否隨發展保持穩定等議題。因此，本課程的主旨有二，一為說明各種看待發展的哲學觀、另一則為介紹發展心理學的研究設計與方法。","tutor":"雷庚玲 (Keng-Ling Lay)","provider":"Coursera","language":"Chinese","skills":["new-moocs-2017"],"subject":"Philosophy","studentsInterested":"8","courseLink":"https://www.coursera.org/learn/developmental-psychology","classCentralLink":"https://www.class-central.com/course/coursera---developmental-psychology-philosophical-bases-and-methodology-8391"},{"title":"Better Business Writing in English","about":"Do you need to write more easily and effectively in English? This course will provide the tools to help you do just that. You will develop your personal voice in your writing. You will develop strategies to plan and produce clear, understandable text. You will learn and practice specific writing skills to use in different types of business communications including cover letters, mission and vision statements, proposals , instructions and reports. You will organize, design and write clear text for Power Point Productions. Writing skills include how to choose correct noun and noun modifiers; how to choose correct verb forms and tenses; how to write a variety of clauses and sentences.\n\nAs you work through the course, you will complete self- and peer-evaluations. Many of the peer assignments will have 2 or more options so that you can choose the best path depending on your current situation. Through a combination of lectures, quizzes, supplementary resources, practice and performance, you’ll gain the skills and confidence to write well in English for your business and professional purposes.","tutor":"Amalia B. Stephens","provider":"Coursera","language":"English","skills":["new-moocs-2017"],"subject":"Grammar \u0026 Writing","studentsInterested":"138","courseLink":"https://www.coursera.org/learn/business-writing-english","classCentralLink":"https://www.class-central.com/course/coursera-better-business-writing-in-english-8485"},{"title":"German at Work Intermediate 1: Deutsch am Arbeitsplatz","about":"##\nGerman is the most widely spoken native language in Europe, and German-speaking countries benefit from strong economics and low unemployment.\nThis course will help you consolidate your German communication skills for the workplace. It follows German at Work Post-Beginners 2: Deutsch am Arbeitsplatz.\nYou’ll learn to talk about your career and write a CV, discuss employment and the right job for you, as well as find out more about education in Germany.\nYou’ll develop your linguistic competence (at level B1) and deepen your cultural understanding.\nThis course is for learners who already have an intermediate level of German.\nThis course follows German at Work Post-Beginners 2: Deutsch am Arbeitsplatz.","tutor":"Christine Pleines","provider":"FutureLearn","language":"English","skills":["communication","german language","language learning","workplace"],"subject":"Foreign Language","studentsInterested":"71","courseLink":"https://www.futurelearn.com/courses/german-intermediate-1","classCentralLink":"https://www.class-central.com/course/futurelearn-german-at-work-intermediate-1-deutsch-am-arbeitsplatz-10781"},{"title":"Sports and Society","about":"Sports play a giant role in contemporary society worldwide. But few of us pause to think about the larger questions of money, politics, race, sex, culture, and commercialization that surround sports everywhere. This course draws on the tools of anthropology, sociology, history, and other disciplines to give you new perspectives on the games we watch and play. It\u0027s the new and improved version of Professor Orin Starn\u0027s original \"Sports and Society\" for Coursera, which drew more than 40,000 students. We will focus on both popular sports like soccer (or “football,” as anyone outside America calls it), basketball, and baseball, and also lesser-known ones like mountain-climbing and fishing. You will never watch or think about sports in the same way again.","tutor":"Orin Starn","provider":"Coursera","language":"English","skills":["soccer","olympics","usa","north america"],"subject":"Sports","studentsInterested":"1.7k","courseLink":"https://www.coursera.org/learn/sports-society","classCentralLink":"https://www.class-central.com/course/coursera-sports-and-society-518"},{"title":"Unethical Decision Making in Organizations","about":"This course \u0027Unethical decision making in organizations : A seminar on the dark side of the force\u0027 will teach you how strong organizational contexts push good people towards unethical decisions. You will also learn how to protect yourself and your organization against such forces lurking in the dark.\n\nAbout the Course\n\nThis course teaches how narrow frames and strong contexts can push good people towards unethical decisions and how they can protect themselves and their organization against ethical blindness.\n\nThe goal of this course is to empower the participants to analyze the risks of unethical or illegal behavior that might be triggered by powerful contexts. It draws from various disciplines such as management, psychology, sociology, philosophy, and literature, in order to learn what these disciplines contribute to a better understanding of unethical behavior. The course also analyzes some of the most prominent organizational scandals of the recent decades through the lenses of these disciplines.\n\nWhenever we hear about ethical scandals, we tend to believe that unethical or illegal behaviour in organizations is driven by character deficiencies of individual actors. Put differently, we simply assume that bad things are done by bad people. However, numerous corporate scandals have demonstrated that even people with a high level of integrity can break the rules if they are put into a strong context.\n\nA better understanding of why and under what conditions good people make bad ethical decisions will enable us to better protect individuals as well as their respective organizations against the potentially overwhelming power of the context. It will also enable us to cure societies from problems like corruption.\n\nAt the end of the course, you are able to:\n\n1. Explain the impact of social context on individual decision making using various theories (from Management, Sociology, Psychology, and Philosophy)\n2. Apply these theories to the analysis of some of the most eminent organizational scandals of the recent decades\n3. Assess risks of ethical blindness in your own organizational context\n4. Design interventions to reduce such risks for yourself and your organization\n\n\nRecommended Background\n\nNo background expertise is required. The course is open for interested layperson as well as experts who work on related topics, be it as researchers or practitioners (e.g., compliance managers in corporations).\n\nWhy is this course important for me?\n\nCurrently, the understanding of why good people make unethical decisions is rather limited, related research is rather fragmented, and the management of such problems in organizations is overly simplistic, legalistic, and inadequate. Understanding contexts, including the dangers of routines, the mindlessness of our daily decisions, and the healing power of mindful decision-making routines is of increasing importance. In this course, you will learn the latest knowledge and the appropriate tool box for dealing with ethical challenges that you will face throughout your life!\n\nWhat do I need to follow this course?\n\nWe build bridges between various scientific disciplines and will familiarize you with those disciplines smoothly. You need no expertise, just come and share your own real-world experiences about unethical decisions. After all, we are all experts in making decisions—some more ethically, some less ethically—aren’t we?","tutor":"Guido Palazzo and Ulrich Hoffrage","provider":"Coursera","language":"English","skills":["europe","switzerland"],"subject":"Philosophy","studentsInterested":"881","courseLink":"https://www.coursera.org/learn/unethical-decision-making","classCentralLink":"https://www.class-central.com/course/coursera-unethical-decision-making-in-organizations-1389"},{"title":"Write Professional Emails in English","about":"This is a course to help you write effective business emails in English. This course is unique because each module will provide tips on writing more professional emails as well as lessons to improve your overall English writing skills. Therefore, you will improve your grammar and vocabulary skills for email writing and also improve your cross cultural knowledge to make you more powerful and successful in your business communication. You will look at different email formats to analyze tone, formality levels, and various organizational styles. You will be able to improve your emails of introduction, announcements, requests and emails that apologize or revise a request. In this course you will write and revise 4–5 emails, complete several comprehension quizzes and review the emails of other participants.\n\nBy the end of this course, you will be able to\n• Improve your overall written English skills\n• See differences and similarities among the different email formats\n• Write more effective subject lines and email text\n• Apply various key language to different types of emails\n• Correct common errors such as punctuation and capitalization\n• Study tone and level of formality in emails\n• Understand how culture affects what is appropriate in a business emails\n• Write powerful business emails for professional needs","tutor":"Gerry Landers","provider":"Coursera","language":"English","skills":["business english","business emails","english writing skills","usa","north america"],"subject":"ESL","studentsInterested":"317","courseLink":"https://www.coursera.org/learn/professional-emails-english","classCentralLink":"https://www.class-central.com/course/coursera-write-professional-emails-in-english-5449"},{"title":"Introduction to Research for Essay Writing","about":"Course 4: Introduction to Research for Essay Writing\n\nThis is the last course in the Academic Writing specialization before the capstone project. By the end of this course, you will be able to complete all the steps in planning a research paper.\n\nAfter completing this course, you will be able to:\n- choose appropriate research topics for college classes\n- write detailed outlines for research papers\n- find source material for research papers\n- take and organize good notes for research\n- use appropriate academic tone and language\n- document sources by creating a Works Cited list in MLA format\n- avoid plagiarizing your sources","tutor":"Tamy Chapman","provider":"Coursera","language":"English","skills":["academic research","essay writing","usa","north america"],"subject":"Grammar \u0026 Writing","studentsInterested":"1.6k","courseLink":"https://www.coursera.org/learn/introduction-to-research-for-essay-writing","classCentralLink":"https://www.class-central.com/course/coursera-introduction-to-research-for-essay-writing-4201"},{"title":"Engaging ELLs and Their Families in the School and Community","about":"In this course, you will learn how to better and more successfully engage your ELL(s) and their families in the school and community. You will learn how to engage your ELL student in the classroom setting as well as in various aspects of the school including extracurricular activities and the inner workings of the school and education system. You will also be introduced to strategies for engaging the families of your ELL students in the school community and the wider community of your city and state. You will interact with a variety of case studies that highlight teachers, schools, and communities in different cities throughout the United States and the ways in which they successfully engage ELLs and their families. From sharing their experience, you will have the tools necessary to implement strategies and procedures for engaging your ELLs and their families.\n\nUpon completing this course, you will be able to:\n* Define the culture of ELLs in K-12 classrooms across the U.S.\n* Recognize cultural impact on learning and formal education\n* Assess your school’s engagement of ELLs and their families\n* Incorporate culturally sensitive techniques to engage ELLs in the classroom and school\n* Implement strategies for engaging ELLs’ families in the school and larger community\n* Design a plan for engagement of ELLs and their families in your school\n* Create a checklist for school and community resources for engaging ELLs and\ntheir families","tutor":"Ellen Manos and Claire McLaughlin","provider":"Coursera","language":"English","skills":["english language","esl","ell","usa","north america"],"subject":"ESL","studentsInterested":"39","courseLink":"https://www.coursera.org/learn/ell-families","classCentralLink":"https://www.class-central.com/course/coursera-engaging-ells-and-their-families-in-the-school-and-community-4636"},{"title":"Japanese Culture Through Rare Books","about":"##\nA book is a tool for preserving words and images. Through books, an abundance of information, including the knowledge and experiences of the people of the past, has been handed down to the present. But books are more than records of words and images. Their form, appearance, and even the scripts and styles used tell us about the fashions and technologies of the times that produced them. By studying old books, we can learn a great deal about the geographical areas in which they were made, the historical background, and the individuals and groups involved in their making.\nWhile displaying remarkable similarities with books produced in other areas of the Sinitic cultural sphere, Japanese books also possess some unique features, starting with their sheer diversity of form and appearance. Using a wealth of multimedia content, we will take a journey through the wonderful world of traditional Japanese books.\nKeio University’s Book Collection\nKeio University’s Institute of Oriental Classics is a unique institution specialized in rare East Asian books. The Institute’s extensive collection comprises 163,000 items, and is open to the public as a specialized library. In this course we will make use of this rich collection and rely on the expertise of specialists and researchers who have been working for the preservation and study of these resources. Using state of the art media resources, you will familiarize yourself with not only the content of traditional East Asian books, but also with their physical appearance, format, binding method, script, and cover style.","tutor":"Takahiro Sasaki","provider":"FutureLearn","language":"English","skills":["japanese culture","manuscripts","japan","asia","books"],"subject":"Literature","studentsInterested":"1.3k","courseLink":"https://www.futurelearn.com/courses/japanese-rare-books-culture","classCentralLink":"https://www.class-central.com/course/futurelearn-japanese-culture-through-rare-books-6264"},{"title":"Akademiskt skrivande","about":"Hur lär jag mig skriva fungerande texter? Det är en fråga som många studenter söker svar på. I denna kurs tar vi upp vad som är viktigt i det akademiska skrivandet. Du får konkreta tips på vad du kan tänka på för att utveckla både dina texter och ditt skrivande. Du får också träning genom olika övningar och kortare skrivuppgifter.\n\nMålet med kursen är att du ska kunna skriva akademiska texter i ditt ämne och också förstå hur du kan utvecklas som skribent.\n\nDet här är de mer specifika målen för varje kursmodul.\n\nEfter modul ett ska du steg för steg kunna planera ditt skrivande och kunna använda respons som ett medel för att göra texterna bättre och utvecklas som skribent.\n\nEfter modul två ska du kunna anpassa en akademisk text till genre och ämnessammanhang samt utifrån genre och ämnessammanhang kunna välja innehåll, struktur och språkstil i din text.\n\nEfter modul tre ska du kunna framställa dig själv som skribent och dina argument på ett trovärdigt sätt samt kunna skriva en text med flyt och korrekt språk.\n\nEfter modul fyra ska du kunna referera och citera litteratur på ett akademiskt hederligt och korrekt sätt.\n\nI den femte modulen, som mer specifikt riktar sig till lärare, får du tips om hur du kan integrera och formulera mål för skrivande i din egen ämnesundervisning, hur du kan motivera studenter samt hur du kan effektivisera skrivträning och textrespons.\n\nObservera att alla uppgifter på den här kursen är frivilliga och du får inget intyg för att du har gjort dem. Men vi tror att de kommer att hjälpa dig att bli en bättre skribent så vi rekommenderar starkt att du gör så många uppgifter som möjligt. I så kallade “assignments” får du tillfälle att skriva en egen text utifrån instruktioner och kan därefter få den granskad av en annan kursdeltagare och du får också öva på att själv ge respons. Detta är nyttiga erfarenheter som kommer att hjälpa dig i ditt skrivande.","tutor":"Susanne Pelger and Sara Santesson","provider":"Coursera","language":"English","skills":["europe","sweden"],"subject":"Grammar \u0026 Writing","studentsInterested":"5","courseLink":"https://www.coursera.org/learn/akademiskt-skrivande","classCentralLink":"https://www.class-central.com/course/coursera-akademiskt-skrivande-7192"},{"title":"Spanish Vocabulary Project","about":"In this course, we\u0027ll imagine that you are applying for an all-expenses paid, educational trip to a Spanish-speaking nation of your choice. You\u0027ll introduce yourself to a host family that you\u0027ll be staying with, research the rich culture and history of the place you intend to visit and compare it with your own country, and plan out an itinerary of places you plan to see, and things you plan to do and experience while visiting. In addition, you\u0027ll summarize the key points of your written report in an oral presentation. This course is challenging and is meant to test everything you\u0027ve learned in the Spanish Vocabulary specialization. It will provide you an excellent way in which to test what you know and what you still need to work on in your Spanish learning journey.","tutor":"Dr. Robert Blake","provider":"Coursera","language":"English","skills":["usa","north america","new-moocs-2017"],"subject":"Foreign Language","studentsInterested":"157","courseLink":"https://www.coursera.org/learn/spanish-vocabulary-project","classCentralLink":"https://www.class-central.com/course/coursera-spanish-vocabulary-project-8049"},{"title":"中日文化交流史","about":"追溯日本文明发展的历史，阐明日本人独特的思考模式，解析日本独特的审美意识。本课程讲授公元前3世纪至清末的中日文化交流的历史。以文化艺术的交流为主线，以实地考察为背景展示了中日两国丰富灿烂的交流史实。通过中日双方在吸收对方文化过程中所表现出来的不同的受容方式剖析了中日文化之不同特性，可以帮助受课者准确地把握日本文化的内质，并启发其对自我民族历史文化之思考。生动的图片，倾心的讲授，可以让学习者在轻松愉快的氛围中完成六章的学习和有趣的试题，以期丰富学习者的人文积淀。","tutor":"滕军","provider":"Coursera","language":"Chinese","skills":["new-moocs-2017"],"subject":"History","studentsInterested":"6","courseLink":"https://www.coursera.org/learn/zhongri-jiaoliushi","classCentralLink":"https://www.class-central.com/course/coursera--8563"},{"title":"现代汉语核心语法","about":"本课程根据外国学生学习汉语的特点，比较系统地介绍了汉语的主要语法，像词类、句子成分、单句、复句、篇章、表达方法，等等；着重指出了外国学习者学习汉语语法的难点和重点，并通过大量有针对性的练习，帮助学习者去掌握、运用，从而提高学习者的汉语水平。\nAccording to the characteristics of the foreign student learning Chinese, this course systematically introduces the main grammar of Chinese, such as part of speech, sentence constituent, single sentence, complex sentence, discourse, expression method. This course emphatically points out the important and difficult points in the foreign student’s Chinese grammar learning, and through a large number of targeted trainings, the course helps learners to master and use, thus to improve Chinese level of the learner.","tutor":"Defeng Yang","provider":"Coursera","language":"Chinese","skills":["new-moocs-2017"],"subject":"Foreign Language","studentsInterested":"10","courseLink":"https://www.coursera.org/learn/hanyu-yufa","classCentralLink":"https://www.class-central.com/course/coursera--8551"},{"title":"Китайский для начинающих (Chinese for beginners)","about":"Курс рассчитан  на лиц, изучающих китайский язык с \"нуля\".  За 10 занятий, основанных на методике преподавания китайского языка СПбГУ, слушатели  смогут  освоить базовую лексику и грамматику китайского языка на уровне А1 по международной классификации владения иностранным языком.\n\nЦели курса: дать возможность учащимся, не имеющих доступа к «очным» образовательным ресурсам пройти базовую лексику и грамматику китайского языка на уровне А1 по международной классификации владения иностранным языком\nпривить интерес к китайскому языку и уважение к китайской культуре.\n\nКурс частично основан на материале, который первокурсники СПбГУ, изучающие китайский как основной язык, проходят в конце первого- начале второго семестров в рамках курса «Фонетика и разговорный язык».\n\nВ вводной лекции будет рассказываться о правильном произнесении звуков и общей методике постановки тонов, чтобы облегчить работу учащихся при самостоятельной работе над фонетической частью, так как по интернету, к сожалению, невозможно поставить фонетику и руку, поскольку каждый учащийся (будь то студент или слушатель онлайн-курса) — это фактически тонко настраиваемый инструмент, и «настройка» требуется индивидуальная.\n\nТакже слушателям онлайн-курса будут предложены разные блоки обучения:\n- Лексика и иероглифика, включая порядок черт в написании иероглифов\n- Грамматика с подробными пояснениями и примерами\n- Примеры разговорных фраз для заучивания\n- Анимированные ситуативные мини-диалоги, цель которых продемонстрировать, как можно применять изученный материал в - речи\n- Упражнения разных типов, которые слушатели должны выполнить самостоятельно с целью закрепления пройденного материала.\n\nКроме того в виде текстовых файлов входят различные материалы для прочтения из рубрики «Это интересно», рассказывающие об истории языка, о культуре Китая и привычках китайцев и т.д. В данной рубрике будет помимо прочего представлен большой перечень дополнительной литературы для тех, кто интересуется Китаем.","tutor":"Цяо Пэн, Власова Наталья Николаевна, Лю Лимэй and Колпакова Елена Николаевна","provider":"Coursera","language":"Russian","skills":["chinese language","language learning","new-moocs-2017"],"subject":"Foreign Language","studentsInterested":"35","courseLink":"https://www.coursera.org/learn/kitayskiy-dlya-nachinayushchikh","classCentralLink":"https://www.class-central.com/course/coursera----chinese-for-beginners-9237"},{"title":"Russian History: from Lenin to Putin","about":"In this course, Peter Kenez, Professor Emeritus at UC Santa Cruz, explains the events of modern Russian history and introduces its most significant actors—from Vladimir Lenin to Vladimir Putin.","tutor":"Peter Kenez","provider":"Coursera","language":"English","skills":["politics","russia","history","new-moocs-2017"],"subject":"History","studentsInterested":"535","courseLink":"https://www.coursera.org/learn/russian-history-lenin-putin","classCentralLink":"https://www.class-central.com/course/coursera-russian-history-from-lenin-to-putin-9573"},{"title":"How To Make A Poem","about":"Discover the power of poetry, and learn to write your own\nThis course explores what inspires poetry, how we write poems and how to tell when your poem is finished.\nWhether you’ve never written a poem before, or you‘ve been secretly writing away for some years, this course provides a positive environment in which to begin writing and to share your work with others.\nThe course follows the story of a poem from start to end, guiding you through the process of writing your own work step by step.\nTo help us, we will be hearing from poets across world and throughout history, learning from the advice they have given others.\nThis course is for anyone who wants to write poetry, you don’t need any past experience.","tutor":"Michael Symmons Roberts","provider":"FutureLearn","language":"English","skills":["poetry","writing skills"],"subject":"Grammar \u0026 Writing","studentsInterested":"89","courseLink":"https://www.futurelearn.com/courses/how-to-make-a-poem","classCentralLink":"https://www.class-central.com/course/futurelearn-how-to-make-a-poem-10516"},{"title":"Asian Environmental Humanities: Landscapes in Transition","about":"In this course, featuring many researchers from the University of Zurich and international institutions, we will introduce you to some of the most vibrant cultural trends addressing landscape appreciation, degradation, protection, and rehabilitation that currently circulate in the Asian hemisphere. You will learn how they are critically reflected upon in the context of the environmental humanities, and observe how an interdisciplinary approach towards regional ecosystems past and present reaches out beyond pragmatic technological solutions to mitigate environmental damage. Environmental humanities strive to change people’s prevalent attitudes, values and behavioural patterns in order to redeem the rapidly globalizing crisis.\n\nHaving acquainted yourself with the stories Asia’s landscapes – and landscape representations – tell about actual and possible human-nature relationships, you can compare and evaluate their potential to bring about the desired change and define your own range of actions as an informed stakeholder for creating a sustainable future. What is arguably no less intriguing: you will learn how to appreciate a broad range of eco-aesthetic forms that re-enchant our lives by creatively interacting with the more-than-human world.\n\nYou can follow the five modules of the course consecutively or just study the modules that interest you the most. If you want to earn a certificate, you need to complete all of the modules including the quizzes at the end of each module.\n\nTHESE ARE THE TOPICS OF THE 5 MODULES OF THIS COURSE:\n\nModule 1: Concepts of landscape past and present and their cosmological underpinnings.\n\nModule 2: Entangled landscapes comprising cultural flows of concepts and forms, contemporary gardens on the move, nostalgic elegies of demolished sites and rural reconstruction projects.\n\nModule 3: Discussion of two religious communities in India (the Parsi-Zoroastrians and the Auroville community) and their relationship with the environment.\n\nModule 4: Environmental debates tackling religious concepts and social practices and the problem of waste disposal in India.\n\nModule 5: Environmental movements and the impact of Fukushima on attitudes towards nuclear energy in Japan, creative activism including arts projects and documentaries to protest against pollution and landscape degradation and raise environmental awareness in the Sinosphere, and emergent concepts for sustainable community life on the planet.","tutor":"Andrea Riemenschnitter","provider":"Coursera","language":"English","skills":["culture","asian culture","humanties"],"subject":"Culture","studentsInterested":"12","courseLink":"https://www.coursera.org/learn/asian-environmental-humanities","classCentralLink":"https://www.class-central.com/course/coursera-asian-environmental-humanities-landscapes-in-transition-11209"},{"title":"English for Academic Study","about":"Increase your knowledge of English for academic study\nIf you are preparing to study at a university where the first language is English, either on campus or online, this course aims to help you understand what is expected, and develop skills to help you learn independently and build your confidence.\nYou will have the opportunity to review the key vocabulary and concepts used in a university setting, and a chance to discover what tutors expect from students in a UK university context. Most importantly, you will practise skills to help you expand your vocabulary for an academic setting, including tools to help you pronounce new words.\nThis course is for any student who is planning to study at a university where English is the main language. It’s primarily for students whose first language is not English but will also be useful for students who are coming into higher education after a long period away from studying, or who are mature students looking for an opportunity to refresh their study skills. It will help to prepare students for both study on an online degree and at a university campus.\nEnglish for Academic Study is the first course on the Pre-sessional English Online Award delivered by Coventry University, which helps students improve their English language and academic skills for university study. The Award is aimed at students who are 0.5 IELTS below university entry requirements.","tutor":"Gareth Jones","provider":"FutureLearn","language":"English","skills":["esl","english","university studies"],"subject":"ESL","studentsInterested":"156","courseLink":"https://www.futurelearn.com/courses/english-academic-study","classCentralLink":"https://www.class-central.com/course/futurelearn-english-for-academic-study-11172"},{"title":"Essentials for English Speeches and Presentations 英语演讲与演示","about":"Students must learn essential knowledge and skills to deliver an impressive English speech or presentation for academic purposes, job hunting, and business occasions. Global perspectives and inter-cultural communication skills are taught here to facilitate most Chinese English learners.\n学习在学术交流、求职、海外留学与商务场景下进行英文演讲与演示所必备的知识与技能，强化中国学生的全球化视角与跨文化沟通技巧。","tutor":"Hongyan Zhang","provider":"Coursera","language":"English","skills":["china","asia"],"subject":"Foreign Language","studentsInterested":"99","courseLink":"https://www.coursera.org/learn/yingyuyanjiang","classCentralLink":"https://www.class-central.com/course/coursera-essentials-for-english-speeches-and-presentations--3228"},{"title":"Modern Hebrew Poetry שירה עברית מודרנית","about":"הקורס מציע מיפוי של השירה העברית החדשה למן תנועת ההשכלה דרך תקופת \"התחייה\" והמודרניזם שבא בעקבותיה, ועד לימינו. הקורס מציג באופן חי ונושם את המפנים הפואטיים ואת ההתפתחויות הסגנוניות והתמטיות בתחום השירה העברית, מראשיתה, באמצעות קריאות קרובות של טקסטים מן התקופות השונות, ומעמיד מאגר גדול ושופע של ידע תיאורטי, ספרותי והיסטורי, לצד פרשנויות עמוקות, מאתגרות ומפתיעות.","tutor":"Ariel Hirschfeld","provider":"Coursera","language":"Hebrew","skills":["asia","israel"],"subject":"Literature","studentsInterested":"46","courseLink":"https://www.coursera.org/learn/hebrew-poetry","classCentralLink":"https://www.class-central.com/course/coursera-modern-hebrew-poetry----3235"},{"title":"Advanced Writing","about":"Course 3: Advanced Writing\n\nThis is the third course in the Academic English: Writing specialization. By raising your level of academic writing, this course helps prepare you for college-level work.\n\nAfter completing this course, you will be able to:\n- plan and write a more sophisticated argument essay\n- identify plagiarism and explain how to prevent it\n- read and analyze several articles to form your own opinion on a topic\n- make connections between several articles\n- form thesis statements from your readings\n- use sources effectively when writing an essay\n\nPlease note that the free version of this class gives you access to all of the instructional videos and handouts. The peer feedback and quizzes are only available in the paid version.","tutor":"Tamy Chapman","provider":"Coursera","language":"English","skills":["academic writing","college writing","usa","north america"],"subject":"Grammar \u0026 Writing","studentsInterested":"1.9k","courseLink":"https://www.coursera.org/learn/advanced-writing","classCentralLink":"https://www.class-central.com/course/coursera-advanced-writing-4233"},{"title":"The Modern and the Postmodern (Part 2)","about":"This course examines how the idea of \"the modern\" develops at the end of the 18th century in European philosophy and literature, and how being modern (or progressive, or hip) became one of the crucial criteria for understanding and evaluating cultural change. Are we still in modernity, or have we moved beyond the modern to the postmodern?","tutor":"Michael Roth","provider":"Coursera","language":"English","skills":["philosophy","art","post-modern","modern","usa","north america"],"subject":"History","studentsInterested":"1.1k","courseLink":"https://www.coursera.org/learn/modern-postmodern-2","classCentralLink":"https://www.class-central.com/course/coursera-the-modern-and-the-postmodern-part-2-4339"},{"title":"ELL Success in the Content Classroom: Capstone Project","about":"As teachers, it is so important to have a plethora of resources to draw upon for modification for specific students and classroom contexts. In this capstone project, you are tasked with applying the concepts learned throughout the specialization, to create your own toolbox designed with the ELL in Mind.\n\nIn this two-part capstone, you will first create an annotated lesson plan comprising both formative and summative assessments. The lesson plan will include any modified materials for ELLs such as graphic organizers or writing frames pertinent to the lesson\u0027s activities. The annotation will include a rationale for lesson elements based on information presented in Lesson Planning with the ELL in Mind and Assessing Achievement with the ELL in Mind.\n\nSecond, you will use your checklist of resources, personalized to your school and community, to create an engagement plan of action. This should include specific milestones for creating a more engaging environment for your students and their families. You will also include a rationale for elements of engagement based on information presented in Engaging the ELL and Their Families in the School and Community.\n\nIn this capstone, you will create a personalized toolbox for ELL success in the content classroom.\n\nThis toolbox will include:\n* Annotated Lesson Plan\n- Modified Materials\n- Formative and Summative Assessment\n- Lesson Plan and Materials Rationale\n* Engagement Action Plan and Rationale\n\nThe materials created in this project should be immediately useful in your classroom. Your capstone project should be tailored to your teaching context, content area, and students.\n\nBy the end of this course, you will be able to:\n* Design a lesson plan with attention to the needs of your ELLs\n* Create appropriate modified materials to support your ELLs\n* Create formative and summative assessments to measure both content mastery and language development as specified by\nyour lesson plan\u0027s learning and language objectives\n* Rationalize your application of selected methodologies\n* Create and implement an engagement action plan specified for your teaching context","tutor":"Ellen Manos and Claire McLaughlin","provider":"Coursera","language":"English","skills":["teaching","esl","ell","capstone","usa","north america"],"subject":"ESL","studentsInterested":"18","courseLink":"https://www.coursera.org/learn/ell-project","classCentralLink":"https://www.class-central.com/course/coursera-ell-success-in-the-content-classroom-capstone-project-5111"},{"title":"The Holocaust - An Introduction (II): The Final Solution","about":"The Holocaust was an inconceivable historical event, which forever robbed Western culture of its innocence. As civilized human beings, we fail to understand how events of such horror could have taken place, and how an idea so inhumanly warped could have spread like wildfire through an entire continent, instigating the systematic annihilation of millions of Jews.\n\nThis free online course was produced jointly by Tel Aviv University and Yad Vashem – the World Holocaust Remembrance Center. This course is the second of the two courses and covers three themes in its three weeks:\n\nWeek 1: The Final Solution\nWe’ll look at the cultural and mental processes that paved the way to the comprehensive and systematic mass murder of Jews in Europe – that is, the Final Solution. As part of this hard lesson we will discuss the various characteristics of the murder sites and death camps, and reveal selected aspects of the horror that occurred in them.\n\nWeek 2: Jewish and Non-Jewish Responses to the Holocaust\nWe will try to explore questions regarding knowledge about the application of the Final Solution, as well as a variety of responses and annihilation of victims, local populations and perpetrators.\n\nWeek 3: The End of the War\nWe will dedicate this lesson to the events that occurred in the last years of the Holocaust, as well as questions of memory, commemoration and future research.\n\nWe strongly recommend that you register for \"The Holocaust - An Introduction (I): Nazi Germany: Ideology, The Jews and the World\" as well. Taking both parts of the course would enable you to obtain a fuller and more comprehensive knowledge about The Holocaust.\n\nThis online course is offered in an innovative, multi-level format, comprising:\n\nComprehensive lectures by leading researchers from Tel Aviv University and Yad Vashem.\nA wealth of voices and viewpoints presented by guest lecturers\nNumerous documents, photos, testimonies and works of art from the time of the Holocaust.\nNovel learning experience: Crowdsourcing – involving the learners themselves in the act of collecting and shaping information, via unique, exciting online assignments.","tutor":"Professor Havi Dreifuss, PhD","provider":"Coursera","language":"English","skills":["asia","israel"],"subject":"History","studentsInterested":"192","courseLink":"https://www.coursera.org/learn/holocaust-introduction-2","classCentralLink":"https://www.class-central.com/course/coursera-the-holocaust-an-introduction-ii-the-final-solution-5368"},{"title":"Speak English Professionally: In Person, Online \u0026 On the Phone","about":"Do you want to speak better English? This course will help you reach that goal. Speak English Professionally: In person, Online and On the Phone will boost your English speaking skills. In this 5 week course, you will learn how to identify and make a strong personal introduction. You will develop and demonstrate the speaking skills for group discussions: how to agree or disagree, how to clarify, restate and summarize. You will review and practice how to give information and respond to requests on the phone. You will study and role play effective interviewing. You will prepare and give a sales “pitch”, introducing a product or service. Throughout the course, you will change how you speak English and you will become more fluent and accurate when you speak. You will demonstrate culturally appropriate body language and tone. As you work through the course, you will complete self- and peer-evaluations. Through a combination of lectures, comprehension and vocabulary quizzes, practice and performance, you’ll gain the skills and confidence to communicate well in English, anywhere in the world.\n\nBy the end of this course you will:\n• Change how you speak English\n• Improve your pronunciation and fluency\n• Increase your English vocabulary\n• Identify how culture influences your speech\n• Use culture to help you speak correctly\n• Demonstrate the best body language for different cultural settings\n• Know statements, questions and responses for different settings and situations","tutor":"Amalia B. Stephens","provider":"Coursera","language":"English","skills":["conversational english","english speaking skills","usa","north america"],"subject":"ESL","studentsInterested":"3.1k","courseLink":"https://www.coursera.org/learn/speak-english-professionally","classCentralLink":"https://www.class-central.com/course/coursera-speak-english-professionally-in-person-online-on-the-phone-5440"},{"title":"Be Persuasive: Write a Convincing Position Paper or Policy Advice (Project-Centered Course)","about":"In this project-centered course, you will learn everything you need to research and present an effective and persuasive position paper or policy advice. We recommend you sign up for a certificate as this course is on premium grading and you will only enjoy the full benefit of the project if you can join in with the assignments. In addition this course contains the exciting opportunity to research and analyze historical decisionmaking, international relations, business cases and battles in an effort to truly understand constructing a convincing argument.\n\nMost important decisions in life, and many unimportant ones, are taken after some degree of reflection. If those decisions affect other people, we may take some advice and we might even follow it. The larger the issue and the greater number of people involved, the more likely that advice process will be institutionalised. Most of us tend to think of policy advice in the context of things as counsel to politicians in matters of national security or policy-making by governments. Of course, we also know that it takes place on a regular basis within businesses and other organisations. But it also happens in local politics and in local campaigns and in everyday life. Every time you try to influence someone’s decision, you are offering policy advice. Even if you are not planning to be an active advisor, the discipline of collecting and arranging the necessary materials is useful in all kinds of research and writing exercises. Writing a policy advice is what we call a ‘transferrable skill’.\n\nThe course requires an academic approach, but no previous experience. The projects can be completed by both novices and advanced learners. One thing is certain. Both groups will learn a lot from the experience.\n\nWhat is a policy advice?\nIn its simplest form, a policy advice is a short paper that argues your position on a particular issue and the course of action you propose. It also tries to convince the audience to adopt your position and to take action on your advice.\n\nWhat advice can I give?\nYou may well have a topic already, based on your work or your social situation. This could be a piece of equipment your firm might want to buy or a new market it might wish to enter. It could be a campaign for a local play area or against pollution in local ground-water. In this case it is a question of arranging and presenting your position, and discussing it with others in a similar position.\n\nOn the other hand, you might be open for suggestions. In this case, we have prepared some topics covering business case studies, issues of current affairs, and historical examples. For example, you could look into the archives advise Harry Truman to adopt a different policy towards the Soviet Union at the start of the Cold War. Alternatively you could suggest advise the Incas in 1532 not to be so trusting in their dealings with the Spanish. After all, you will know the outcome. So the course should appeal to everyone interested in practical policy-making as well as amateur historians, strategy gamers. Everyone can have fun applying these techniques to their favourite topics.\n\nWhat will I learn?\nThe project-based course is designed so that you learn by doing rather than by listening. The assignments that you complete, the feedback that you receive and the assignments of others that you read and upon which you comment are all intrinsic parts of the course. The lectures are designed to act as signposts along the way and the readings allow you to explore some of the issues in greater depth. During the whole course experience you will learn to:\n• Frame a starting position for your own research\n• Use search engines to locate materials required for your advice\n• Explore ‘academic’ data-bases\n• Annotate your sources correctly\n• Target your research for statistical data\n• Choose a visualisation for your statistical data\n• Construct an argument in a logical manner\n• Build up the logic in each paragraph\n• Conduct a SWOT analysis\n• Conduct a Risk Analysis\n• Present the materials in a position paper\n• Convert the position paper to a policy advice\n• Recognise the policy-making hierarchy and shaping the advice accordingly\n• Write a powerful and effective PowerPoint presentation\n• Place your project in the ‘real world’ context of the policy-cycle\n• And ... Discover a great, great deal about your chosen topic.\n\nHow much time will the course take?\nThe lecture materials in each module will themselves take no more than 30 minutes to view and review. Each module is accompanied by selected reading materials, but these are not compulsory. There is also a Skills Lab with extra literature and videos to assist you to improve your writing, computer and presentation skills. Combining these parts of the course, and assuming that you make some use of all the facilities offered, the ‘on-platform’ time should take no more than an one hour for each module.\nThe project-time depends on the degree of advancement in the project choice. If you come with a ready prepared idea and knowledge of the area, then the project-time should in total be approximately four to five hours. If you decide to use the suggestions in our collections, then you should add another three to four hours to familiarise yourself with the subject and the necessary materials. If you should decide to start a completely new project from scratch, the you would need to add another three hours or so to orient yourself in the problem and then locating the required materials.\n\nAbout Project-Centered Courses: Project-centered courses are designed to help you complete a personally meaningful real-world project, with your instructor and a community of learners with similar goals providing guidance and suggestions along the way. By actively applying new concepts as you learn, you’ll master the course content more efficiently; you’ll also get a head start on using the skills you gain to make positive changes in your life and career. When you complete the course, you’ll have a finished project that you’ll be proud to use and share","tutor":"Richard Griffiths","provider":"Coursera","language":"English","skills":["europe","persuasive writing","position paper","netherlands"],"subject":"Grammar \u0026 Writing","studentsInterested":"199","courseLink":"https://www.coursera.org/learn/persuasive-writing","classCentralLink":"https://www.class-central.com/course/coursera-be-persuasive-write-a-convincing-position-paper-or-policy-advice-project-centered-course-5729"}]