[{"title":"Introduction to Dynamical Systems and Chaos","about":"In this course you\u0027ll gain an introduction to the modern study of dynamical systems, the interdisciplinary field of applied mathematics that studies systems that change over time. \nTopics to be covered include: phase space, bifurcations, chaos, the butterfly effect, strange attractors, and pattern formation.  The course will focus on some of the realizations from the study of dynamical systems that are of particular relevance to complex systems:\n1.  Dynamical systems undergo bifurcations, where a small change in a system parameter such as the temperature or the harvest rate in a fishery leads to a large and qualitative change in the system\u0027s\nbehavior.\n2.  Deterministic dynamical systems can behave randomly.  This property, known as sensitive dependence or the butterfly effect, places strong limits on our ability to predict some phenomena.\n3.  Disordered behavior can be stable.  Non-periodic systems with the butterfly effect can have stable average properties.  So the average or statistical properties of a system can be predictable, even if its details are not.\n4.  Complex behavior can arise from simple rules.  Simple dynamical systems do not necessarily lead to simple results.  In particular, we will see that simple rules can produce patterns and structures of surprising complexity.","tutor":"David Feldman","provider":"Complexity Explorer","language":"English","skills":["usa","north america"],"subject":"Calculus","studentsInterested":"10.5k","courseLink":"https://www.http://chaos.complexityexplorer.org/","classCentralLink":"https://www.class-central.com/course/complexity-explorer-introduction-to-dynamical-systems-and-chaos-1182"},{"title":"Introduction to Mathematical Thinking","about":"Learn how to think the way mathematicians do – a powerful cognitive process developed over thousands of years.\n\nMathematical thinking is not the same as doing mathematics – at least not as mathematics is typically presented in our school system. School math typically focuses on learning procedures to solve highly stereotyped problems. Professional mathematicians think a certain way to solve real problems, problems that can arise from the everyday world, or from science, or from within mathematics itself. The key to success in school math is to learn to think inside-the-box. In contrast, a key feature of mathematical thinking is thinking outside-the-box – a valuable ability in today’s world. This course helps to develop that crucial way of thinking.","tutor":"Keith Devlin","provider":"Coursera","language":"English","skills":["usa","north america"],"subject":"Foundations of Mathematics","studentsInterested":"5.0k","courseLink":"https://www.coursera.org/learn/mathematical-thinking","classCentralLink":"https://www.class-central.com/course/coursera-introduction-to-mathematical-thinking-370"},{"title":"Nonlinear Dynamics: Mathematical and Computational Approaches","about":"This course provides a broad introduction to the field of nonlinear dynamics, focusing both on the mathematics and the computational tools that are so important in the study of chaotic systems. The course is aimed at students who have had at least one semester of college-level calculus and physics, and who can program in at least one high-level language.\n\nAfter a quick overview of the field and its history, we review the basic background that students need in order to succeed in this course. We then dig deeper into the dynamics of maps—discrete-time dynamical systems—encountering and unpacking the notions of state space, trajectories, attractors and basins of attraction, stability and instability, bifurcations, and the Feigenbaum number. We then move to the study of flows, where we revisit many of the same notions in the context of continuous-time dynamical systems. Since chaotic systems cannot, by definition, be solved in closed form, we spend several weeks thinking about how to solve them numerically and what challenges arise in that process. We finish by learning about techniques and tools for applying all of this theory to real-world data.","tutor":"Liz Bradley","provider":"Complexity Explorer","language":"English","skills":["usa","north america"],"subject":"Calculus","studentsInterested":"1.3k","courseLink":"https://www.http://nonlinear.complexityexplorer.org/","classCentralLink":"https://www.class-central.com/course/complexity-explorer-nonlinear-dynamics-mathematical-and-computational-approaches-1195"},{"title":"Estadística Aplicada a los Negocios","about":"Este curso proporciona una introducción al análisis de datos en base a las principales herramientas estadísticas, enfocándose en la estadística descriptiva y la estadística inferencial.\nSe estudian los diferentes tipos de gráficos estadísticos utilizados para describir el comportamiento de los datos. El curso de estadística aplicada presenta la definición de una variable aleatoria, funciones de densidad de probabilidad, de distribución acumulativa; también se presentan las variables aleatorias para el caso continuo y estimación con intervalos de confianza, finalizando con una introducción a los modelos econométricos.","tutor":"Jorge Samayoa","provider":"edX","language":"Spanish","skills":["galileox"],"subject":"Statistics \u0026 Probability","studentsInterested":"14","courseLink":"https://www.edx.org/course/estadistica-aplicada-los-negocios-galileox-pcpsta01x","classCentralLink":"https://www.class-central.com/course/edx-estadistica-aplicada-a-los-negocios-10270"},{"title":"Intro to Statistics","about":"Statistics is about extracting meaning from data. In this class, we will introduce techniques for visualizing relationships in data and systematic techniques for understanding the relationships using mathematics.\n\n\nWhy Take This Course?\nThis course will cover visualization, probability, regression and other topics that will help you learn the basic methods of understanding data with statistics.","tutor":"Sebastian Thrun","provider":"Udacity","language":"English","skills":["statistics","probability","usa","north america"],"subject":"Statistics \u0026 Probability","studentsInterested":"3.1k","courseLink":"https://www.udacity.com/course/intro-to-statistics--st101","classCentralLink":"https://www.class-central.com/course/udacity-intro-to-statistics-361"},{"title":"Statistical Learning","about":"This is an introductory-level course in supervised learning, with a focus on regression and classification methods. The syllabus includes: linear and polynomial regression, logistic regression and linear discriminant analysis; cross-validation and the bootstrap, model selection and regularization methods (ridge and lasso); nonlinear models, splines and generalized additive models; tree-based methods, random forests and boosting; support-vector machines. Some unsupervised learning methods are discussed: principal components and clustering (k-means and hierarchical).\nThis is not a math-heavy class, so we try and describe the methods without heavy reliance on formulas and complex mathematics. We focus on what we consider to be the important elements of modern data analysis. Computing is done in R. There are lectures devoted to R, giving tutorials from the ground up, and progressing with more detailed sessions that implement the techniques in each chapter.\nThe lectures cover all the material in An Introduction to Statistical Learning, with Applications in R by James, Witten, Hastie and Tibshirani (Springer, 2013). As of January 5, 2014, the pdf for this book will be available for free, with the consent of the publisher, on the book website.\nPREREQUISITES\nFirst courses in statistics, linear algebra, and computing.","tutor":"Rob Tibshirani and Trevor Hastie","provider":"Stanford OpenEdx","language":"English","skills":["usa","north america"],"subject":"Statistics \u0026 Probability","studentsInterested":"797","courseLink":"https://online.stanford.edu/courses/sohs-ystatslearning-statistical-learning-self-paced","classCentralLink":"https://www.class-central.com/course/stanford-openedx-statistical-learning-1579"},{"title":"Calculus One","about":"Calculus is about the very large, the very small, and how things change. The surprise is that something seemingly so abstract ends up explaining the real world. Calculus plays a starring role in the biological, physical, and social sciences. By focusing outside of the classroom, we will see examples of calculus appearing in daily life.\n\nThis course is a first and friendly introduction to calculus, suitable for someone who has never seen the subject before, or for someone who has seen some calculus but wants to review the concepts and practice applying those concepts to solve problems.\n\nNOTE: Enrollment for this course will close permanently on March 30, 2018. If you enroll prior to that date, you\u0027ll be able to access the course through September 2018.","tutor":"Jim Fowler","provider":"Coursera","language":"English","skills":["calculus","usa","north america"],"subject":"Calculus","studentsInterested":"7.1k","courseLink":"https://www.coursera.org/learn/calculus1","classCentralLink":"https://www.class-central.com/course/coursera-calculus-one-563"},{"title":"Mathematical Biostatistics Boot Camp 1","about":"This class presents the fundamental probability and statistical concepts used in elementary data analysis. It will be taught at an introductory level for students with junior or senior college-level mathematical training including a working knowledge of calculus. A small amount of linear algebra and programming are useful for the class, but not required.","tutor":"Brian Caffo","provider":"Coursera","language":"English","skills":["biostatistics","usa","north america"],"subject":"Statistics \u0026 Probability","studentsInterested":"514","courseLink":"https://www.coursera.org/learn/biostatistics","classCentralLink":"https://www.class-central.com/course/coursera-mathematical-biostatistics-boot-camp-1-596"},{"title":"Introduction to Probability - The Science of Uncertainty","about":"The world is full of uncertainty: accidents, storms, unruly financial markets, noisy communications. The world is also full of data. Probabilistic modeling and the related field of statistical inference are the keys to analyzing data and making scientifically sound predictions.\nProbabilistic models use the language of mathematics. But instead of relying on the traditional \"theorem - proof\" format, we develop the material in an intuitive -- but still rigorous and mathematically precise -- manner. Furthermore, while the applications are multiple and evident, we emphasize the basic concepts and methodologies that are universally applicable.\nThe course covers all of the basic probability concepts, including:\nmultiple discrete or continuous random variables, expectations, and conditional distributions\nlaws of large numbers\nthe main tools of Bayesian inference methods\nan introduction to random processes (Poisson processes and Markov chains)\nThe contents of this course are essentially the same as those of the corresponding MIT class (Probabilistic Systems Analysis and Applied Probability) -- a course that has been offered and continuously refined over more than 50 years. It is a challenging class, but it will enable you to apply the tools of probability theory to real-world applications or your research.","tutor":"Patrick Jaillet and John Tsitsiklis","provider":"edX","language":"English","skills":["mitx"],"subject":"Statistics \u0026 Probability","studentsInterested":"6.7k","courseLink":"https://www.edx.org/course/introduction-probability-science-mitx-6-041x-2","classCentralLink":"https://www.class-central.com/course/edx-introduction-to-probability-the-science-of-uncertainty-1496"},{"title":"Introduction to Algebra","about":"We live in a world of numbers. You see them every day: on clocks, in the stock market, in sports, and all over the news. Algebra is all about figuring out the numbers you don\u0027t see. You might know how fast you can throw a ball, but can you use this number to determine how far you can throw it? You might keep track of stock prices, but how can you figure out how much money you\u0027ve made (or lost) in the market? And you may already know how to tell time, but can you calculate at what times a clock\u0027s hour and minute hands are exactly aligned? With algebra, you can answer all of these questions, using the numbers you already know to solve for the unknown. Algebra is an essential tool for all of high school and college-level math, science, and engineering. So if you\u0027re starting out in one of these fields and you haven\u0027t yet mastered algebra, then this is the course for you!\n \nIn this course, you\u0027ll be able to choose your own path within each lesson, and you can jump between lessons to quickly review earlier material. AlgebraX covers a standard curriculum in high school Algebra I, and CCSS (common core) alignment is indicated where applicable.\nLearn more about our High School and AP* Exam Preparation Courses","tutor":"Zach Wissner-Gross","provider":"edX","language":"English","skills":["schoolyourself"],"subject":"Algebra \u0026 Geometry","studentsInterested":"6.7k","courseLink":"https://www.edx.org/course/introduction-algebra-schoolyourself-algebrax-1","classCentralLink":"https://www.class-central.com/course/edx-introduction-to-algebra-2526"},{"title":"Bayesian Statistics","about":"This course describes Bayesian statistics, in which one\u0027s inferences about parameters or hypotheses are updated as evidence accumulates. You will learn to use Bayes’ rule to transform prior probabilities into posterior probabilities, and be introduced to the underlying theory and perspective of the Bayesian paradigm. The course will apply Bayesian methods to several practical problems, to show end-to-end Bayesian analyses that move from framing the question to building models to eliciting prior probabilities to implementing in R (free statistical software) the final posterior distribution. Additionally, the course will introduce credible regions, Bayesian comparisons of means and proportions, Bayesian regression and inference using multiple models, and discussion of Bayesian prediction.\n\nWe assume learners in this course have background knowledge equivalent to what is covered in the earlier three courses in this specialization: \"Introduction to Probability and Data,\" \"Inferential Statistics,\" and \"Linear Regression and Modeling.\"","tutor":"Mine Çetinkaya-Rundel, Dr. David Banks, Dr. Colin Rundel and Dr. Merlise A Clyde","provider":"Coursera","language":"English","skills":["r programming","regression models","bayesian statistics","usa","north america"],"subject":"Statistics \u0026 Probability","studentsInterested":"260","courseLink":"https://www.coursera.org/learn/bayesian","classCentralLink":"https://www.class-central.com/course/coursera-bayesian-statistics-6097"},{"title":"Fibonacci Numbers and the Golden Ratio","about":"This is a course about the Fibonacci numbers, the golden ratio, and their intimate relationship. In this course, we learn the origin of the Fibonacci numbers and the golden ratio, and derive a formula to compute any Fibonacci number from powers of the golden ratio. We learn how to add a series of Fibonacci numbers and their squares, and unveil the mathematics behind a famous paradox called the Fibonacci bamboozlement. We construct a beautiful golden spiral and an even more beautiful Fibonacci spiral, and we learn why the Fibonacci numbers may appear unexpectedly in nature.\n\nThe course lecture notes, problems, and professor\u0027s suggested solutions can be downloaded for free from\nhttp://bookboon.com/en/fibonacci-numbers-and-the-golden-ratio-ebook\n\nCourse Overview video: https://youtu.be/GRthNC0_mrU","tutor":"Jeffrey R. Chasnov","provider":"Coursera","language":"English","skills":["asia","fibonacci numbers","golden ratio","hong kong"],"subject":"Mathematics","studentsInterested":"1.9k","courseLink":"https://www.coursera.org/learn/fibonacci","classCentralLink":"https://www.class-central.com/course/coursera-fibonacci-numbers-and-the-golden-ratio-6684"},{"title":"College Algebra","about":"Math is everywhere. In this class, you’ll gain an in-depth understanding of algebraic principles, many of which you may have seen before, and learn how to use them to solve problems that we encounter in everyday life. The online version of College Algebra will cover all of the topics that you would see in more traditional class formats, but it will present the material in a way that we hope you’ll find fresh and interesting. You will learn about functions, polynomials, graphing, complex numbers, exponential and logarithmic equations, and much more, all through exploring real-world scenarios.\n\n\nWhy Take This Course?\nIn this course, you will learn...\nTo translate word problems into mathematical expressions or equations\nTo manipulate algebraic expressions and solve equations\nTo graph different types of functions and to understand the relationship between a function’s graph and its equation\nTo model growth and decay","tutor":"Julie Sliva Spitzer and Miriam Swords Kalk","provider":"Udacity","language":"English","skills":["mathematics","algebra","usa","north america"],"subject":"Algebra \u0026 Geometry","studentsInterested":"1.2k","courseLink":"https://www.udacity.com/course/college-algebra--ma008","classCentralLink":"https://www.class-central.com/course/udacity-college-algebra-630"},{"title":"How to Learn Math: For Students","about":"How to Learn Math is a class for learners of all levels of mathematics. It combines really important information on the brain and learning with new evidence on the best ways to approach and learn math effectively. Many people have had negative experiences with math, and end up disliking math or failing. This class will give learners of math the information they need to become powerful math learners, it will correct any misconceptions they have about what math is, and it will teach them about their own potential to succeed and the strategies needed to approach math effectively. If you have had past negative experiences with math this will help change your relationship to one that is positive and powerful.\nThe course will feature Jo and a team of undergraduates, as well as videos of math in action - in dance, juggling, snowflakes, soccer and many other applications. It is designed with a pedagogy of active engagement. ","tutor":"Jo Boaler","provider":"Stanford OpenEdx","language":"English","skills":["mathematics","learning math","usa","north america"],"subject":"Mathematics","studentsInterested":"3.7k","courseLink":"https://online.stanford.edu/courses/gse-yeduc115-s-how-learn-math-students","classCentralLink":"https://www.class-central.com/course/stanford-openedx-how-to-learn-math-for-students-917"},{"title":"Intro to Descriptive Statistics","about":"Statistics is an important field of math that is used to analyze, interpret, and predict outcomes from data. Descriptive statistics will teach you the basic concepts used to describe data. This is a great beginner course for those interested in Data Science, Economics, Psychology, Machine Learning, Sports analytics and just about any other field.\n\n\nWhy Take This Course?\nThis course will teach you the basic terms and concepts in statistics as well as guide you through introductory probability.\n\n\n\nYou will learn how to....\nUse statistical research methods.\nCompute and interpret values like: Mean, Median, Mode, Sample, Population, and Standard Deviation.\nCompute simple probabilities.\nExplore data through the use of bar graphs, histograms, box plots, and other common visualizations.\nInvestigate distributions and understand a distributions properties.\nManipulate distributions to make probabilistic predictions on data.","tutor":"Katie Kormanik, Ronald Rogers and Sean Laraway","provider":"Udacity","language":"English","skills":["statistics","mathematics","usa","north america"],"subject":"Statistics \u0026 Probability","studentsInterested":"722","courseLink":"https://www.udacity.com/course/intro-to-descriptive-statistics--ud827","classCentralLink":"https://www.class-central.com/course/udacity-intro-to-descriptive-statistics-2309"},{"title":"Effective Thinking Through Mathematics","about":"A wondrously romantic belief is that brilliant thinkers magically produce brilliant ideas: Einstein jostles his hair and relativity falls out. We can enjoy these fanciful visions of leaps of genius, but we should not be fooled into believing that they’re reality.\nBrilliant innovators are brilliant because they practice habits of thinking that inevitably carry them step by step to works of genius. No magic and no leaps are involved.\nProfessor Starbird will discuss how habits of effective thinking and creativity can be taught and learned through puzzles and mathematics. Anyone who practices these habits of mind will inevitably create new insights, new ideas, and new solutions.","tutor":"Michael Starbird","provider":"edX","language":"English","skills":["utaustinx"],"subject":"Foundations of Mathematics","studentsInterested":"3.8k","courseLink":"https://www.edx.org/course/effective-thinking-through-mathematics-utaustinx-ut-9-01x-0","classCentralLink":"https://www.class-central.com/course/edx-effective-thinking-through-mathematics-1335"},{"title":"Introduction to Differential Equations","about":"Phenomena as diverse as the motion of the planets, the spread of a disease, and the oscillations of a suspension bridge are governed by differential equations.MATH226x is an introduction to the mathematical theory of ordinary differential equations. This course follows a modern dynamical systems approach to the subject. In particular, equations are analyzed using qualitative, numerical, and if possible, symbolic techniques.\nMATH226 is essentially the edX equivalent of MA226, a one-semester course in ordinary differential equations taken by more than 500 students per year at Boston University. It is divided into three parts. MATH226.1 is the first of these three parts.\nIn MATH226.1, we will discuss biological and physical models that can be expressed as differential equations with one or two dependent variables. We will discuss geometric/qualitative and numerical techniques that apply to all differential equations. When possible, we will study some of the standard symbolic solution techniques such as separation of variables and the use of integrating factors. We will also study the theory of existence and uniqueness of solutions, the phase line and bifurcations for first-order autonomous systems, and the phase plane for two-dimensional autonomous systems. The techniques that we develop will be used to analyze models throughout the course.\nFor additional information on obtaining credit through the ACE Alternative Credit Project, please visit here.","tutor":"Paul Blanchard","provider":"edX","language":"English","skills":["bux"],"subject":"Calculus","studentsInterested":"4.0k","courseLink":"https://www.edx.org/course/introduction-differential-equations-bux-math226-1x-1","classCentralLink":"https://www.class-central.com/course/edx-introduction-to-differential-equations-2636"},{"title":"Basic Statistics","about":"Understanding statistics is essential to understand research in the social and behavioral sciences. In this course you will learn the basics of statistics; not just how to calculate them, but also how to evaluate them. This course will also prepare you for the next course in the specialization - the course Inferential Statistics.\n\nIn the first part of the course we will discuss methods of descriptive statistics. You will learn what cases and variables are and how you can compute measures of central tendency (mean, median and mode) and dispersion (standard deviation and variance). Next, we discuss how to assess relationships between variables, and we introduce the concepts correlation and regression.\n\nThe second part of the course is concerned with the basics of probability: calculating probabilities, probability distributions and sampling distributions. You need to know about these things in order to understand how inferential statistics work.\n\nThe third part of the course consists of an introduction to methods of inferential statistics - methods that help us decide whether the patterns we see in our data are strong enough to draw conclusions about the underlying population we are interested in. We will discuss confidence intervals and significance tests.\n\nYou will not only learn about all these statistical concepts, you will also be trained to calculate and generate these statistics yourself using freely available statistical software.","tutor":"Annemarie Zand Scholten","provider":"Coursera","language":"English","skills":["statistics","europe","netherlands"],"subject":"Statistics \u0026 Probability","studentsInterested":"1.6k","courseLink":"https://www.coursera.org/learn/basic-statistics","classCentralLink":"https://www.class-central.com/course/coursera-basic-statistics-4312"},{"title":"Advanced Precalculus: Geometry, Trigonometry and Exponentials","about":"Take your precalculus knowledge to the next level\nThis course is the second of two precalculus courses from the University of Padova, providing you with the advanced mathematical skills required to complete a first course in calculus.\nYou’ll get to grips with more challenging precalculus topics: plane and solid geometry; logarithms and exponentials; equalities and inequalities; and trigonometric functions and identities.\nBy the end of this course you’ll have gained the skills to support further mathematical studies.\nThis course is for anyone who wants to brush up on their basic mathematical skills, particularly students in the last year of high school, or at the beginning of undergraduate studies, who intend to take a first course in calculus.\nIdeally, you’ll have already taken the first course - Precalculus: the Mathematics of Numbers, Functions and Equations or be familiar with the topics covered in it, and have a basic knowledge of high school mathematics.","tutor":"Francis Clarke","provider":"FutureLearn","language":"English","skills":["geometry","pre-calculus","trigonometry"],"subject":"Calculus","studentsInterested":"111","courseLink":"https://www.futurelearn.com/courses/advanced-precalculus","classCentralLink":"https://www.class-central.com/course/futurelearn-advanced-precalculus-geometry-trigonometry-and-exponentials-9602"},{"title":"Linear Algebra - Foundations to Frontiers","about":"Linear Algebra: Foundations to Frontiers (LAFF) is packed full of challenging, rewarding material that is essential for mathematicians, engineers, scientists, and anyone working with large datasets. Students appreciate our unique approach to teaching linear algebra because:\nIt’s visual.\nIt connects hand calculations, mathematical abstractions, and computer programming.\nIt illustrates the development of mathematical theory.\nIt’s applicable.\nIn this course, you will learn all the standard topics that are taught in typical undergraduate linear algebra courses all over the world, but using our unique method, you\u0027ll also get more! LAFF was developed following the syllabus of an introductory linear algebra course at The University of Texas at Austin taught by Professor Robert van de Geijn, an expert on high performance linear algebra libraries. Through short videos, exercises, visualizations, and programming assignments, you will study Vector and Matrix Operations, Linear Transformations, Solving Systems of Equations, Vector Spaces, Linear Least-Squares, and Eigenvalues and Eigenvectors. In addition, you will get a glimpse of cutting edge research on the development of linear algebra libraries, which are used throughout computational science.\nMATLAB licenses will be made available to the participants free of charge for the duration of the course.\nWe invite you to LAFF with us!","tutor":"Robert van de Geijn and Maggie Myers","provider":"edX","language":"English","skills":["utaustinx","math for ai core"],"subject":"Algebra \u0026 Geometry","studentsInterested":"2.8k","courseLink":"https://www.edx.org/course/laff-linear-algebra-foundations-to-frontiers","classCentralLink":"https://www.class-central.com/course/edx-linear-algebra-foundations-to-frontiers-1337"},{"title":"Intro Algebra Review","about":"This course provides a brief review of introductory algebra topics. Topics to be covered include integer operations, order of operations, perimeter and area, fractions and decimals, scientific notation, ratios and rates, conversions, percents, algebraic expressions, linear equations, the Pythagorean theorem, and graphing.\n\n\nWhy Take This Course?\nAt the end of this course students will have reviewed the core topics of introductory algebra. Students will be comfortable with the concepts and procedures of introductory algebra, and be able to apply their knowledge to other coursework and real-world problems.\nDuring this course, you will review\nInteger operations including addition, subtraction, multiplication, division, and absolute value.\nEvaluating using order of operations.\nAssociative and Commutative properties.\nPerimeter and area of rectangles, triangles, squares, and circles.\nFraction operations including simplifying, adding, subtracting, multiplying, and dividing.\nConverting between fractions, decimals, and percents.\nRounding decimals to appropriate place value.\nConverting between standard notation and scientific notation.\nRates and ratios.\nUnit conversions.\nSimplifying and evaluating algebraic expressions.\nUsing the Pythagorean Theorem.\nSolving and graphing linear equations.\nWriting linear equations.","tutor":"Sue Ann Austin and Kelly Vetter","provider":"Udacity","language":"English","skills":["algebra"],"subject":"Algebra \u0026 Geometry","studentsInterested":"421","courseLink":"https://www.udacity.com/course/intro-algebra-review--ma004","classCentralLink":"https://www.class-central.com/course/udacity-intro-algebra-review-2666"},{"title":"Intro to Inferential Statistics","about":"Inferential statistics allows us to draw conclusions from data that might not be immediately obvious. This course focuses on enhancing your ability to develop hypotheses and use common tests such as t-tests, ANOVA tests, and regression to validate your claims.\n\n\nWhy Take This Course?\nThis course will guide you through some of the basic tools of inferential statistics.\n\n\n\nThis course will cover:\nestimating parameters of a population using sample statistics\nhypothesis testing and confidence intervals\nt-tests and ANOVA\ncorrelation and regression\nchi-squared test","tutor":"Katie Kormanik, Ronald Rogers and Sean Laraway","provider":"Udacity","language":"English","skills":["statistics","usa","north america"],"subject":"Statistics \u0026 Probability","studentsInterested":"1.9k","courseLink":"https://www.udacity.com/course/intro-to-inferential-statistics--ud201","classCentralLink":"https://www.class-central.com/course/udacity-intro-to-inferential-statistics-2310"},{"title":"Introduction to Linear Models and Matrix Algebra","about":"Matrix Algebra underlies many of the current tools for experimental design and the analysis of high-dimensional data. In this introductory data analysis course, we will use matrix algebra to represent the linear models that commonly used to model differences between experimental units. We perform statistical inference on these differences. Throughout the course we will use the R programming language.\nGiven the diversity in educational background of our students we have divided the series into seven parts. You can take the entire series or individual courses that interest you. If you are a statistician you should consider skipping the first two or three courses, similarly, if you are biologists you should consider skipping some of the introductory biology lectures. Note that the statistics and programming aspects of the class ramp up in difficulty relatively quickly across the first three courses. By the third course will be teaching advanced statistical concepts such as hierarchical models and by the fourth advanced software engineering skills, such as parallel computing and reproducible research concepts.\nThese courses make up 2 XSeries and are self-paced:\nPH525.1x: Statistics and R for the Life Sciences\nPH525.2x: Introduction to Linear Models and Matrix Algebra\nPH525.3x: Statistical Inference and Modeling for High-throughput Experiments\nPH525.4x: High-Dimensional Data Analysis","tutor":"Michael Love and Rafael Irizarry","provider":"edX","language":"English","skills":["harvardx"],"subject":"Algebra \u0026 Geometry","studentsInterested":"2.0k","courseLink":"https://www.edx.org/course/introduction-linear-models-matrix-harvardx-ph525-2x-2","classCentralLink":"https://www.class-central.com/course/edx-introduction-to-linear-models-and-matrix-algebra-2963"},{"title":"Aléatoire : une introduction aux probabilités - Partie 1","about":"Ce cours d\u0027introduction aux probabilités a la même contenu que le cours de tronc commun de première année de l\u0027École polytechnique donné par Sylvie Méléard.\n\nLe cours introduit graduellement la notion de variable aléatoire et culmine avec la loi des grands nombres et le théorème de la limite centrale.\n\nLes notions mathématiques nécessaires sont introduites au fil du cours et de nombreux exercices corrigés sont proposés.\n\nCe cours propose aussi une introduction aux méthodes de simulations des variables aléatoires comme la méthode de Monte Carlo. Des expériences numériques interactives sont également mises à votre disposition pour vous permettre de visualiser diverses notions.","tutor":"Sylvie Méléard and Jean-René Chazottes","provider":"Coursera","language":"French","skills":["canada","north america"],"subject":"Statistics \u0026 Probability","studentsInterested":"67","courseLink":"https://www.coursera.org/learn/probabilites-1","classCentralLink":"https://www.class-central.com/course/coursera-aleatoire-une-introduction-aux-probabilites-partie-1-852"},{"title":"Analytic Combinatorics","about":"Analytic Combinatorics teaches a calculus that enables precise quantitative predictions of large combinatorial structures. This course introduces the symbolic method to derive functional relations among ordinary, exponential, and multivariate generating functions, and methods in complex analysis for deriving accurate asymptotics from the GF equations.","tutor":"Robert Sedgewick","provider":"Coursera","language":"English","skills":["calculus","advanced calculus","combinatorial mathematics","usa","north america"],"subject":"Calculus","studentsInterested":"491","courseLink":"https://www.coursera.org/learn/analytic-combinatorics","classCentralLink":"https://www.class-central.com/course/coursera-analytic-combinatorics-922"},{"title":"Çok değişkenli Fonksiyon II: Uygulamalar / Multivariable Calculus II: Applications","about":"Ders çok değişkenli fonksiyonlardaki iki derslik dizinin ikincisidir. Birinci ders türev ve entegral kavramlarını geliştirmekte ve bu konulardaki problemleri temel çözme yöntemlerini sunmaktadır. Bu ders, birinci derste geliştirilen temeller üzerine daha ileri konuları işlemekte ve daha kapsamlı uygulamalar ve çözümlü örnekler sunmaktadır. Ders gerçek yaşamdan gelen uygulamaları da tanıtmaya önem veren “içerikli yaklaşımla” tasarlanmıştır. \n\nBölümler\nBölüm 1: Multivar 1\u0027in Özeti, Dairesel Koordinatlarda Entegraller\nBölüm 2: Türev Uygulamalarından Seçme Konular\nBölüm 3: Çok Değişkenle Zincirleme Türev ve Jakobiyan\nBölüm 4: Uzayda Yüzey ve Hacım Entegralleri\nBölüm 5: Düzlemde Akı Entegralleri\nBölüm 6: Düzlemde Green, Uzayda Stokes ve Green-Gauss Teoremleri\nBölüm 7: Stokes ve Green-Gauss Teoremleri ve Doğanın Korunum Yasaları\n-----------\nThe course is the second of the two course sequence of calculus of multivariable functions. The first course develops the concepts of derivatives and integrals of functions of several variables, and the basic tools for doing the relevant calculations. This course builds on the foundations of the first course and introduces more advanced topics along with more advanced applications and solved problems. The course is designed with a “content-based” approach, i. e. by solving examples, as many as possible from real life situations.\n\nBölümler\nBölüm 1: Summary of Multivar I, Integral in Circular Coordinates\nBölüm 2: Topics of Derivative Applications\nBölüm 3: Chain Derivatives with Multi Variables and Jacobian\nBölüm 4: Surface and Volume Integrals in Space\nBölüm 5: Flux Integrals in the Plane\nBölüm 6: Green in Plane, Stokes in Space and Green-Gauss Theorems\nBölüm 7: Stokes and Green-Gauss Theorem and Nature Conservation Laws\n-----------\nKaynak: Attila Aşkar, “Çok değişkenli fonksiyonlarda türev ve entegral”. Bu kitap dört ciltlik dizinin ikinci cildidir. Dizinin diğer kitapları Cilt 1 “Tek değişkenli fonksiyonlarda türev ve entegral”, Cilt 3: “Doğrusal cebir” ve Cilt 4: “Diferansiyel denklemler” dir.\n\nSource: Attila Aşkar, Calculus of Multivariable Functions, Volume 2 of the set of Vol1: Calculus of Single Variable Functions, Volume 3: Linear Algebra and Volume 4: Differential Equations. All available online starting on January 6, 2014","tutor":"Attila Aşkar","provider":"Coursera","language":"Turkish","skills":["asia","multivariable calculus","turkey"],"subject":"Calculus","studentsInterested":"9","courseLink":"https://www.coursera.org/learn/calculus-diferansiyel-hesap","classCentralLink":"https://www.class-central.com/course/coursera-cok-degiskenli-fonksiyon-ii-uygulamalar-multivariable-calculus-ii-applications-4165"},{"title":"An Intuitive Introduction to Probability","about":"This course will provide you with an intuitive and practical introduction into Probability Theory. You will be able to learn how to apply Probability Theory in different scenarios and you will earn a \"toolbox\" of methods to deal with uncertainty in your daily life.\n\nThe course is split in 5 modules. In each module you will first have an easy introduction into the topic, which will serve as a basis to further develop your knowledge about the topic and acquire the \"tools\" to deal with uncertainty. Additionally, you will have the opportunity to complete 5 exercise sessions to reflect about the content learned in each module and start applying your earned knowledge right away.\n\nThe topics covered are: \"Probability\", \"Conditional Probability\", \"Applications\", \"Random Variables\", and \"Normal Distribution\".\n\nYou will see how the modules are taught in a lively way, focusing on having an entertaining and useful learning experience! We are looking forward to see you online!","tutor":"Karl Schmedders","provider":"Coursera","language":"English","skills":["europe","switzerland","new-moocs-2017"],"subject":"Statistics \u0026 Probability","studentsInterested":"145","courseLink":"https://www.coursera.org/learn/introductiontoprobability","classCentralLink":"https://www.class-central.com/course/coursera-an-intuitive-introduction-to-probability-7792"},{"title":"What is a Proof?","about":"Mathematical thinking is crucial in all areas of computer science: algorithms, bioinformatics, computer graphics, data science, machine learning, etc. In this course, we will learn the most important tools used in discrete mathematics: induction, recursion, logic, invariants, examples, optimality. We will use these tools to answer typical programming questions like: How can we be certain a solution exists? Am I sure my program computes the optimal answer? Do each of these objects meet the given requirements?\n\nIn the course, we use a try-this-before-we-explain-everything approach: you will be solving many interactive (and mobile friendly) puzzles that were carefully designed to allow you to invent many of the important ideas and concepts yourself.\n\nPrerequisites:\n1. We assume only basic math (e.g., we expect you to know what is a square or how to add fractions), common sense and curiosity.\n2. Basic programming knowledge is necessary as some quizzes require programming in Python.","tutor":"Alexander S. Kulikov, Michael Levin and Vladimir Podolskii","provider":"Coursera","language":"English","skills":["mathematical proofs","new-moocs-2017"],"subject":"Mathematics","studentsInterested":"69","courseLink":"https://www.coursera.org/learn/what-is-a-proof","classCentralLink":"https://www.class-central.com/course/coursera-what-is-a-proof-9212"},{"title":"Aléatoire : une introduction aux probabilités - Partie 2","about":"Ce cours d\u0027introduction aux probabilités a la même contenu que le cours de tronc commun de première année de l\u0027École polytechnique donné par Sylvie Méléard.\n\nLe cours introduit graduellement la notion de variable aléatoire et culmine avec la loi des grands nombres et le théorème de la limite centrale.\n\nLes notions mathématiques nécessaires sont introduites au fil du cours et de nombreux exercices corrigés sont proposés.\n\nCe cours propose aussi une introduction aux méthodes de simulations des variables aléatoires comme la méthode de Monte Carlo. Des expériences numériques interactives sont également mises à votre disposition pour vous permettre de visualiser diverses notions.","tutor":"Sylvie Méléard, Jean-René Chazottes and Carl Graham","provider":"Coursera","language":"French","skills":["probability","canada","north america"],"subject":"Statistics \u0026 Probability","studentsInterested":"11","courseLink":"https://www.coursera.org/learn/probabilites-2","classCentralLink":"https://www.class-central.com/course/coursera-aleatoire-une-introduction-aux-probabilites-partie-2-5716"},{"title":"Doğrusal Cebir I: Uzaylar ve İşlemciler / Linear Algebra I: Spaces and Operators","about":"Bu ders doğrusal cebir ikili dizinin birincisidir. Doğrusal uzaylar kavramı, doğrusal işlemciler, matris gösterimleri ve denklem sistemlerinin hesaplanabilmesi için temel araçlar vb. konuları içermektedir. Ders gerçek yaşamdan gelen uygulamaları da tanıtmaya önem veren “içerikli yaklaşımla” tasarlanmıştır.\n\nBölümler:\nBölüm 1: Doğrusal Cebirin Matematikdeki Yeri ve Kapsamı\nBölüm 2: Düzlemdeki Vektörlerin Öğrettikleri\nBölüm 3: İki Bilinmeyenli Denklemlerin Öğrettikleri\nBölüm 4: Doğrusal Uzaylar\nBölüm 5: Fonksiyon Uzayları ve Fourier Serileri\nBölüm 6: Doğrusal İşlemciler ve Dönüşümler\nBölüm 7: Doğrusal İşlemcilerden Matrislere Geçiş\nBölüm 8: Matris İşlemleri\n-----------\nThis is the first of the sequence of two courses. It develops the fundamental concepts in linear spaces, linear operators, matrix representations and basic tools for calculations with systems of equations. The course is designed with a “content based” emphasis, answering the “why” and “where“ of the topics, as much as the traditional “what” and “how” leading to “definitions” and “proofs”.\n\nChapters:\nChapter 1: Place and Contents of Linear Algebra Cebirin\nChapter 2: Learning From Vectors in the Plane\nChapter 3: Learning From Equations For Two Unknowns\nChapter 4: Linear Spaces\nChapter 5: Function Spaces and Fourier Series\nChapter 6: Linear Operators and Transformations\nChapter 7: From Linear Operators to Matrices\nChapter 8: Matrix Operations\n-----------\nKaynak: Attila Aşkar, “Doğrusal cebir”. Bu kitap dört ciltlik dizinin üçüncü cildidir. Dizinin diğer kitapları Cilt 1 “Tek değişkenli fonksiyonlarda türev ve entegral”, Cilt 2: \"Çok değişkenli fonksiyonlarda türev ve entegral\" ve Cilt 4: “Diferansiyel denklemler” dir.\n\nSource: Attila Aşkar, Linear Algebra, Volume 3 of the set of Vol1: Calculus of Single Variable Functions, Volume 2: Calculus of Multivariable Functions and Volume 4: Differential Equations.","tutor":"Attila Aşkar","provider":"Coursera","language":"Turkish","skills":["linear algebra","asia","linear spaces","turkey"],"subject":"Algebra \u0026 Geometry","studentsInterested":"16","courseLink":"https://www.coursera.org/learn/linearalgebra1","classCentralLink":"https://www.class-central.com/course/coursera-dogrusal-cebir-i-uzaylar-ve-islemciler-linear-algebra-i-spaces-and-operators-5045"},{"title":"Linear Regression for Business Statistics","about":"Regression Analysis is perhaps the single most important Business Statistics tool used in the industry. Regression is the engine behind a multitude of data analytics applications used for many forms of forecasting and prediction.\nThis is the fourth course in the specialization, \"Business Statistics and Analysis\". The course introduces you to the very important tool known as Linear Regression. You will learn to apply various procedures such as dummy variable regressions, transforming variables, and interaction effects. All these are introduced and explained using easy to understand examples in Microsoft Excel.\nThe focus of the course is on understanding and application, rather than detailed mathematical derivations.\nNote: This course uses the ‘Data Analysis’ tool box which is standard with the Windows version of Microsoft Excel. It is also standard with the 2016 or later Mac version of Excel. However, it is not standard with earlier versions of Excel for Mac.\n\n\nWEEK 1\nModule 1: Regression Analysis: An Introduction\nIn this module you will get introduced to the Linear Regression Model. We will build a regression model and estimate it using Excel. We will use the estimated model to infer relationships between various variables and use the model to make predictions. The module also introduces the notion of errors, residuals and R-square in a regression model.\n\nTopics covered include:\n• Introducing the Linear Regression\n• Building a Regression Model and estimating it using Excel\n• Making inferences using the estimated model\n• Using the Regression model to make predictions\n• Errors, Residuals and R-square\n\n\nWEEK 2\nModule 2: Regression Analysis: Hypothesis Testing and Goodness of Fit\nThis module presents different hypothesis tests you could do using the Regression output. These tests are an important part of inference and the module introduces them using Excel based examples. The p-values are introduced along with goodness of fit measures R-square and the adjusted R-square. Towards the end of module we introduce the ‘Dummy variable regression’ which is used to incorporate categorical variables in a regression.\n\nTopics covered include:\n• Hypothesis testing in a Linear Regression\n• ‘Goodness of Fit’ measures (R-square, adjusted R-square)\n• Dummy variable Regression (using Categorical variables in a Regression)\n\n\nWEEK 3\nModule 3: Regression Analysis: Dummy Variables, Multicollinearity\nThis module continues with the application of Dummy variable Regression. You get to understand the interpretation of Regression output in the presence of categorical variables. Examples are worked out to re-inforce various concepts introduced. The module also explains what is Multicollinearity and how to deal with it.\n\nTopics covered include:\n• Dummy variable Regression (using Categorical variables in a Regression)\n• Interpretation of coefficients and p-values in the presence of Dummy variables\n• Multicollinearity in Regression Models\n\n\nWEEK 4\nModule 4: Regression Analysis: Various Extensions\nThe module extends your understanding of the Linear Regression, introducing techniques such as mean-centering of variables and building confidence bounds for predictions using the Regression model. A powerful regression extension known as ‘Interaction variables’ is introduced and explained using examples. We also study the transformation of variables in a regression and in that context introduce the log-log and the semi-log regression models.\n\nTopics covered include:\n• Mean centering of variables in a Regression model\n• Building confidence bounds for predictions using a Regression model\n• Interaction effects in a Regression\n• Transformation of variables\n• The log-log and semi-log regression models","tutor":"Sharad Borle","provider":"Coursera","language":"English","skills":["usa","north america","new-moocs-2017"],"subject":"Mathematics","studentsInterested":"51","courseLink":"https://www.coursera.org/learn/linear-regression-business-statistics","classCentralLink":"https://www.class-central.com/course/coursera-linear-regression-for-business-statistics-7041"},{"title":"Применение производной и интеграла в курсе общей физики","about":"Данный курс поможет обучающимся преодолеть трудности, вызванные недостаточным знанием математики и использовать свои знания для решения физических задач. Он поможет создать базу для успешного освоения дисциплин, в которых необходимы знания основ дифференциального и интегрального исчисления. Без этих навыков невозможна успешная деятельность инженеров и специалистов любого профиля.\nФизические явления и законы так или иначе описываются математическими формулами. Важнейшие открытия и изобретения в мире не обходятся без математики. Для решения широкого круга задач необходимо использовать математический аппарат, связанный с дифференциальным и интегральным исчислением функций одной вещественной переменной.\nОсвоив этот курс, вы сможете применять свои знания не только в физике для расчета, например, траекторий движения космических ракет и спутников, для прогнозирования работы ядерных реакторов, но и в геологии, биологии, экономике и др. для прогнозирования различных динамических процессов.\nКурс включает в себя тесты и набор заданий, формирующий основные навыки, которыми несколько облегчат изучение общей физики, так как позволят сконцентрироваться на физической сути явлений.\nОсвоившие курс учащиеся смогут решать следующие физические задачи:\n• находить кинематические характеристики движения тел;\n• исследовать характер движения тел при заданном законе движения;\n• определять качественное поведение рассматриваемых физических величин в предельных случаях;\n• определять действующие на тело силы при заданном законе движения и т. п.\nТакже прошедшие обучение смогут:\n• строить уравнение касательной к графику функции в заданной точке;\n• находить среднее значение функции на заданном отрезке;\n• находить площади фигур, ограниченных заданными кривыми.\nДля успешного освоения курса слушателю желательно знать основы математики и физики в объеме школьной программы.","tutor":"Романов Александр Иванович","provider":"Coursera","language":"Russian","skills":["russia","new-moocs-2017"],"subject":"Calculus","studentsInterested":"2","courseLink":"https://www.coursera.org/learn/proizvodnaya-i-integral-v-fizike","classCentralLink":"https://www.class-central.com/course/coursera---------7806"},{"title":"Математика для всех","about":"Курс состоит из нескольких жизненных сюжетов, каждый из которых разбирается \"по косточкам\" и, как выясняется, содержит внутри себя нетривиальное математическое ядро. Это ядро далее также бьётся на \"элементарные частицы\" - так, что у слушателей возникает понимание всех глубинных механизмов рассматриваемой ситуации.\n\nСюжеты сгруппированы по смыслу: каждая группа сюжетов вращается вокруг одной и той же основополагающей математической идеи. Таких идей всего пять: инвариант, шаг через бесконечность, непрерывность физических процессов, самоподобие природы и нашего её восприятия, и, наконец, алгебраическая природа различных чисел.\n\nКурс предназначен для всех, кто хочет лучше представлять себе тот мир, в котором мы живём. Не имея никаких предварительных знаний, слушатели будут введены в курс дела: какая техника используется в математике (\"абсолютное доказательство\" как главное отличие математического знания от любого иного) и как строить рассуждения.\n\nВскоре выйдет вторая часть, \"Математика для энтузиастов\", которую нужно будет уже изучать \"с листочком бумаги и ручкой в руках\". В ней встретится более нетривиальный материал, в том числе \"приводные ремни\" современной математики - \"группы\" и \"поля\". Кроме того, будут вскрыты весьма нетривиальные подоплёки многих школьных задач.\n\nКурс состоит из 6 недель и 6 контрольных работ по окончании каждой недели. Для успешного прохождения курса необходимо успешно преодолеть все 6 испытаний.","tutor":"Савватеев Алексей Владимирович and Бычков Борис Сергеевич","provider":"Coursera","language":"Russian","skills":["new-moocs-2017"],"subject":"Mathematics","studentsInterested":"14","courseLink":"https://www.coursera.org/learn/matematika-dlya-vseh","classCentralLink":"https://www.class-central.com/course/coursera----8405"},{"title":"Bayesian Statistics: Techniques and Models","about":"This is the second of a two-course sequence introducing the fundamentals of Bayesian statistics. It builds on the course Bayesian Statistics: From Concept to Data Analysis, which introduces Bayesian methods through use of simple conjugate models. Real-world data often require more sophisticated models to reach realistic conclusions. This course aims to expand our “Bayesian toolbox” with more general models, and computational techniques to fit them. In particular, we will introduce Markov chain Monte Carlo (MCMC) methods, which allow sampling from posterior distributions that have no analytical solution. We will use the open-source, freely available software R (some experience is assumed, e.g., completing the previous course in R) and JAGS (no experience required). We will learn how to construct, fit, assess, and compare Bayesian statistical models to answer scientific questions involving continuous, binary, and count data. This course combines lecture videos, computer demonstrations, readings, exercises, and discussion boards to create an active learning experience. The lectures provide some of the basic mathematical development, explanations of the statistical modeling process, and a few basic modeling techniques commonly used by statisticians. Computer demonstrations provide concrete, practical walkthroughs. Completion of this course will give you access to a wide range of Bayesian analytical tools, customizable to your data.","tutor":"Matthew Heiner","provider":"Coursera","language":"English","skills":["new-moocs-2017"],"subject":"Statistics \u0026 Probability","studentsInterested":"74","courseLink":"https://www.coursera.org/learn/mcmc-bayesian-statistics","classCentralLink":"https://www.class-central.com/course/coursera-bayesian-statistics-techniques-and-models-8424"},{"title":"Introduction to Graph Theory","about":"We invite you to a fascinating journey into Graph Theory — an area which connects the elegance of painting and the rigor of mathematics; is simple, but not unsophisticated. Graph Theory gives us, both an easy way to pictorially represent many major mathematical results, and insights into the deep theories behind them.\n\nIn this course, among other intriguing applications, we will see how GPS systems find shortest routes, how engineers design integrated circuits, how biologists assemble genomes, why a political map can always be colored using a few colors. We will study Ramsey Theory which proves that in a large system, complete disorder is impossible!\n\nBy the end of the course, we will implement an algorithm which finds an optimal assignment of students to schools. This algorithm, developed by David Gale and Lloyd S. Shapley, was later recognized by the conferral of Nobel Prize in Economics.\n\nAs prerequisites we assume only basic math (e.g., we expect you to know what is a square or how to add fractions), basic programming in python (functions, loops, recursion), common sense and curiosity. Our intended audience are all people that work or plan to work in IT, starting from motivated high school students.","tutor":"Alexander S. Kulikov","provider":"Coursera","language":"English","skills":["algorithms","graph theory","new-moocs-2017"],"subject":"Mathematics","studentsInterested":"92","courseLink":"https://www.coursera.org/learn/graphs","classCentralLink":"https://www.class-central.com/course/coursera-introduction-to-graph-theory-9213"},{"title":"Mathematics for Machine Learning: Linear Algebra","about":"In this course on Linear Algebra we look at what linear algebra is and how it relates to vectors and matrices. Then we look through what vectors and matrices are and how to work with them, including the knotty problem of eigenvalues and eigenvectors, and how to use these to solve problems. Finally we look at how to use these to do fun things with datasets - like how to rotate images of faces and how to extract eigenvectors to look at how the Pagerank algorithm works.\nSince we\u0027re aiming at data-driven applications, we\u0027ll be implementing some of these ideas in code, not just on pencil and paper. Towards the end of the course, you\u0027ll write code blocks and encounter Jupyter notebooks in Python, but don\u0027t worry, these will be quite short, focussed on the concepts, and will guide you through if you’ve not coded before.\n\nAt the end of this course you will have an intuitive understanding of vectors and matrices that will help you bridge the gap into linear algebra problems, and how to apply these concepts to machine learning.","tutor":"David Dye, Samuel J. Cooper and A. Freddie Page","provider":"Coursera","language":"English","skills":["machine learning","mathematics","linear algebra"],"subject":"Machine Learning","studentsInterested":"65","courseLink":"https://www.coursera.org/learn/linear-algebra-machine-learning","classCentralLink":"https://www.class-central.com/course/coursera-mathematics-for-machine-learning-linear-algebra-10453"},{"title":"Initiation à la théorie des distributions","about":"Une fonction discontinue peut-elle être solution d\u0027une équation différentielle? Comment définir rigoureusement la masse de Dirac (une \"fonction\" d\u0027intégrale un, nulle partout sauf en un point) et ses dérivées? Peut-on définir une notion de \"dérivée d\u0027ordre fractionnaire\"? Cette initiation aux distributions répond à ces questions - et à bien d\u0027autres.","tutor":"François Golse and Yvan Martel","provider":"Coursera","language":"French","skills":["canada","north america"],"subject":"Foundations of Mathematics","studentsInterested":"23","courseLink":"https://www.coursera.org/learn/theorie-des-distributions","classCentralLink":"https://www.class-central.com/course/coursera-initiation-a-la-theorie-des-distributions-691"},{"title":"Çok değişkenli Fonksiyon I: Kavramlar / Multivariable Calculus I: Concepts","about":"Ders çok değişkenli fonksiyonlardaki ikili dizinin birincisidir. Burada çok değişkenli fonksiyonlardaki temel türev ve entegral kavramlarını geliştirmek ve bu konulardaki problemleri çözmekteki temel yöntemleri sunmaktadır. Ders gerçek yaşamdan gelen uygulamaları da tanıtmaya önem veren “içerikli yaklaşımla” tasarlanmıştır.\n\nBölümler\nBölüm 1: Genel Konular ve Düzlemdeki Vektörler\nBölüm 2: Uzayda Vektörler, Doğrular ve Düzlemler; Vektör Fonksiyonları\nBölüm 3: Düzlem Eğrilerinden Hatırlatmalar ve Uzay Eğrileri, İki Değişkenli ve İkinci Derece Fonksiyonlar ve Karşıt Gelen Yüzeyler\nBölüm 4: Özel Yapıdaki İki Değişkenli Olarak Karmaşık Fonksiyonlar, İki Değişkenli Fonksiyonlarda Kısmi Türev ve İki Katlı Entegralin Temel Tanımları; Limit Kavramının Gerekliliği ve Anlatımı\nBölüm 5: Türev Hesaplama Yöntemleri\nBölüm 6: Türev Uygulamaları\nBölüm 7: İki Katlı Entegraller ve Uygulamaları\n-----------\nThe course is the first of the sequence of calculus of multivariable functions. It develops the fundamental concepts of derivatives and integrals of functions of several variables, and the basic tools for doing the relevant calculations. The course is designed with a “content-based” approach, i. e. by solving examples, as many as possible from real life situations.\n\nChapters\nChapters 1: General Topics and Vectors in the Plane\nChapters 2: Vectors in Space, Lines and Planes; Vector Functions\nChapters 3: Reminders of Plane Curves and Space Curves, Quadratic Functions and Variables, Surfaces\nChapters 4: Special Two Variables Complex Functions, the Basic Definition of Partial Derivatives and Two Storey Integrals in Two Unknown Functions ; Necessity and Details of Limits\nChapters 5: Methods of Derivative Calculations\nChapters 6: Application of Derivatives\nChapters 7: Two Storey Integrals and Applications\n-----------\nKaynak: Attila Aşkar, “Çok değişkenli fonksiyonlarda türev ve entegral”. Bu kitap dört ciltlik dizinin ikinci cildidir. Dizinin diğer kitapları Cilt 1 “Tek değişkenli fonksiyonlarda türev ve entegral”, Cilt 3: “Doğrusal cebir” ve Cilt 4: “Diferansiyel denklemler” dir.\n\nSource: Attila Aşkar, Calculus of Multivariable Functions, Volume 2 of the set of Vol1: Calculus of Single Variable Functions, Volume 3: Linear Algebra and Volume 4: Differential Equations. All available online starting on January 6, 2014","tutor":"Attila Aşkar","provider":"Coursera","language":"Turkish","skills":["asia","turkey"],"subject":"Calculus","studentsInterested":"16","courseLink":"https://www.coursera.org/learn/hesap-calculus-dersi","classCentralLink":"https://www.class-central.com/course/coursera-cok-degiskenli-fonksiyon-i-kavramlar-multivariable-calculus-i-concepts-1412"},{"title":"Doğrusal Cebir II: Kare Matrisler, Hesaplama Yöntemleri ve Uygulamalar / Linear Algebra II: Square Matrices, Calculation Methods and Applications","about":"Doğrusal cebir ikili dizinin ikincisi olan bu ders birinci derste verilen temel bilgilerin üzerine eklemeler yapılarak tamamen matris işlemleri ve uygulamalarını kapsamaktadır. Cebirsel denklem sistemleri, sonuçların tekilliği ve var olup olmadığı, determinantlar ve onların doğal olarak nasıl oluştuğu, öz değer problemleri ve onların matris fonksiyonlarına uygulanışı vb. konulara derste değinilmektedir. Ders gerçek yaşamdan gelen uygulamaları da tanıtmaya önem veren “içerikli yaklaşımla” tasarlanmıştır.\n\nBölümler:\nBölüm 1: Doğrusal Cebir I\u0027in Özeti\nBölüm 2: Kare Matrislerde Determinant\nBölüm 3: Kare Matrislerin Tersi\nBölüm 4: Kare Matrislerde Özdeğer Sorunu\nBölüm 5: Matrislerin Köşegenleştirilmesi\nBölüm 6: Matris Fonksiyonları\nBölüm 7: Matrislerle Diferansiyel Denklem Takımları\n-----------\nThis second of the sequence of two courses builds on the fundamentals of the first course, is entirely on matrix algebra and applications. Specifically, the studies include systems of algebraic equations including the existence and uniqueness of solutions, determinants and how they arise naturally, eigenvalue problems with their applications to diagonalization and matrix functions. The course is designed in the same spirit as the first one with a “content based” emphasis, answering the “why” and “where“ of the topics, as much as the traditional “what” and “how” leading to “definitions” and “proofs”.\n\nChapters:\nChapter 1: Summary of Linear Algebra I\nChapter 2: Determinant\nChapter 3: Inverse of Square Matrices\nChapter 4: Eigenvalue Problem in Square Matrices\nChapter 5: Diagonalization of Matrices\nChapter 6: Matrix Functions\nChapter 7: Matrices and Systems of Differential Equations\n-----------\nKaynak: Attila Aşkar, “Doğrusal cebir”. Bu kitap dört ciltlik dizinin üçüncü cildidir. Dizinin diğer kitapları Cilt 1 “Tek değişkenli fonksiyonlarda türev ve entegral”, Cilt 2: \"Çok değişkenli fonksiyonlarda türev ve entegral\" ve Cilt 4: “Diferansiyel denklemler” dir.\n\nSource: Attila Aşkar, Linear Algebra, Volume 3 of the set of Vol1: Calculus of Single Variable Functions, Volume 2: Calculus of Multivariable Functions and Volume 4: Differential Equations.","tutor":"Attila Aşkar","provider":"Coursera","language":"Turkish","skills":["linear algebra","asia","computational methods","matrix algebra","turkey"],"subject":"Algebra \u0026 Geometry","studentsInterested":"10","courseLink":"https://www.coursera.org/learn/linearalgebra2","classCentralLink":"https://www.class-central.com/course/coursera-dogrusal-cebir-ii-kare-matrisler-hesaplama-yontemleri-ve-uygulamalar-linear-algebra-ii-square-matrices-calculation-methods-and-applications-5046"},{"title":"Business Applications of Hypothesis Testing and Confidence Interval Estimation","about":"Confidence intervals and Hypothesis tests are very important tools in the Business Statistics toolbox. A mastery over these topics will help enhance your business decision making and allow you to understand and measure the extent of ‘risk’ or ‘uncertainty’ in various business processes.\nThis is the third course in the specialization \"Business Statistics and Analysis\" and the course advances your knowledge about Business Statistics by introducing you to Confidence Intervals and Hypothesis Testing. We first conceptually understand these tools and their business application. We then introduce various calculations to constructing confidence intervals and to conduct different kinds of Hypothesis Tests. These are done by easy to understand applications.\n\nTo successfully complete course assignments, students must have access to a Windows version of Microsoft Excel 2010 or later. Please note that earlier versions of Microsoft Excel (2007 and earlier) will not be compatible to some Excel functions covered in this course.\n\n\nWEEK 1\nModule 1: Confidence Interval - Introduction\nIn this module you will get to conceptually understand what a confidence interval is and how is its constructed. We will introduce the various building blocks for the confidence interval such as the t-distribution, the t-statistic, the z-statistic and their various excel formulas. We will then use these building blocks to construct confidence intervals.\n\nTopics covered include:\n• Introducing the t-distribution, the T.DIST and T.INV excel functions\n• Conceptual understanding of a Confidence Interval\n• The z-statistic and the t-statistic\n• Constructing a Confidence Interval using z-statistic and t-statistic\n\n\nWEEK 2\nModule 2: Confidence Interval - Applications\nThis module presents various business applications of the confidence interval including an application where we use the confidence interval to calculate an appropriate sample size. We also introduce with an application, the confidence interval for a population proportion. Towards the close of module we start introducing the concept of Hypothesis Testing.\n\nTopics covered include:\n• Applications of Confidence Interval\n• Confidence Interval for a Population Proportion\n• Sample Size Calculation\n• Hypothesis Testing, An Introduction\n\n\nWEEK 3\nModule 3: Hypothesis Testing\nThis module introduces Hypothesis Testing. You get to understand the logic behind hypothesis tests. The four steps for conducting a hypothesis test are introduced and you get to apply them for hypothesis tests for a population mean as well as population proportion. You will understand the difference between single tail hypothesis tests and two tail hypothesis tests and also the Type I and Type II errors associated with hypothesis tests and ways to reduce such errors.\n\nTopics covered include:\n• The Logic of Hypothesis Testing\n• The Four Steps for conducting a Hypothesis Test\n• Single Tail and Two Tail Hypothesis Tests\n• Guidelines, Formulas and an Application of Hypothesis Test\n• Hypothesis Test for a Population Proportion\n• Type I and Type II Errors in a Hypothesis\n\n\nWEEK 4\nModule 4: Hypothesis Test - Differences in Mean\nIn this module, you\u0027ll apply Hypothesis Tests to test the difference between two different data, such hypothesis tests are called difference in means tests. We will introduce the three kinds of difference in means test and apply them to various business applications. We will also introduce the Excel dialog box to conduct such hypothesis tests.\n\nTopics covered include:\n• Introducing the Difference-In-Means Hypothesis Test\n• Applications of the Difference-In-Means Hypothesis Test\n• The Equal \u0026 Unequal Variance Assumption and the Paired t-test for difference in means.\n• Some more applications","tutor":"Sharad Borle","provider":"Coursera","language":"English","skills":["usa","north america","new-moocs-2017"],"subject":"Statistics \u0026 Probability","studentsInterested":"45","courseLink":"https://www.coursera.org/learn/hypothesis-testing-confidence-intervals","classCentralLink":"https://www.class-central.com/course/coursera-business-applications-of-hypothesis-testing-and-confidence-interval-estimation-7035"},{"title":"Математические методы в психологии. Основы применения (Mathematical Methods in Psychology: Basics of Applying)","about":"Курс направлен на овладение статистическими методами и моделями, необходимыми для самостоятельного анализа данных количественных исследований в психологии и смежных областях, на формирование умений пользоваться простыми методами анализа данных, правильно выбирать и интерпретировать результаты применения сложных технологий анализа данных, на развитие навыков корректной интерпретации измерений и результатов их статистического анализа.\n\nПо завершении курса учащиеся будут:\nЗнать систему математических моделей исследования – измерительных, описательных и статистического вывода; систему многомерных математических методов и моделей анализа данных; назначение каждого элемента этих систем с точки зрения границ его применения и интерпретации результатов.\nУметь планировать исследование с учетом возможностей измерений и анализа количественных результатов; применять на практике одномерные и двумерные методы анализа данных; правильно выбирать адекватный эмпирическим данным и задачам исследования многомерный метод анализа и исчерпывающе интерпретировать результаты его применения;\nВладеть системой статистических понятий, статистическим дискурсом, как необходимой составной частью методологического дискурса психологии и смежных дисциплин.","tutor":"Наследов Андрей Дмитриевич and Волков Денис Николаевич","provider":"Coursera","language":"Russian","skills":["psychology","statistics","data analysis","quantitative methods","new-moocs-2017"],"subject":"Statistics \u0026 Probability","studentsInterested":"16","courseLink":"https://www.coursera.org/learn/matematicheskiye-metody-v-psikhologii","classCentralLink":"https://www.class-central.com/course/coursera-------mathematical-methods-in-psychology-basics-of-applying-9593"},{"title":"Improving your statistical inferences","about":"This course aims to help you to draw better statistical inferences from empirical research. First, we will discuss how to correctly interpret p-values, effect sizes, confidence intervals, Bayes Factors, and likelihood ratios, and how these statistics answer different questions you might be interested in. Then, you will learn how to design experiments where the false positive rate is controlled, and how to decide upon the sample size for your study, for example in order to achieve high statistical power. Subsequently, you will learn how to interpret evidence in the scientific literature given widespread publication bias, for example by learning about p-curve analysis. Finally, we will talk about how to do philosophy of science, theory construction, and cumulative science, including how to perform replication studies, why and how to pre-register your experiment, and how to share your results following Open Science principles.\n\nIn practical, hands on assignments, you will learn how to simulate t-tests to learn which p-values you can expect, calculate likelihood ratio\u0027s and get an introduction the binomial Bayesian statistics, and learn about the positive predictive value which expresses the probability published research findings are true. We will experience the problems with optional stopping and learn how to prevent these problems by using sequential analyses. You will calculate effect sizes, see how confidence intervals work through simulations, and practice doing a-priori power analyses. Finally, you will learn how to examine whether the null hypothesis is true using equivalence testing and Bayesian statistics, and how to pre-register a study, and share your data on the Open Science Framework.\n\nAll videos now have Chinese subtitles. More than 10.000 learners have enrolled so far!","tutor":"Daniel Lakens","provider":"Coursera","language":"English","skills":["europe","netherlands"],"subject":"Statistics \u0026 Probability","studentsInterested":"1.3k","courseLink":"https://www.coursera.org/learn/statistical-inferences","classCentralLink":"https://www.class-central.com/course/coursera-improving-your-statistical-inferences-7353"},{"title":"Delivery Problem","about":"We’ll implement (in Python) together efficient programs for a problem needed by delivery companies all over the world millions times per day — the travelling salesman problem. The goal in this problem is to visit all the given places as quickly as possible. How to find an optimal solution to this problem quickly? We still don’t have provably efficient algorithms for this difficult computational problem and this is the essence of the P versus NP problem, the most important open question in Computer Science. Still, we’ll implement several solutions for real world instances of the travelling salesman problem. While designing these solutions, we will rely heavily on the material learned in the courses of the specialization: proof techniques, combinatorics, probability, graph theory. We’ll see several examples of using discrete mathematics ideas to get more and more efficient solutions.","tutor":"Alexander S. Kulikov","provider":"Coursera","language":"English","skills":["delivery problems","traveling salesman","new-moocs-2017"],"subject":"Mathematics","studentsInterested":"22","courseLink":"https://www.coursera.org/learn/delivery-problem","classCentralLink":"https://www.class-central.com/course/coursera-delivery-problem-9211"},{"title":"Math behind Moneyball","about":"Learn how probability, math, and statistics can be used to help baseball, football and basketball teams improve, player and lineup selection as well as in game strategy.","tutor":"Wayne Winston","provider":"Coursera","language":"English","skills":["moneyball","sports statistics","sports analytics","usa","north america"],"subject":"Statistics \u0026 Probability","studentsInterested":"224","courseLink":"https://www.coursera.org/learn/mathematics-sport","classCentralLink":"https://www.class-central.com/course/coursera-math-behind-moneyball-4421"},{"title":"Methods and Statistics in Social Science - Final Research Project","about":"The Final Research Project consists of a research study that you will perform in collaboration with fellow learners. Together you will formulate a research hypothesis and design, come up with operationalizations, create manipulation and measurement instruments, collect data, perform statistical analyses and document the results.\n\nIn this course you will go through the entire research process and will be able to help determine what research question we will investigate and how we design and perform the research. This is an invaluable experience if you want to be able to critically evaluate scientific research in the social and behavioral sciences or design and perform your own studies in the future.","tutor":"Annemarie Zand Scholten","provider":"Coursera","language":"English","skills":["social science","statistics","europe","capstone","research","netherlands"],"subject":"Statistics \u0026 Probability","studentsInterested":"26","courseLink":"https://www.coursera.org/learn/social-science-capstone","classCentralLink":"https://www.class-central.com/course/coursera-methods-and-statistics-in-social-science-final-research-project-5121"},{"title":"頑想學概率：機率一","about":"這是一個機率的入門課程，著重的是教授機率基本概念。課程內容和作業都使用生活化的例子，希望讓同學們快樂學習、快速培養同學們對於機率的洞察力與應用能力。","tutor":"葉丙成 Ping-Cheng Yeh (Benson)","provider":"Coursera","language":"Chinese","skills":["asia","taiwan","new-moocs-2017"],"subject":"Statistics \u0026 Probability","studentsInterested":"7","courseLink":"https://www.coursera.org/learn/prob1","classCentralLink":"https://www.class-central.com/course/coursera---7800"},{"title":"Linear Regression and Modeling","about":"This course introduces simple and multiple linear regression models. These models allow you to assess the relationship between variables in a data set and a continuous response variable. Is there a relationship between the physical attractiveness of a professor and their student evaluation scores? Can we predict the test score for a child based on certain characteristics of his or her mother? In this course, you will learn the fundamental theory behind linear regression and, through data examples, learn to fit, examine, and utilize regression models to examine relationships between multiple variables, using the free statistical software R and RStudio.","tutor":"Mine Çetinkaya-Rundel","provider":"Coursera","language":"English","skills":["statistics","regression models","usa","north america"],"subject":"Statistics \u0026 Probability","studentsInterested":"219","courseLink":"https://www.coursera.org/learn/linear-regression-model","classCentralLink":"https://www.class-central.com/course/coursera-linear-regression-and-modeling-6098"},{"title":"Introduction to Enumerative Combinatorics","about":"Enumerative combinatorics deals with finite sets and their cardinalities. In other words, a typical problem of enumerative combinatorics is to find the number of ways a certain pattern can be formed.\n\nIn the first part of our course we will be dealing with elementary combinatorial objects and notions: permutations, combinations, compositions, Fibonacci and Catalan numbers etc. In the second part of the course we introduce the notion of generating functions and use it to study recurrence relations and partition numbers.\n\nThe course is mostly self-contained. However, some acquaintance with basic linear algebra and analysis (including Taylor series expansion) may be very helpful.","tutor":"Evgeny Smirnov","provider":"Coursera","language":"English","skills":["russia","new-moocs-2017"],"subject":"Statistics \u0026 Probability","studentsInterested":"135","courseLink":"https://www.coursera.org/learn/enumerative-combinatorics","classCentralLink":"https://www.class-central.com/course/coursera-introduction-to-enumerative-combinatorics-7774"},{"title":"Mathematical Foundations for Cryptography","about":"Welcome to Course 2 of Introduction to Applied Cryptography. In this course, you will be introduced to basic mathematical principles and functions that form the foundation for cryptographic and cryptanalysis methods. These principles and functions will be helpful in understanding symmetric and asymmetric cryptographic methods examined in Course 3 and Course 4. These topics should prove especially useful to you if you are new to cybersecurity. It is recommended that you have a basic knowledge of computer science and basic math skills such as algebra and probability.","tutor":"William Bahn, Richard White and Sang-Yoon Chang","provider":"Coursera","language":"English","skills":["mathematics","cryptography","new-moocs-2017"],"subject":"Mathematics","studentsInterested":"51","courseLink":"https://www.coursera.org/learn/mathematical-foundations-cryptography","classCentralLink":"https://www.class-central.com/course/coursera-mathematical-foundations-for-cryptography-9535"},{"title":"Structural Equation Model and its Applications | 结构方程模型及其应用 (普通话)","about":"在社会学、心理学、教育学、经济学、管理学、市场学等研究领域的数据分析中，结构方程建模是当前最前沿的统计方法中应用最广、研究最多的一个。它包含了方差分析、回归分析、路径分析和因子分析，弥补了传统回归分析和因子分析的不足，可以分析多因多果的联系、潜变量的关系，还可以处理多水平数据和纵向数据，是非常重要的多元数据分析工具。本课程系统地介绍结构方程模型和LISREL软件的应用，内容包括：结构方程分析（包括验证性因子分析）的基本概念、统计原理、在社会科学研究中的应用、常用模型及其LISREL程序、结果的解释和模型评价。学员应具备基本的统计知识（如：标准差、t-检验、相关系数），理解回归分析和因子分析的概念。 注：本课程配套教材为《结构方程模型及其应用》（以LISREL软件为例）。","tutor":"Kit Tai Hau","provider":"Coursera","language":"Chinese","skills":["statistics","asia","hong kong","structural equation model","putonghua"],"subject":"Statistics \u0026 Probability","studentsInterested":"16","courseLink":"https://www.coursera.org/learn/jiegou-fangcheng-moxing","classCentralLink":"https://www.class-central.com/course/coursera-structural-equation-model-and-its-applications---696"},{"title":"Introduction to Probability and Data","about":"This course introduces you to sampling and exploring data, as well as basic probability theory and Bayes\u0027 rule. You will examine various types of sampling methods, and discuss how such methods can impact the scope of inference. A variety of exploratory data analysis techniques will be covered, including numeric summary statistics and basic data visualization. You will be guided through installing and using R and RStudio (free statistical software), and will use this software for lab exercises and a final project. The concepts and techniques in this course will serve as building blocks for the inference and modeling courses in the Specialization.","tutor":"Mine Çetinkaya-Rundel","provider":"Coursera","language":"English","skills":["probability","usa","north america"],"subject":"Statistics \u0026 Probability","studentsInterested":"305","courseLink":"https://www.coursera.org/learn/probability-intro","classCentralLink":"https://www.class-central.com/course/coursera-introduction-to-probability-and-data-6099"},{"title":"A Crash Course in Causality: Inferring Causal Effects from Observational Data","about":"We have all heard the phrase “correlation does not equal causation.” What, then, does equal causation? This course aims to answer that question and more!\n\nOver a period of 5 weeks, you will learn how causal effects are defined, what assumptions about your data and models are necessary, and how to implement and interpret some popular statistical methods. Learners will have the opportunity to apply these methods to example data in R (free statistical software environment).\n\nAt the end of the course, learners should be able to:\n1. Define causal effects using potential outcomes\n2. Describe the difference between association and causation\n3. Express assumptions with causal graphs\n4. Implement several types of causal inference methods (e.g. matching, instrumental variables, inverse probability of treatment weighting)\n5. Identify which causal assumptions are necessary for each type of statistical method\n\nSo join us.... and discover for yourself why modern statistical methods for estimating causal effects are indispensable in so many fields of study!","tutor":"Jason A. Roy, Ph.D.","provider":"Coursera","language":"English","skills":["new-moocs-2017"],"subject":"Statistics \u0026 Probability","studentsInterested":"84","courseLink":"https://www.coursera.org/learn/crash-course-in-causality","classCentralLink":"https://www.class-central.com/course/coursera-a-crash-course-in-causality-inferring-causal-effects-from-observational-data-8425"},{"title":"Inferential Statistics","about":"Inferential statistics are concerned with making inferences based on relations found in the sample, to relations in the population. Inferential statistics help us decide, for example, whether the differences between groups that we see in our data are strong enough to provide support for our hypothesis that group differences exist in general, in the entire population.\n\nWe will start by considering the basic principles of significance testing: the sampling and test statistic distribution, p-value, significance level, power and type I and type II errors. Then we will consider a large number of statistical tests and techniques that help us make inferences for different types of data and different types of research designs. For each individual statistical test we will consider how it works, for what data and design it is appropriate and how results should be interpreted. You will also learn how to perform these tests using freely available software.\n\nFor those who are already familiar with statistical testing: We will look at z-tests for 1 and 2 proportions, McNemar\u0027s test for dependent proportions, t-tests for 1 mean (paired differences) and 2 means, the Chi-square test for independence, Fisher’s exact test, simple regression (linear and exponential) and multiple regression (linear and logistic), one way and factorial analysis of variance, and non-parametric tests (Wilcoxon, Kruskal-Wallis, sign test, signed-rank test, runs test).","tutor":"Emiel van Loon and Annemarie Zand Scholten","provider":"Coursera","language":"English","skills":["statistics","europe","netherlands"],"subject":"Statistics \u0026 Probability","studentsInterested":"405","courseLink":"https://www.coursera.org/learn/inferential-statistics-intro","classCentralLink":"https://www.class-central.com/course/coursera-inferential-statistics-2757"},{"title":"离散数学概论 Discrete Mathematics Generality","about":"离散数学是计算机科学的基础理论，离散结构的基础知识和逻辑思维的形式化是信息技术类学生的基本功，离散数学的基本概念是理科专业学生进行信息类课程学习的重要基础。\n\n本课程介绍计算机科学和信息技术理论基础的概念和思想方法，介绍数理逻辑、集合论、图论、抽象代数和形式语言与自动机等各部分的基本概念，介绍离散数学基本概念和空间信息技术之间的联系与结合，培养学生理解和掌握离散数学基本概念，采用形式化方法分析问题，并能自觉运用逻辑分析、结构层次分析和同构类比等思想方法解决问题的能力。","tutor":"斌 陈","provider":"Coursera","language":"Chinese","skills":["china","asia","logic","discrete mathematics","automata"],"subject":"Mathematics","studentsInterested":"27","courseLink":"https://www.coursera.org/learn/dmathgen","classCentralLink":"https://www.class-central.com/course/coursera--discrete-mathematics-generality-4431"},{"title":"Introduction to Complex Analysis","about":"This course provides an introduction to complex analysis which is the theory of complex functions of a complex variable. We will start by introducing the complex plane, along with the algebra and geometry of complex numbers, and then we will make our way via differentiation, integration, complex dynamics, power series representation and Laurent series into territories at the edge of what is known today. Each module consists of five video lectures with embedded quizzes, followed by an electronically graded homework assignment. Additionally, modules 1, 3, and 5 also contain a peer assessment.\n\nThe homework assignments will require time to think through and practice the concepts discussed in the lectures. In fact, a significant amount of your learning will happen while completing the homework assignments. These assignments are not meant to be completed quickly; rather you\u0027ll need paper and pen with you to work through the questions. In total, we expect that the course will take 6-12 hours of work per module, depending on your background.","tutor":"Dr. Petra Bonfert-Taylor","provider":"Coursera","language":"English","skills":["usa","north america"],"subject":"Mathematics","studentsInterested":"1.3k","courseLink":"https://www.coursera.org/learn/complex-analysis","classCentralLink":"https://www.class-central.com/course/coursera-introduction-to-complex-analysis-6418"},{"title":"Estadística aplicada a los negocios","about":"La toma de decisiones está en la esencia de los negocios. Gerenciar es tomar decisiones, muchas veces bajo presión, con información desordenada y en un contexto de incertidumbre. Un aspecto básico es entender y analizar la información, organizar los datos de forma de facilitar su posterior uso y la toma de decisiones. Si bien hay muchas otras dimensiones que entran en juego, el primer paso es formular bien el problema, estructurarlo y procesar la información. En este sentido, el principal objetivo de este curso es ayudarlo a ser un mejor tomador de decisiones a través de herramientas técnicas.\nA lo largo de este curso el alumno desarrollará habilidades cuantitativas para la toma de decisiones, a través del aprendizaje de métodos estadísticos con aplicaciones a los negocios en Excel. El foco está en la comprensión y en el uso de herramientas básicas de análisis e inferencia estadística tratando de que el alumno sea un usuario de estos métodos, comprenda en qué consisten, cuál es la intuición, su uso y aplicaciones.","tutor":"Magdalena Cornejo","provider":"Coursera","language":"Spanish","skills":["argentina","south america"],"subject":"Statistics \u0026 Probability","studentsInterested":"42","courseLink":"https://www.coursera.org/learn/estadistica-aplicada-negocios","classCentralLink":"https://www.class-central.com/course/coursera-estadistica-aplicada-a-los-negocios-7079"},{"title":"Number Theory and Cryptography","about":"We all learn numbers from the childhood. Some of us like to count, others hate it, but any person uses numbers everyday to buy things, pay for services, estimated time and necessary resources. People have been wondering about numbers’ properties for thousands of years. And for thousands of years it was more or less just a game that was only interesting for pure mathematicians. Famous 20th century mathematician G.H. Hardy once said “The Theory of Numbers has always been regarded as one of the most obviously useless branches of Pure Mathematics”. Just 30 years after his death, an algorithm for encryption of secret messages was developed using achievements of number theory. It was called RSA after the names of its authors, and its implementation is probably the most frequently used computer program in the word nowadays. Without it, nobody would be able to make secure payments over the internet, or even log in securely to e-mail and other personal services. In this short course, we will make the whole journey from the foundation to RSA in 4 weeks. By the end, you will be able to apply the basics of the number theory to encrypt and decrypt messages, and to break the code if one applies RSA carelessly. You will even pass a cryptographic quest!\n\nAs prerequisites we assume only basic math (e.g., we expect you to know what is a square or how to add fractions), basic programming in python (functions, loops, recursion), common sense and curiosity. Our intended audience are all people that work or plan to work in IT, starting from motivated high school students.","tutor":"Alexander S. Kulikov, Michael Levin and Vladimir Podolskii","provider":"Coursera","language":"English","skills":["cryptography","number theory","new-moocs-2017"],"subject":"Mathematics","studentsInterested":"87","courseLink":"https://www.coursera.org/learn/number-theory-cryptography","classCentralLink":"https://www.class-central.com/course/coursera-number-theory-and-cryptography-9210"},{"title":"Invitation to Mathematics הזמנה למתמטיקה","about":"קורס זה עוסק במתמטיקה של בית ספר תיכון מנקודת מבט מתקדמת. מטרתו העיקרית היא לחשוף סטודנטים לעתיד לאופן שבו מתמטיקאים רואים מקצוע זה, ובכך להכין אותם ללימודי מתמטיקה ברמת אוניברסיטה.","tutor":"Raz Kupferman, Itamar Cwik and Ehud de Shalit","provider":"Coursera","language":"Hebrew","skills":["asia","israel"],"subject":"Foundations of Mathematics","studentsInterested":"63","courseLink":"https://www.coursera.org/learn/introduction-to-math","classCentralLink":"https://www.class-central.com/course/coursera-invitation-to-mathematics---1938"},{"title":"Álgebra Básica","about":"Galileo dijo: \"El Universo está escrito en lenguaje matemático y los caracteres son triángulos, círculos y otras figuras geométricas, sin las que es humanamente imposible entender una sola palabra\".\nPara entender el Universo, es necesario plantear leyes que expliquen su comportamiento, como pueden ser las leyes de la gravedad, la propagación del calor, el electromagnetismo, la reproducción celular, el crecimiento poblacional, la propagación de las enfermedades, la variación de los precios de las acciones en la bolsa de valores, el comportamiento de las masas ante un conflicto, etcétera.\nTodas estas leyes se plantean utilizando ecuaciones, algunas muy sencillas, otras no tanto. Para poder aplicar estas ecuaciones para resolver problemas, es necesario manipularlas siguiendo ciertas reglas que nos da el álgebra.\nPiensa en el álgebra como la gramática, que nos dice cómo traducir nuestras ideas al lenguaje, cómo formar frases y oraciones a partir de palabras, cómo conjugar verbos, a identificar las partes de una oración, las reglas de acentuación, etcétera.\nEn este curso aprenderás a construir expresiones algebraicas a partir de frases, lo que te permitirá resolver problemas en los que conoces algunos datos numéricos y necesitas encontrar otros.\nPodrás plantear y resolver ecuaciones de primer grado, ecuaciones simultáneas y ecuaciones de segundo grado.\nEste curso te va a ser muy útil si actualmente estas llevando un curso de álgebra en la escuela y tienes problemas con él. También si ya has estudiado álgebra y necesitas repasarla, ya que necesitas recordarla para tener éxito en otros cursos más avanzados, como Geometría Analítica, Cálculo o Estadística.","tutor":"Elena de Oteyza, Carlos Hernández and Emma Lam","provider":"Coursera","language":"Spanish","skills":["basic algebra","mexico","north america"],"subject":"Algebra \u0026 Geometry","studentsInterested":"98","courseLink":"https://www.coursera.org/learn/algebra-basica","classCentralLink":"https://www.class-central.com/course/coursera-algebra-basica-4653"},{"title":"Introduction to Ordinary Differential Equations","about":"In this introductory course on Ordinary Differential Equations, we first provide basic terminologies on the theory of differential equations and then proceed to methods of solving various types of ordinary differential equations. We handle first order differential equations and then second order linear differential equations. We also discuss some related concrete mathematical modeling problems, which can be handled by the methods introduced in this course.\n\nThe lecture is self contained. However, if necessary, you may consult any introductory level text\non ordinary differential equations. For example, \"Elementary Differential Equations and Boundary Value Problems\nby W. E. Boyce and R. C. DiPrima from John Wiley \u0026 Sons\" is a good source for further study on the subject.\n\nThe course is mainly delivered through video lectures. At the end of each module, there will be a quiz consisting of several problems related to the lecture of the week.","tutor":"Kwon, Kil Hyun","provider":"Coursera","language":"English","skills":["differential equations"],"subject":"Mathematics","studentsInterested":"144","courseLink":"https://www.coursera.org/learn/ordinary-differential-equations","classCentralLink":"https://www.class-central.com/course/coursera-introduction-to-ordinary-differential-equations-9736"},{"title":"Statistical Reasoning for Public Health 2: Regression Methods","about":"A practical and example filled tour of simple and multiple regression techniques (linear, logistic, and Cox PH) for estimation, adjustment and prediction.","tutor":"John McGready","provider":"Coursera","language":"English","skills":["usa","north america"],"subject":"Statistics \u0026 Probability","studentsInterested":"1.3k","courseLink":"https://www.coursera.org/learn/statistical-reasoning-2","classCentralLink":"https://www.class-central.com/course/coursera-statistical-reasoning-for-public-health-2-regression-methods-2899"},{"title":"Геометрия и группы","about":"Как правило, школьные и университетские программы по математике сильно смещают акцент в сторону формально-алгебраических выкладок и аналитических навыков. С нашей точки зрения, не менее важным является (ровно столь же важным!) является понимание сути математики - то есть её геометрического воплощения. И в первую очередь это изучение свойств фигур, инвариантных относительно действия некоторой группы преобразований.\n\nВ нашем курсе вы узнаете всё про движения прямой, плоскости, окружности, сферы, будем проецировать, отражать, растягивать/сжимать, и вращать, разберемся с геометрическим описанием комплексных чисел и кватернионов, а также пройдём начала топологии. Мы поймём, чем отличается отрезок от окружности и сфера от бублика.\n\nКурс создан при поддержке Университета Дмитрия Пожарского, который готовит высококвалифицированных исследователей в ключевых областях знания и сферах человеческой деятельности. Приоритетом деятельности университета является восстановление ценности классического фундаментального образования, науки и практики в России.\n\nПреподаватель курса — Алексей Владимирович Савватеев, ректор Университета Дмитрия Пожарского, доктор физико-математических наук, профессор Московского физико-технического института, ведущий научный сотрудник Центрального экономико-математического института РАН.\n\nwww.usdp.ru","tutor":"Савватеев Алексей Владимирович","provider":"Coursera","language":"Russian","skills":["geometry","new-moocs-2017"],"subject":"Algebra \u0026 Geometry","studentsInterested":"7","courseLink":"https://www.coursera.org/learn/geometriya-i-gruppy","classCentralLink":"https://www.class-central.com/course/coursera----8828"},{"title":"Cálculo Diferencial e Integral unidos por el Teorema Fundamental del Cálculo","about":"Los cursos de Cálculo Diferencial y Cálculo Integral tradicionalmente se ofrecen separados y respetando ese orden. El primero estudia la derivada, y el segundo, la integral, siendo este momento en el que aparece el Teorema Fundamental del Cálculo (TFC) para establecer la relación entre ambos conceptos. En el presente curso vamos a hacer una diferencia: introduciremos la derivada y la integral como conceptos relacionados desde un principio.\n\nVamos a iniciar con la interpretación del Teorema Fundamental del Cálculo, con esto nos referimos a descubrir su significado real en la solución de problemas. Llegaremos a asociar con él la actividad práctica de calcular el valor de una magnitud que está cambiando. Habiendo realizado esta interpretación, los conceptos de derivada e integral se verán relacionados desde un principio, lo que te permitirá predecir el valor de una magnitud que está cambiando. Las nociones fundamentales de derivada e integral las identificaremos con las ideas de “razón de cambio” y de “acumulación del cambio”, y el TFC nos proveerá de la estrategia de solución.\n\nRecordarás que la Matemática Elemental incluye el Álgebra, la Geometría y la Geometría Analítica. Podemos decir que éstas son Matemáticas que estudian lo estático. En cambio, la Matemática Superior, que incluye el Cálculo, estudia lo dinámico. Con el Cálculo se inicia el estudio del cambio, una realidad presente en nuestro entorno cotidiano sin duda alguna. Costos, temperaturas, poblaciones, velocidades, energías, capitales de inversión, longitudes, etc., son algunos ejemplos de esto. En este curso podrás entender al Cálculo como una estrategia de solución para el estudio del cambio y diferenciarlo de las Matemáticas Elementales, aunque utilice de ellas bastante información.\n\nAl finalizar este curso podrás:\n\nDescribir de qué manera los modelos matemáticos polinomial, exponencial natural, y trigonométricos (seno y coseno), son una construcción que responde a esta práctica de predicción. Los verás a todos ellos surgir de esta práctica cuando una magnitud real particular cumple ciertas condiciones en su “razón de cambio” con respecto a la magnitud de la que depende.\n\nUtilizar la introducción de procesos infinitos (¡no imposibles!) en la construcción de la respuesta de predicción, con ello entenderás por qué se habla de Matemática Superior y de un pensamiento matemático avanzado.\n\nValorar una forma de pensar diferente, donde nuestro razonamiento matemático trascienda la sola manipulación de fórmulas algebraicas.","tutor":"Dra. Patricia Salinas Martínez","provider":"Coursera","language":"Spanish","skills":["mexico","north america"],"subject":"Calculus","studentsInterested":"27","courseLink":"https://www.coursera.org/learn/calculo-diferencial","classCentralLink":"https://www.class-central.com/course/coursera-calculo-diferencial-e-integral-unidos-por-el-teorema-fundamental-del-calculo-4884"},{"title":"Introduction to Galois Theory","about":"A very beautiful classical theory on field extensions of a certain type (Galois extensions) initiated by Galois in the 19th century. Explains, in particular, why it is not possible to solve an equation of degree 5 or more in the same way as we solve quadratic or cubic equations. You will learn to compute Galois groups and (before that) study the properties of various field extensions.\n\nWe first shall survey the basic notions and properties of field extensions: algebraic, transcendental, finite field extensions, degree of an extension, algebraic closure, decomposition field of a polynomial.\nThen we shall do a bit of commutative algebra (finite algebras over a field, base change via tensor product) and apply this to study the notion of separability in some detail.\nAfter that we shall discuss Galois extensions and Galois correspondence and give many examples (cyclotomic extensions, finite fields, Kummer extensions, Artin-Schreier extensions, etc.).\nWe shall address the question of solvability of equations by radicals (Abel theorem). We shall also try to explain the relation to representations and to topological coverings.\nFinally, we shall briefly discuss extensions of rings (integral elemets, norms, traces, etc.) and explain how to use the reduction modulo primes to compute Galois groups.\n\nPREREQUISITES\nA first course in general algebra — groups, rings, fields, modules, ideals. Some knowledge of commutative algebra (prime and maximal ideals — first few pages of any book in commutative algebra) is welcome. For exercises we also shall need some elementary facts about groups and their actions on sets, groups of permutations and, marginally,\nthe statement of Sylow\u0027s theorems.\n\nASSESSMENTS\nA weekly test and two more serious exams in the middle and in the end of the course. For the final result, tests count approximately 30%, first (shorter) exam 30%, final exam 40%.\n\nThere will be two non-graded exercise lists (in replacement of the non-existent exercise classes...)","tutor":"Ekaterina Amerik","provider":"Coursera","language":"English","skills":["russia","galois theory","galois groups","commutative algebra"],"subject":"Algebra \u0026 Geometry","studentsInterested":"73","courseLink":"https://www.coursera.org/learn/galois","classCentralLink":"https://www.class-central.com/course/coursera-introduction-to-galois-theory-5382"},{"title":"Jacobi modular forms: 30 ans après","about":"This is a master course given in Moscow at the Laboratory of Algebraic Geometry of the National Research University Higher School of Economics by Valery Gritsenko, a professor of University Lille 1, France.\nJacobi forms are holomorphic functions in two complex variables. They are modular in one variable and abelian (or double periodic) in another variable. The theory of Jacobi modular forms became an independent research subject after the famous book of Martin Eichler and Don Zagier “Jacobi modular forms” (Progress in Mathematics, vol. 55, 1985) which was cited more than a thousand times in research papers. This is due to many applications of Jacobi forms in arithmetic, topology, algebraic and differential geometry, mathematical and theoretical physics, in the theory of Lie algebras, etc. The list of mentioned subjects shows that my course might be useful for master and Ph.D. students working in different directions.\nMotivated undergraduate students can also study this subject. To follow the course one has to know only elementary basic facts from the theory of modular forms (for example, the paragraphs 1-4 of the chapter VII of Serre’s “A Course in Arithmetic” are enough).\nThe main hero of the course is the Jacobi theta-series. Using it we will construct a lot of concrete examples of Jacobi forms in one or many abelian variables, in particular, Jacobi forms for root systems.\nFor some of you, who will be successful with the theoretical exercises of the course, I am ready to formulate research problems for Master or Ph.D. thesis. (Ph.D. support might be available at CEMPI in Lille or at the Faculty of Mathematics of National Research University Higher School of Economics in Moscow)","tutor":"Valery Gritsenko","provider":"Coursera","language":"English","skills":["mathematics","russia","algebraic geometry"],"subject":"Algebra \u0026 Geometry","studentsInterested":"8","courseLink":"https://www.coursera.org/learn/modular-forms-jacobi","classCentralLink":"https://www.class-central.com/course/coursera-jacobi-modular-forms-30-ans-apres-6626"},{"title":"Precalculus: the Mathematics of Numbers, Functions and Equations","about":"Get an introduction to precalculus fundamentals\nThis course is the first of two precalculus courses from the University of Padova, providing you with an introduction to the fundamental mathematical skills required to complete a first course in calculus.\nYou’ll get familiar with the basic precalculus required for college or undergraduate-level studies, notably: factoring and division; sets and set operations; reasoning and proofs; functions and graphs; and equations and inequalities.\nThrough this course you’ll gain the foundation to support further mathematical studies, or improve your use of mathematics in everyday life.\nThis course is for anyone who wants to brush up on their basic mathematical skills, particularly students in the last year of high school, or at the beginning of undergraduate studies, who intend to take a first course in calculus.","tutor":"Francis Clarke","provider":"FutureLearn","language":"English","skills":["pre-calculus","new-moocs-2017"],"subject":"Calculus","studentsInterested":"204","courseLink":"https://www.futurelearn.com/courses/precalculus","classCentralLink":"https://www.class-central.com/course/futurelearn-precalculus-the-mathematics-of-numbers-functions-and-equations-8988"},{"title":"Introduction à la théorie de Galois","about":"Le cours expose la théorie de Galois, du classique critère de non-résolubilité des équations polynomiales aux méthodes plus avancées de calcul de groupes de Galois par réduction modulo un nombre premier.\n\nLe thème général de cette théorie est l\u0027étude des racines d\u0027un polynôme et concerne en particulier la possibilité de les exprimer à partir des coefficients de ce polynôme. Evariste Galois considère les symétries de ces racines et associe ainsi à ce polynôme un groupe de permutations de ses racines, que l\u0027on appelle maintenant son groupe de Galois. Il dégage à cette occasion pour la première fois, dans ce cadre, la notion de groupe, maintenant omniprésente en mathématiques. Son étude lui permet d\u0027expliquer pourquoi les racines d\u0027une équation prise au hasard ne s\u0027expriment en général pas par des formules algébriques faisant intervenir ses coefficients à partir du degré 5, un résultat démontré auparavant par Abel. Plus généralement, l\u0027étude du groupe de Galois du polynôme permet de dire exactement quand une telle formule existe. C\u0027est ce que l\u0027on appelle la correspondance de Galois : elle relie d\u0027une part la théorie des corps, d\u0027autre part la théorie des groupes.Ce cours expliquera cette théorie en n\u0027utilisant que des résultats de base d\u0027algèbre linéaire. Nous étudierons d\u0027un côté la théorie des corps, c\u0027est-à-dire la façon dont les corps s\u0027emboîtent les uns dans les autres, en introduisant la notion de nombre algébrique (essentiellement les racines de polynômes). D\u0027un autre côté, nous introduirons les éléments nécessaires à l\u0027étude des groupes de permutations. Cela nous permettra d\u0027expliquer la théorie de Galois, non seulement dans son cadre d\u0027origine, c\u0027est-à-dire quand les coefficients du polynôme sont des nombres entiers, mais aussi dans un cadre plus général, par exemple lorsqu\u0027on réduit ces coefficients modulo un nombre premier p.\n\nLe cours culminera avec une comparaison des groupes de Galois dans ces deux situations (« entière » et après réduction modulo p), fournissant ainsi un outil de calcul puissant de ces groupes.\n\nCe cours est l\u0027occasion d\u0027aborder des notions d\u0027algèbre variées, essentielles dans de nombreux domaines des mathématiques, de manière très simple pour très rapidement aboutir à des résultats tout à fait remarquables. Nous n\u0027avons pas cherché la généralité maximale mais au contraire à aller rapidement à l\u0027essentiel en utilisant le minimum de formalisme abstrait. Le FLOTeur intéressé sera alors armé pour aller plus loin, notamment grâce à la bibliographie ou à des cours plus avancés.","tutor":"Olivier Debarre and Yves Laszlo","provider":"Coursera","language":"French","skills":["europe","france"],"subject":"Algebra \u0026 Geometry","studentsInterested":"41","courseLink":"https://www.coursera.org/learn/theorie-de-galois","classCentralLink":"https://www.class-central.com/course/coursera-introduction-a-la-theorie-de-galois-1298"},{"title":"Теория графов","about":"Среди жителей Кёнигсберга была распространена такая практическая головоломка: можно ли пройти по всем мостам через реку Преголя, не проходя ни по одному из них дважды? В 1736 году выдающийся математик Леонард Эйлер заинтересовался задачей и в письме другу привел строгое доказательство того, что сделать это невозможно. В том же году он доказал замечательную формулу, которая связывает число вершин, граней и ребер многогранника в трехмерном пространстве. Формула таинственным образом верна и для графов, которые называются \"планарными\". Эти два результата заложили основу теории графов и неплохо иллюстрируют направление ее развития по сей день.\n\nГраф как математический объект оказался полезным во многих теоретических и практических задачах. Наверное, дело в том, что сложность его структуры хорошо отвечает возможностям нашего мозга: это структура наглядная и понятно устроенная, но, с другой стороны, достаточно богатая, чтобы улавливать многие нетривиальные явления. Если говорить о приложениях, то, конечно, сразу же на ум приходят большие сети: Интернет, карта дорог, покрытие мобильной связи и т.п. В основах поисковых машин, таких, как Yandex и Google, лежат алгоритмы на графах. Помимо computer science, графы активно используются в биоинформатике, химии, социологии.\n\nЭтот курс служит введением в современную теорию графов. Мы, конечно, обсудим классические задачи, но и поговорим про более недавние результаты и тенденции, например, про экстремальную теорию графов.\n\nМатериал изложен с самых основ и на доступном языке. Целью этого курса является не только познакомить вас с вопросами и методами теории графов, но и развить у неподготовленных слушателей культуру математического мышления. Поэтому курс доступен широкому кругу слушателей. Для освоения материала будет достаточно знания математики на хорошем школьном уровне и базовых знаний комбинаторики.\n\nКурс состоит из 7 учебных недель и экзамена. Для успешного решения большинства задач из тестов достаточно освоить материал, рассказанный на лекциях. На семинарах разбираются и более сложные задачи, которые смогут заинтересовать слушателя, уже знакомого с основами теории графов.","tutor":"Андрей Райгородский","provider":"Coursera","language":"Russian","skills":["russia","graph theory"],"subject":"Mathematics","studentsInterested":"22","courseLink":"https://www.coursera.org/learn/teoriya-grafov","classCentralLink":"https://www.class-central.com/course/coursera---4463"},{"title":"Single Variable Calculus","about":"Calculus is one of the grandest achievements of human thought, explaining everything from planetary orbits to the optimal size of a city to the periodicity of a heartbeat. This brisk course covers the core ideas of single-variable Calculus with emphases on conceptual understanding and applications. The course is ideal for students beginning in the engineering, physical, and social sciences. Distinguishing features of the course include: 1) the introduction and use of Taylor series and approximations from the beginning; 2) a novel synthesis of discrete and continuous forms of Calculus; 3) an emphasis on the conceptual over the computational; and 4) a clear, dynamic, unified approach.\n\nIn this fifth part--part five of five--we cover a calculus for sequences, numerical methods, series and convergence tests, power and Taylor series, and conclude the course with a final exam. Learners in this course can earn a certificate in the series by signing up for Coursera\u0027s verified certificate program and passing the series\u0027 final exam.","tutor":"Robert Ghrist","provider":"Coursera","language":"English","skills":["calculus","single variable calculus","usa","north america"],"subject":"Calculus","studentsInterested":"213","courseLink":"https://www.coursera.org/learn/discrete-calculus","classCentralLink":"https://www.class-central.com/course/coursera-single-variable-calculus-5067"},{"title":"1.- El Cálculo - Modelo Lineal","about":"Este curso forma parte de una secuencia con la que se propone un acercamiento a la Matemática Preuniversitaria que prepara para la Matemática Universitaria.\nEn él se asocia un significado real con el contenido matemático que se aprende y se integran tecnologías digitales en el proceso de aprendizaje.\nEl contexto real del movimiento en línea recta será el marco con el cual asociamos un primer significado y recapitulamos contenidos preuniversitarios relacionados con el Modelo Lineal.\n\nCurso con crédito académico para alumnos admitidos y aspirantes a ingresar a su primer semestre de un programa de profesional en el Tecnológico de Monterrey. Si estás inscrito en este MOOC con el fin de obtener el crédito académico para el curso de Introducción a las matemáticas (Matemáticas Remedial), confirma tu interés en la acreditación a la cuenta: mooc@servicios.itesm.mx . Consulta las preguntas frecuentes para conocer el proceso de acreditación.","tutor":"Dra. Patricia Salinas Martínez","provider":"Coursera","language":"Spanish","skills":["mexico","north america"],"subject":"Calculus","studentsInterested":"20","courseLink":"https://www.coursera.org/learn/calculo-1","classCentralLink":"https://www.class-central.com/course/coursera-1-el-calculo-modelo-lineal-4231"},{"title":"Calculus: Single Variable Part 2 - Differentiation","about":"Calculus is one of the grandest achievements of human thought, explaining everything from planetary orbits to the optimal size of a city to the periodicity of a heartbeat. This brisk course covers the core ideas of single-variable Calculus with emphases on conceptual understanding and applications. The course is ideal for students beginning in the engineering, physical, and social sciences. Distinguishing features of the course include: 1) the introduction and use of Taylor series and approximations from the beginning; 2) a novel synthesis of discrete and continuous forms of Calculus; 3) an emphasis on the conceptual over the computational; and 4) a clear, dynamic, unified approach.\n\nIn this second part--part two of five--we cover derivatives, differentiation rules, linearization, higher derivatives, optimization, differentials, and differentiation operators.","tutor":"Robert Ghrist","provider":"Coursera","language":"English","skills":["calculus","differential calculus","single variable calculus","usa","north america"],"subject":"Calculus","studentsInterested":"2.7k","courseLink":"https://www.coursera.org/learn/differentiation-calculus","classCentralLink":"https://www.class-central.com/course/coursera-calculus-single-variable-part-2-differentiation-5068"},{"title":"Calculus: Single Variable Part 4 - Applications","about":"Calculus is one of the grandest achievements of human thought, explaining everything from planetary orbits to the optimal size of a city to the periodicity of a heartbeat. This brisk course covers the core ideas of single-variable Calculus with emphases on conceptual understanding and applications. The course is ideal for students beginning in the engineering, physical, and social sciences. Distinguishing features of the course include: 1) the introduction and use of Taylor series and approximations from the beginning; 2) a novel synthesis of discrete and continuous forms of Calculus; 3) an emphasis on the conceptual over the computational; and 4) a clear, dynamic, unified approach.\n\nIn this fourth part--part four of five--we cover computing areas and volumes, other geometric applications, physical applications, and averages and mass. We also introduce probability.","tutor":"Robert Ghrist","provider":"Coursera","language":"English","skills":["calculus","single variable calculus","usa","north america"],"subject":"Calculus","studentsInterested":"1.3k","courseLink":"https://www.coursera.org/learn/applications-calculus","classCentralLink":"https://www.class-central.com/course/coursera-calculus-single-variable-part-4-applications-5070"},{"title":"4.- El Cálculo - Otros Modelos","about":"Este curso forma parte de una secuencia con la que se propone un acercamiento a la Matemática Preuniversitaria que prepara para la Matemática Universitaria.\nEn él se asocia un significado real con el contenido matemático que se aprende y se integran tecnologías digitales en el proceso de aprendizaje.\nSe propone la reinterpretación de los contenidos matemáticos relativos a Modelos con Radicales y Exponentes en términos de nociones y procesos del Cálculo Diferencial. Esto servirá como puente para el desarrollo de un pensamiento matemático avanzado con el que se trabajará en la Matemática Universitaria. El período de acreditación para la materia Introducción a las Matemáticas ha concluido. La última fecha para recibir certificados de Coursera es 24 de julio 2017. Informaremos oportunamente cuando la opción de acreditación esté disponible de nuevo.\n\nCurso con crédito académico para alumnos admitidos y aspirantes a ingresar a su primer semestre de un programa de profesional en el Tecnológico de Monterrey. Si estás inscrito en este MOOC con el fin de obtener el crédito académico para el curso de Introducción a las matemáticas (Matemáticas Remedial), confirma tu interés en la acreditación a la cuenta: mooc@servicios.itesm.mx. Consulta las preguntas frecuentes para conocer el proceso de acreditación.","tutor":"Dra. Patricia Salinas Martínez","provider":"Coursera","language":"Spanish","skills":["mexico","north america"],"subject":"Mathematics","studentsInterested":"12","courseLink":"https://www.coursera.org/learn/calculo-4","classCentralLink":"https://www.class-central.com/course/coursera-4-el-calculo-otros-modelos-4167"},{"title":"Комбинаторика для начинающих","about":"Комбинаторика для начинающих - это базовый курс, закладывающий самые основы комбинаторного знания.\n\nНа этом курсе слушатели, которые почти не знают комбинаторику или прочно ее забыли, откроют ее для себя впервые или заново. Курс очень полезен всем, кому трудно с ходу включиться в продвинутый курс современной комбинаторики. Однако фактические бонусы те же: в итоге человек, прослушавший курс, получит путевку в увлекательный мир комбинаторных задач и их далеко идущих приложений. Более того, даже в нем самом мы уже расскажем об инструментах, позволяющих решать некоторые задачи такой важной прикладной области знаний, как биоинформатика.\n\nКурс состоит из 7 учебных недель и экзамена. Каждую неделю слушателю предлагается выполнить тест, составляющий 10% от общей оценки. Экзамен состоит из задач по всему курсу и составляет 30% от общей оценки. Для получения сертификата необходимо набрать не менее 50% от общей суммы баллов.\n\nДанный курс является упрощённой версией курса \"Современная комбинаторика\" и рекомендуется к прохождению перед курсом \"Теория вероятностей для начинающих\".","tutor":"Дмитрий Ильинский and Андрей Райгородский","provider":"Coursera","language":"Russian","skills":["combinatorial mathematics","russia","combinatorics"],"subject":"Mathematics","studentsInterested":"18","courseLink":"https://www.coursera.org/learn/kombinatorika-dlya-nachinayushchikh","classCentralLink":"https://www.class-central.com/course/coursera----4477"},{"title":"Случайные графы","about":"Издавна среди жителей Кёнигсберга была распространена такая загадка: как пройти по всем мостам через реку Преголя, не проходя ни по одному из них дважды. Многие кёнигсбержцы пытались решить эту задачу как теоретически, так и практически во время прогулок. Доказать или опровергнуть возможность существования такого маршрута никто не мог до 1736 года, когда выдающийся математик Леонард Эйлер не написал письмо своему другу с решением. Ответ был «нельзя». Так и родилась теория графов. Но что будет, если процесс, который описывает граф – случаен?\n\nТеория случайных графов находится на стыке теории графов и теории вероятностей. Наука появилась в середине ХХ века, и она сразу же привлекла огромное внимание как со стороны чистых математиков, так и со стороны прикладников. В курсе мы изучим как основы теории случайных графов, так и настоящие ее жемчужины.\n\nМы научимся воспринимать многие сложные системы как \"случайные графы\". Среди них – интернет, социальные сети (Фейсбука, Вконтакте), биологические, межбанковские сети.\n\nПрослушав этот курс, вы проникнетесь чрезвычайно красивой математической теорией и научитесь решать комбинаторные и алгоритмические задачи на случайных графах. Все эти знания позволят нам затем перейти к курсу веб-графов, в котором мы расскажем о самых современных приложениях вероятностно-графовых моделей и конструкций.\n\nДля освоения материала будет достаточно математики школьного уровня, базовых знаний комбинаторики и теории вероятностей.","tutor":"Андрей Райгородский","provider":"Coursera","language":"Russian","skills":["russia","graph theory","probability theory","random graph theory"],"subject":"Statistics \u0026 Probability","studentsInterested":"14","courseLink":"https://www.coursera.org/learn/sluchajnye-graphy","classCentralLink":"https://www.class-central.com/course/coursera---4484"},{"title":"Calculus: Single Variable Part 3 - Integration","about":"Calculus is one of the grandest achievements of human thought, explaining everything from planetary orbits to the optimal size of a city to the periodicity of a heartbeat. This brisk course covers the core ideas of single-variable Calculus with emphases on conceptual understanding and applications. The course is ideal for students beginning in the engineering, physical, and social sciences. Distinguishing features of the course include: 1) the introduction and use of Taylor series and approximations from the beginning; 2) a novel synthesis of discrete and continuous forms of Calculus; 3) an emphasis on the conceptual over the computational; and 4) a clear, dynamic, unified approach.\n\nIn this third part--part three of five--we cover integrating differential equations, techniques of integration, the fundamental theorem of integral calculus, and difficult integrals.","tutor":"Robert Ghrist","provider":"Coursera","language":"English","skills":["calculus","integral calculus","single variable calculus","usa","north america"],"subject":"Calculus","studentsInterested":"659","courseLink":"https://www.coursera.org/learn/integration-calculus","classCentralLink":"https://www.class-central.com/course/coursera-calculus-single-variable-part-3-integration-5069"},{"title":"Pre-Calculus","about":"Curso diseñado para facilitar la entrada del estudiante en los cursos de cálculo de primer semestre de prácticamente cualquier grado universitario, con especial énfasis en Ciencias e Ingeniería.","tutor":"Jaume Pujol and Mercè Villanueva","provider":"Coursera","language":"Spanish","skills":["spain","europe","pre-calculus"],"subject":"Calculus","studentsInterested":"124","courseLink":"https://www.coursera.org/learn/introduccion-al-calculo","classCentralLink":"https://www.class-central.com/course/coursera-pre-calculus-4225"},{"title":"Pre-Calculus: Trigonometry","about":"This course covers mathematical topics in trigonometry. Trigonometry is the study of triangle angles and lengths, but trigonometric functions have far reaching applications beyond simple studies of triangles. This course is designed to help prepare students to enroll for a first semester course in single variable calculus.\n\nUpon completing this course, you will be able to:\n1. Evaluate trigonometric functions using the unit circle and right triangle approaches\n2. Solve trigonometric equations\n3. Verify trigonometric identities\n4. Prove and use basic trigonometric identities.\n5. Manipulate trigonometric expressions using standard identities\n6. Solve right triangles\n7. Apply the Law of Sines and the Law of Cosines","tutor":"Sarah Eichhorn and Rachel Lehman","provider":"Coursera","language":"English","skills":["usa","north america"],"subject":"Calculus","studentsInterested":"2.7k","courseLink":"https://www.coursera.org/learn/trigonometry","classCentralLink":"https://www.class-central.com/course/coursera-pre-calculus-trigonometry-843"},{"title":"2.- El Cálculo - Modelo Cuadrático","about":"Este curso forma parte de una secuencia con la que se propone un acercamiento a la Matemática Preuniversitaria que prepara para la Matemática Universitaria.\nEn él se asocia un significado real con el contenido matemático que se aprende y se integran tecnologías digitales en el proceso de aprendizaje.\nEl contexto real de llenado de tanques permitirá hacer una primera transferencia de significado y recapitularemos contenidos preuniversitarios relacionados con el Modelo Cuadrático. El período de acreditación para la materia Introducción a las Matemáticas ha concluido. La última fecha para recibir certificados de Coursera es 24 de julio 2017. Informaremos oportunamente cuando la opción de acreditación esté disponible de nuevo.\n\nCurso con crédito académico para alumnos admitidos y aspirantes a ingresar a su primer semestre de un programa de profesional en el Tecnológico de Monterrey. Si estás inscrito en este MOOC con el fin de obtener el crédito académico para el curso de Introducción a las matemáticas (Matemáticas Remedial), confirma tu interés en la acreditación a la cuenta: mooc@servicios.itesm.mx. Consulta las preguntas frecuentes para conocer el proceso de acreditación.","tutor":"Dra. Patricia Salinas Martínez","provider":"Coursera","language":"Spanish","skills":["calculus","mexico","north america"],"subject":"Calculus","studentsInterested":"13","courseLink":"https://www.coursera.org/learn/calculo-2","classCentralLink":"https://www.class-central.com/course/coursera-2-el-calculo-modelo-cuadratico-4226"},{"title":"Современная комбинаторика (Modern combinatorics)","about":"Комбинаторика - это наука, которая, с одной стороны, богата исключительно красивыми постановками задач, зачастую доступными школьнику, а с другой стороны, это очень глубокая современная область знаний, без овладения инструментами которой невозможно серьезное понимание как большинства других фундаментальных дисциплин - анализа, алгебры, теории графов, теории вероятностей и др., - так и многих прикладных проблем.\n\nСовременная комбинаторика, таким образом, это своего рода основа основ: это и красивейшая теория с массой нетривиальных задач и методов, но это и прекрасная база для приложений в computer science, в анализе сложных сетей, в теории кодирования и криптографии, в биоинформатике и др. В курсе мы познакомим слушателей с наиболее важными областями и инструментами современной комбинаторики, причем многие темы курса по сути уникальны: здесь не только классические комбинаторные величины и тождества, но также и общая теория обращения Мебиуса, и диаграммы Юнга, и рекурсия, и производящие функции. Это позволит нам в дальнейших курсах выйти на реальные приложения в анализе таких сложных сетей, как Интернет, социальные, биологические сети, сети межбанковских взаимодействий и др.\n\nДля участия в курсе слушателю необходимо иметь базовые представления о теории множеств и началах анализа. Все остальные понятия будут введены в ходе курса.\n\nКурс состоит из 7 недель лекций и 1 недели экзамена. Каждую неделю слушатель выполняет задания, составляющие 10% от всего курса (5% тест и 5% задачи с ответом). Экзамен также состоит из теста и задач с ответом, каждая часть оценивается в 15% от общей суммы. Для успешного прохождения курса необходимо в каждом задании набрать не менее 50% от общего числа баллов.\n\nДанный курс рекомендуется к прохождению перед курсом Теория вероятностей.","tutor":"Андрей Райгородский and Дмитрий Ильинский","provider":"Coursera","language":"Russian","skills":["combinatorial mathematics","russia","combinatorics"],"subject":"Mathematics","studentsInterested":"14","courseLink":"https://www.coursera.org/learn/modern-combinatorics","classCentralLink":"https://www.class-central.com/course/coursera---modern-combinatorics-4478"},{"title":"Теория вероятностей для начинающих","about":"Теория вероятностей - это, вне всякого сомнения, один из самых важных и богатых приложениями разделов современной математики.\n\nС помощью методов этой замечательной науки можно как оценивать классические вероятности выигрышных стратегий в азартных играх, так и решать весьма серьезные прикладные задачи, возникающие буквально в каждой области науки. В нашем курсе мы познакомим слушателей прежде всего с самыми основами предмета. И сделаем мы это в уникальном формате - иллюстрируя вероятностные объекты и методы на примерах решения с их помощью комбинаторных задач. Суть в том, что, конечно, в базовой вероятности много комбинаторики, и это все знают; мы же расскажем не только об этом, но и о том, как, наоборот, вероятностные методы позволяют работать с комбинаторными задачами. Это позволит нам впоследствии выйти на приложения вероятности в теории графов, случайных графов и, наконец, веб-графов и прочих сложных сетей. Также в рамках курса мы оторвемся от чисто комбинаторных интерпретаций и обсудим более общие вероятностные модели. Но интуиция все равно сохранится, и в этой комбинаторной подоплеке уникальность курса.\n\nКурс построен так, что будет по плечу даже тем, кто изучал математику последний раз только в школе. Тем не менее, так как для понимания курса необходимы знания основ комбинаторики, мы рекомендуем пройти наш курс по комбинаторике прежде чем прослушивать данный курс.\n\nВнутри курса также все просто – каждую неделю вас ждут видеолекции и проверочные задания, которые нужно выполнять в срок. В конце – итоговая проверочная работа. Студенты, которые набрали достаточное количество баллов, смогут получить сертификат.","tutor":"Андрей Райгородский and Максим Жуковский","provider":"Coursera","language":"Russian","skills":["russia","probability theory"],"subject":"Statistics \u0026 Probability","studentsInterested":"36","courseLink":"https://www.coursera.org/learn/probability-theory-basics","classCentralLink":"https://www.class-central.com/course/coursera-----4466"},{"title":"Pre-Calculus: Functions","about":"This course covers mathematical topics in college algebra, with an emphasis on functions. The course is designed to help prepare students to enroll for a first semester course in single variable calculus.\n\nUpon completing this course, you will be able to:\n1. Solve linear and quadratic equations\n2. Solve some classes of rational and radical equations\n3. Graph polynomial, rational, piece-wise, exponential and logarithmic functions\n4. Find integer roots of polynomial equations\n5. Solve exponential and logarithm equations\n6. Understand the inverse relations between exponential and logarithm equations\n7. Compute values of exponential and logarithm expressions using basic properties","tutor":"Sarah Eichhorn and Rachel Lehman","provider":"Coursera","language":"English","skills":["pre-calculus","usa","north america"],"subject":"Calculus","studentsInterested":"132","courseLink":"https://www.coursera.org/learn/pre-calculus","classCentralLink":"https://www.class-central.com/course/coursera-pre-calculus-functions-6715"},{"title":"Calculus: Single Variable Part 1 - Functions","about":"Calculus is one of the grandest achievements of human thought, explaining everything from planetary orbits to the optimal size of a city to the periodicity of a heartbeat. This brisk course covers the core ideas of single-variable Calculus with emphases on conceptual understanding and applications. The course is ideal for students beginning in the engineering, physical, and social sciences. Distinguishing features of the course include: 1) the introduction and use of Taylor series and approximations from the beginning; 2) a novel synthesis of discrete and continuous forms of Calculus; 3) an emphasis on the conceptual over the computational; and 4) a clear, dynamic, unified approach.\n\nIn this first part--part one of five--you will extend your understanding of Taylor series, review limits, learn the *why* behind l\u0027Hopital\u0027s rule, and, most importantly, learn a new language for describing growth and decay of functions: the BIG O.","tutor":"Robert Ghrist","provider":"Coursera","language":"English","skills":["calculus","single variable calculus","usa","north america"],"subject":"Calculus","studentsInterested":"2.4k","courseLink":"https://www.coursera.org/learn/single-variable-calculus","classCentralLink":"https://www.class-central.com/course/coursera-calculus-single-variable-part-1-functions-5066"},{"title":"3.- El Cálculo - Modelo Cúbico","about":"Este curso forma parte de una secuencia con la que se propone un acercamiento a la Matemática Preuniversitaria que prepara para la Matemática Universitaria.\nEn él se asocia un significado real con el contenido matemático que se aprende y se integran tecnologías digitales en el proceso de aprendizaje.\nLa transferencia a varios contextos reales permitirá fortalecer un aprendizaje con significado e integrar tecnologías digitales especializadas. El objetivo es desarrollar un pensamiento matemático en el aprendizaje de contenidos relacionados con el Modelo Cúbico.El período de acreditación para la materia Introducción a las Matemáticas ha concluido. La última fecha para recibir certificados de Coursera es 24 de julio 2017. Informaremos oportunamente cuando la opción de acreditación esté disponible de nuevo.\n\nCurso con crédito académico para alumnos admitidos y aspirantes a ingresar a su primer semestre de un programa de profesional en el Tecnológico de Monterrey. Si estás inscrito en este MOOC con el fin de obtener el crédito académico para el curso de Introducción a las matemáticas (Matemáticas Remedial), confirma tu interés en la acreditación a la cuenta: mooc@servicios.itesm.mx. Consulta las preguntas frecuentes para conocer el proceso de acreditación.","tutor":"Dra. Patricia Salinas Martínez","provider":"Coursera","language":"Spanish","skills":["calculus","mexico","north america"],"subject":"Calculus","studentsInterested":"10","courseLink":"https://www.coursera.org/learn/calculo-3","classCentralLink":"https://www.class-central.com/course/coursera-3-el-calculo-modelo-cubico-4284"},{"title":"Differential Equations in Action","about":"In this course, you\u0027ll hone your problem-solving skills through learning to find numerical solutions to systems of differential equations. You\u0027ll write code in Python to fight forest fires, rescue the Apollo 13 astronauts, stop the spread of epidemics, and resolve other real-world dilemmas.\n\n\nWhy Take This Course?\nBy the end of this course, you\u0027ll develop an intuition for the use of differential equations in the applied sciences. You\u0027ll also learn how to build mathematical models for systems of differential equations using a variety of techniques. Along the way, you\u0027ll learn how to translate mathematical expressions into Python code and solve some really cool problems!","tutor":"Jörn Loviscach","provider":"Udacity","language":"English","skills":["mathematics","differential equations","cs math core"],"subject":"Calculus","studentsInterested":"1.7k","courseLink":"https://www.udacity.com/course/differential-equations-in-action--cs222","classCentralLink":"https://www.class-central.com/course/udacity-differential-equations-in-action-456"},{"title":"Visualizing Algebra","about":"Throughout this course, we will use algebra to quantify and describe the world around us. Have you ever wondered how many songs can fit onto your flash drive? By the end of the course, you’ll have stronger skills for modeling problems, analyzing patterns, and using algebra to arrive at conclusions.\n\n\nWhy Take This Course?\nUnderstand and develop the language, models, and tools for math reasoning.\nReason with numbers and units to solve problems.\nIdentify, analyze, extend, and create patterns and functions.\nMake connections about relations and functions through multiple representations: graphs, charts, tables, equations.\nApply mathematical reasoning and logic to solve equations and write equivalent forms.","tutor":"Susan McClory, Sandra DeSousa and Chris Saden","provider":"Udacity","language":"English","skills":["high school mathematics","mathematics","algebra","usa","north america"],"subject":"Algebra \u0026 Geometry","studentsInterested":"593","courseLink":"https://www.udacity.com/course/visualizing-algebra--ma006","classCentralLink":"https://www.class-central.com/course/udacity-visualizing-algebra-629"},{"title":"CVX101: Convex Optimization","about":"This course concentrates on recognizing and solving convex optimization problems that arise in applications. The syllabus includes: convex sets, functions, and optimization problems; basics of convex analysis; least-squares, linear and quadratic programs, semidefinite programming, minimax, extremal volume, and other problems; optimality conditions, duality theory, theorems of alternative, and applications; interior-point methods; applications to signal processing, statistics and machine learning, control and mechanical engineering, digital and analog circuit design, and finance.\nPREREQUISITES\nYou should have good knowledge of linear algebra and exposure to probability. Exposure to numerical computing, optimization, and application fields is helpful but not required; the applications will be kept basic and simple. You will use matlab and CVX to write simple scripts, so some basic familiarity with matlab is helpful. We will provide some basic Matlab tutorials.","tutor":"Stephen Boyd","provider":"Stanford OpenEdx","language":"English","skills":["usa","north america"],"subject":"Mathematics","studentsInterested":"1.1k","courseLink":"https://class.stanford.edu/courses/Engineering/CVX101/Winter2014/about","classCentralLink":"https://www.class-central.com/course/stanford-openedx-cvx101-convex-optimization-1577"},{"title":"Street-Fighting Math","about":"Too much mathematical rigor teaches rigor mortis: the fear of making an unjustified leap even when it lands on a correct result. Instead of paralysis, have courage: Shoot first and ask questions later. Although unwise as public policy, it is a valuable problem-solving philosophy and the theme of this course: how to guess answers without a proof or an exact calculation, in order to develop insight.\nYou will learn this skill by mastering six reasoning tools---dimensional analysis, easy cases, lumping, pictorial reasoning, taking out the big part, and analogy. The applications will include mental calculation, estimating population growth rates, understanding drag without differential equations, singing musical intervals to estimate logarithms, approximating integrals, summing infinite series, and turning differential equations into algebra.\nYour learning will be supported by regular readings that you discuss with other students, by short tablet videos, by quick problems to help you check your understanding, by weekly homework problems, review and and a final exam. You will work hard, and, by the end of the course, have learned a rough-and-ready approach to using mathematics to understand the world.\nAll required readings are available within the courseware, courtesy of The MIT Press. A print version of the course textbook, Street-Fighting Math, is also available for purchase. The MIT Press is offering enrolled students a special 30% discount on books ordered directly through the publisher’s website. To take advantage of this offer, please use promotion code SFM30 at The MIT Press. \nFAQ","tutor":"Sanjoy Mahajan and Isaac Chuang","provider":"edX","language":"English","skills":["mitx"],"subject":"Foundations of Mathematics","studentsInterested":"1.4k","courseLink":"https://www.edx.org/course/street-fighting-math-mitx-6-sfmx","classCentralLink":"https://www.class-central.com/course/edx-street-fighting-math-1780"},{"title":"Introduction to Probability, Statistics, and Random Processes","about":"This site is the homepage of the textbook Introduction to Probability, Statistics, and Random Processes by Hossein Pishro-Nik. It is an open access peer-reviewed textbook intended for undergraduate as well as first-year graduate level courses on the subject. It can be used by both students and practitioners in engineering, mathematics, finance, and other related fields.\nThe site includes:\nThe entire textbook\nShort video lectures that aid in learning the material\nOnline calculators for important functions and distributions\nA solutions manual for instructors\n NOTE: Videos are only availaible for chapter 1-4","tutor":"Hossein Pishro-Nik","provider":"Independent","language":"English","skills":["statistics","probability","usa","north america"],"subject":"Statistics \u0026 Probability","studentsInterested":"578","courseLink":"https://http://www.probabilitycourse.com/","classCentralLink":"https://www.class-central.com/course/introduction-to-probability-statistics-and-random-processes-2676"}]