[{"title":"Learning How to Learn: Powerful mental tools to help you master tough subjects","about":"This course gives you easy access to the invaluable learning techniques used by experts in art, music, literature, math, science, sports, and many other disciplines. We’ll learn about the how the brain uses two very different learning modes and how it encapsulates (“chunks”) information. We’ll also cover illusions of learning, memory techniques, dealing with procrastination, and best practices shown by research to be most effective in helping you master tough subjects.\n\nUsing these approaches, no matter what your skill levels in topics you would like to master, you can change your thinking and change your life. If you’re already an expert, this peep under the mental hood will give you ideas for: turbocharging successful learning, including counter-intuitive test-taking tips and insights that will help you make the best use of your time on homework and problem sets. If you’re struggling, you’ll see a structured treasure trove of practical techniques that walk you through what you need to do to get on track. If you’ve ever wanted to become better at anything, this course will help serve as your guide.\n\nThis course can be taken independent of, concurrent with, or prior to, its companion course, Mindshift. (Learning How to Learn is more learning focused, and Mindshift is more career focused.)\n\nTo join the fully translated Portuguese version of the course, visit: https://www.coursera.org/learn/aprender\nTo join the fully translated Spanish version of the course, visit: https://www.coursera.org/learn/aprendiendo-a-aprender\nTo join the fully translated Chinese version of the course, visit: https://www.coursera.org/learn/ruhe-xuexi","tutor":"Terrence Sejnowski and Barbara Oakley","provider":"Coursera","language":"English","skills":["learning theory","neuroscience","human behavior","mastery","academic skills","usa","north america"],"subject":"Self Improvement","studentsInterested":"42.4k","courseLink":"https://www.coursera.org/learn/learning-how-to-learn","classCentralLink":"https://www.class-central.com/course/coursera-learning-how-to-learn-powerful-mental-tools-to-help-you-master-tough-subjects-2161"},{"title":"Mindshift: Break Through Obstacles to Learning and Discover Your Hidden Potential","about":"Mindshift is designed to help boost your career and life in today’s fast-paced learning environment. Whatever your age or stage, Mindshift teaches you essentials such as how to get the most out of online learning and MOOCs, how to seek out and work with mentors, the secrets to avoiding career ruts (and catastrophes) and general ruts in life, and insights such as the value of selective ignorance over general competence. We’ll provide practical insights from science about how to learn and change effectively even in maturity, and we’ll build on what you already know to take your life’s learning in fantastic new directions. This course is designed to show you how to look at what you’re learning, and your place in what’s unfolding in the society around you, so you can be what you want to be, given the real world constraints that life puts on us all. You’ll see that by using certain mental tools and insights, you can learn and do more—far more—than you might have ever dreamed!\n\nThis course can be taken independent of, concurrent with, or subsequent to, its companion course, Learning How to Learn. (Mindshift is more career focused, and Learning How to Learn is more learning focused.)","tutor":"Dr. Barbara Oakley and Dr. Terrence Sejnowski","provider":"Coursera","language":"English","skills":["new-moocs-2017"],"subject":"Personal Development","studentsInterested":"29.8k","courseLink":"https://www.coursera.org/learn/mindshift","classCentralLink":"https://www.class-central.com/course/coursera-mindshift-break-through-obstacles-to-learning-and-discover-your-hidden-potential-8289"},{"title":"Aprender","about":"¿Quieres conocer tus recursos y niveles de desempeño relacionadas con tu proceso de aprender? ¿Te interesa desarrollar habilidades para aprender más y mejor?\n\nEn APRENDER conocerás y pondrás en práctica, de forma sencilla y práctica, resultados de investigación recientes sobre los procesos de lectura, almacenamiento de información, recuperación de recuerdos y velocidad de procesamiento. Así, podrás utilizar, de forma eficiente, estrategias y técnicas muy útiles en tu vida académica, profesional y cotidiana.","tutor":"Guadalupe Vadillo","provider":"Coursera","language":"Spanish","skills":["critical thinking","learning","mexico","north america"],"subject":"Self Improvement","studentsInterested":"310","courseLink":"https://www.coursera.org/learn/aprendo","classCentralLink":"https://www.class-central.com/course/coursera-aprender-4631"},{"title":"Maintaining a Mindful Life","about":"Discover techniques to help you maintain a mindful life\nInterest in mindfulness has grown enormously over the last few years. It’s no surprise: mindfulness techniques can improve your communication skills, relationships and emotional health. But not everyone knows how to apply mindfulness in daily life.\nBuilding upon the introductory Mindfulness for Wellbeing Peak and Performance, this course will show you how can embed mindfulness into all aspects of your life.\nThis course is intended for people with previous experience of practising mindfulness and we strongly recommend completing the introductory course Mindfulness for Wellbeing and Peak Performance before doing this more advanced course.\nSome practices in this course may not be suitable for people who have not previously learned and applied foundational mindfulness principles and techniques.\nThis course is not designed to be therapeutic for significant health problems so if you have any concerns in this regard then it is recommended that you speak to a suitably qualified health practitioner.\nSections of this course make extensive use of video and audio. Before you begin, make sure the computer or device you’re using has the ability to play video and audio and you have access to speakers or headphones.\nYou might find headphones more suitable for the sections of the course that guide you through mindful meditation exercises.","tutor":"Assoc. Prof. Craig Hassed","provider":"FutureLearn","language":"English","skills":["mindfulness","new-moocs-2017"],"subject":"Self Improvement","studentsInterested":"3.2k","courseLink":"https://www.futurelearn.com/courses/mindfulness-life","classCentralLink":"https://www.class-central.com/course/futurelearn-maintaining-a-mindful-life-9078"},{"title":"Presentation skills: Designing Presentation Slides","about":"“Powerpoint slides are like children: no matter how ugly they are, you’ll think they’re beautiful if they’re yours” — Scott Adams, author of the comic strip “Dilbert”. Due to this cause or another, it’s a huge stress to look at most Powerpoint slides. Depending on the “design” skills of the speaker and audience’s taste slides create different emotions from a slight annoyance to physical sickness.\n\nBut that is not the worst thing. The worst thing is that instead of improving the presentation such slides confuse the audience, distract it and finally oblige the speaker to explain them rather than being quite self-explanatory.\n\nThe goal of this course is to change that by equipping learners with a set of tools to create simple, clear and aesthetic slides which improve the presentation of the speaker. The course covers universal design principles, templates, colors, typefaces, slides’ typography, use of photos and pictograms, composition rules and ways to create clear and meaningful charts and diagrams.\n\nThis course is not a PowerPoint fundamentals course. You should have a basic knowledge of either Microsoft PowerPoint or Apple Keynote software.\n\nDon’t meddle, make your slides matter.","tutor":"Alexei Kapterev","provider":"Coursera","language":"English","skills":["communication","presentations","slides","new-moocs-2017"],"subject":"Communication Skills","studentsInterested":"1.6k","courseLink":"https://www.coursera.org/learn/slides","classCentralLink":"https://www.class-central.com/course/coursera-presentation-skills-designing-presentation-slides-9643"},{"title":"Presentation skills: Speechwriting and Storytelling","about":"“99% presentations suck!”, — said Apple former evangelist Guy Kawasaki in 2005. Up to now the situation hasn’t improved yet. Why?\nMost public speaking courses focus on “how” instead of “what \u0026 why”. How to stand, walk and talk during delivery with little attention paid to “what” — the quality of storytelling itself. Thereby a usual result is a looking slightly confident speaker with mesmerizing voice delivering an obscure mess of facts, figures and claims.\n\nIn this course we take a more systematic approach, focusing on the content. How to structure your ideas, facts and data into a logical convincing story using a narrative structure. This course covers fundamentals of scriptwriting, packing, argumentation and language.\n\nThis course is not about how to fabricate a catching tale, but rather how to structure your ideas, facts and data into an interesting story you are going to tell during your presentation.","tutor":"Alexei Kapterev","provider":"Coursera","language":"English","skills":["storytelling","presentations","speechwriting","new-moocs-2017"],"subject":"Communication Skills","studentsInterested":"2.2k","courseLink":"https://www.coursera.org/learn/speechwriting","classCentralLink":"https://www.class-central.com/course/coursera-presentation-skills-speechwriting-and-storytelling-9646"},{"title":"Presentation skills: Effective Presentation Delivery","about":"Mumbling, stumbling, worrying, trembling, sweating and fearing are the outcomes of the low delivery skills.\n\nIn this course, we are not going to teach you how to replicate the best bits and traits of the acknowledged speakers. Dumb replication of someone’s successful behavior may help you only to an extent. That extent is the situation. When you are facing a different context, a different situation such “skills” might not work at all.\n\nInstead, we try to get to the core issues that stand behind the troubles with delivery and start honing your skills from there. Topics we are going to cover:\n\n1) Preparation — how to deal with fear and anxiety\n2) Voice, pace and gesture — how to speak, stand and move.\n3) Getting live feedback — how to interact with the audience.\n4) Taking Q\u0026A and Improvisation\n\nSo don’t meddle, start the course and make your delivery better.","tutor":"Alexei Kapterev","provider":"Coursera","language":"English","skills":["communication","presentations","new-moocs-2017"],"subject":"Communication Skills","studentsInterested":"1.4k","courseLink":"https://www.coursera.org/learn/delivery","classCentralLink":"https://www.class-central.com/course/coursera-presentation-skills-effective-presentation-delivery-9645"},{"title":"Presentation skills: Public Speaking Project","about":"Everything comes together in the Capstone: story, slides and delivery. You will draft a complete script of your presentation. With the advice of your peer readers, you will revise, rewrite, and complete it. Then the same thing will happen with your slides. And finally you will deliver it to a real audience recording it on camera and get valuable feedback from your peers.\n\nWe highly suggest not to do a «fake project», but choose a topic that matters to you, so in the end you will have a polished presentation of something that is important to you. Whether it is an idea, a business project, a product or some other complicated matter.\n\nIf you are to revise some other work, please, write with an intention to help. Say what a peer should stop or start doing, add or remove from their script or slides.","tutor":"Alexei Kapterev","provider":"Coursera","language":"English","skills":["public speaking","communication","presentations","new-moocs-2017"],"subject":"Communication Skills","studentsInterested":"1.3k","courseLink":"https://www.coursera.org/learn/public-speaking-project","classCentralLink":"https://www.class-central.com/course/coursera-presentation-skills-public-speaking-project-9644"},{"title":"Successful Negotiation: Essential Strategies and Skills","about":"We all negotiate on a daily basis. On a personal level, we negotiate with friends, family, landlords, car sellers and employers, among others. Negotiation is also the key to business success. No business can survive without profitable contracts. Within a company, negotiation skills can lead to your career advancement.\n\nI hope that you will join the hundreds of thousands of learners who have made “Successful Negotiation” one of the most popular and highly-rated MOOCs worldwide. In the course, you’ll learn about and practice the four steps to a successful negotiation:\n\n(1) Prepare: Plan Your Negotiation Strategy\n\n(2) Negotiate: Use Key Tactics for Success\n\n(3) Close: Create a Contract\n\n(4) Perform and Evaluate: The End Game\n\nTo successfully complete this course and improve your ability to negotiate, you’ll need to do the following:\n\n(1) Watch the short videos (ranging from 5 to 20 minutes). The videos are interactive and they include questions to test your understanding of negotiation strategy and skills. You can speed up or slow down videos to match your preferred pace for listening. Depending on your schedule, you can watch the videos over a few weeks or you can binge watch them. A learner who binge-watched the course concluded that “It’s as good as Breaking Bad.” Another learner compared the course to “House of Cards.” Both shows contain interesting examples of complex negotiations!\n\n(2) Test your negotiation skills by completing the negotiation in Module 6. You can negotiate with a local friend or use Discussions to find a partner from another part of the world. Your negotiation partner will give you feedback on your negotiation skills. To assist you with your negotiations, I have developed several free negotiating planning tools that are related to the course. These tools and a free app are available at http://negotiationplanner.com/\n\n(3) Take the final exam. To successfully complete the course, you must answer 80% of the questions correctly. The exam is a Mastery Exam, which means that you can take it as many times as you want until you master the material.\n\nCourse Certificate\nYou have the option of earning a Course Certificate. A Certificate provides formal recognition of your achievements in the course and includes the University of Michigan logo. Learn more about Certificates at: https://learner.coursera.help/hc/en-us/articles/209819053-Get-a-Course-Certificate\n\nThis course is also available in Spanish and Portuguese. To join the fully translated Spanish version, visit this page: https://www.coursera.org/learn/negociacion/\n\nTo join the fully translated Portuguese version, visit this page: https://www.coursera.org/learn/negociacao\nSubtitles for the videos are available in English, Ukrainian, Chinese (Simplified), Portuguese (Brazilian), Spanish\n\n\nCreated by: University of Michigan\n\nThe course logo composite is shared with a Creative Commons CC BY-SA (https://creativecommons.org/licenses/by-sa/2.0/) license, and was created using images provided courtesy of Flazingo Photos (http://bit.ly/1zOylRm) and K2 Space (https://www.flickr.com/photos/k2space/14257556613/in/set-72157644732478432).","tutor":"George Siedel","provider":"Coursera","language":"English","skills":["negotiation","usa","north america"],"subject":"Communication Skills","studentsInterested":"10.4k","courseLink":"https://www.coursera.org/learn/negotiation-skills","classCentralLink":"https://www.class-central.com/course/coursera-successful-negotiation-essential-strategies-and-skills-2460"},{"title":"How to Succeed at: Interviews","about":"##\nBeing offered an interview is exciting but can be quite daunting. On this course, our experts from The Careers Service here at The University of Sheffield will make sure you are prepared for the big day.\nIf you’re still at the stage of writing your CV and submitting applications for a job or course, join our course How to Succeed at: Writing Applications.\nThis course is designed for anyone applying for jobs or courses. It will be of particular interest to those in the early stages of their career, or those who are out of practice and need to update their skills. No prior knowledge or expertise are needed.","tutor":"Hilary Jones and Pamela Hafekost","provider":"FutureLearn","language":"English","skills":["europe","uk"],"subject":"Career Development","studentsInterested":"3.7k","courseLink":"https://www.futurelearn.com/courses/interviews","classCentralLink":"https://www.class-central.com/course/futurelearn-how-to-succeed-at-interviews-2253"},{"title":"Logical and Critical Thinking","about":"##\nWe are constantly being given reasons to do and believe things: to believe that we should buy a product, support a cause, accept a job, judge someone innocent or guilty, that fairness requires us to do some household chore, and so on. Assessing the reasons we are given to do or believe these things calls upon us to think critically and logically.\nImprove your logical and critical thinking skills\nEven though we’re called upon to use our critical and logical thinking skills all the time, most of us are not that good at it. This free online course aims to help you develop and improve these skills.\nYou’ll learn how to:\nidentify and avoid common thinking mistakes that lead to the formation of bad beliefs;\nrecognise, reconstruct and evaluate arguments;\nuse basic logical tools to analyse arguments;\nand apply those tools in areas including science, moral theories and law.\nAssociate Professor Tim Dare and Dr Patrick Girard from the University of Auckland take us on an informative and engaging eight week journey through the worlds of logical and critical thinking helping us to avoid these common obstacles and fallacies and improve our logical and critical thinking skills.","tutor":"Patrick Girard and Tim Dare","provider":"FutureLearn","language":"English","skills":["critical thinking","logical thinking","australia","new zealand"],"subject":"Self Improvement","studentsInterested":"8.1k","courseLink":"https://www.futurelearn.com/courses/logical-and-critical-thinking","classCentralLink":"https://www.class-central.com/course/futurelearn-logical-and-critical-thinking-3715"},{"title":"Introduction to Public Speaking","about":"This course gives you a reliable model for preparing and delivering effective presentations.\n\nIn business, in school, and in public life, we are often called upon to “make a few comments.” Often, people tasked with such speeches become flummoxed. They might not know what to talk about, or ramble without making a point, or simply be confusing to listen to. This course is designed to help you shine where others falter.\n\nWe’ll learn how organize talks clearly, write them memorably, and deliver them confidently. By the end of the course, you should be able to significantly reduce your fear of public speaking, use rehearsal techniques to develop a strong, vibrant speaking voice, and perform speeches with dynamic movement and gestures. The speech model that we’ll practice is useful for briefings, elevator talks, interviews, and even as a structure for hour-long presentations.\n\nIf you’re a beginner, this course will help you quickly master the fundamentals of speaking. If you’re a seasoned speaker, this course will help you better understand public speaking and push you to the next level.","tutor":"Matt McGarrity","provider":"Coursera","language":"English","skills":["usa","north america"],"subject":"Communication Skills","studentsInterested":"6.2k","courseLink":"https://www.coursera.org/learn/public-speaking","classCentralLink":"https://www.class-central.com/course/coursera-introduction-to-public-speaking-889"},{"title":"Creative Problem Solving","about":"This course deals directly with your ability for creativity which is a critical skill in any field. It focuses on divergent thinking, the ability to develop multiple ideas and concepts to solve problems. Through a series of creativity building exercises, short lectures, and readings, learners develop both an understanding of creativity and increase their own ability.\n\nThis course will help you understand the role of creativity and innovation in your own work and in other disciplines. It will challenge you to move outside of your existing comfort zone and to recognize the value of that exploration. This course will help you understand the importance of diverse ideas, and to convey that understanding to others.\n\nThe principal learning activity in the course is a series of \"differents\" where you are challenged to identify and change your own cultural, habitual, and normal patterns of behavior. Beginning with a prompt, e.g. \"eat something different\", you will begin to recognize your own \u003d limits and to overcome them. In addition, you are encouraged to understand that creativity is based on societal norms, and that by it\u0027s nature, it will differ from and be discouraged by society. In this course, the persistence of the creative person is developed through practice. At the same time, these exercises are constrained by concerns of safety, legality, and economics, which are addressed in their creative process.","tutor":"Brad Hokanson and Marit McCluske","provider":"Coursera","language":"English","skills":["usa","north america"],"subject":"Self Improvement","studentsInterested":"1.0k","courseLink":"https://www.coursera.org/learn/creative-problem-solving","classCentralLink":"https://www.class-central.com/course/coursera-creative-problem-solving-1636"},{"title":"High-Impact Business Writing","about":"Effective writing is a powerful tool in the business environment. Learn how to articulate your thoughts in a clear and concise manner that will allow your ideas to be better understood by your readers. Improve your business writing skill by learning to select and use appropriate formats for your audience, use the correct medium and adjust your writing style accordingly, as well as identify your objective and communicate it clearly. You\u0027ll also learn to spot, correct and avoid the most common writing pitfalls, and gain valuable experience analyzing, writing and revising a wide spectrum of business documents. From a simple interoffice memo to a twenty-page business proposal, learn how to put good business writing to work for you.\n\nUpon completing this course, you will be able to:\n1. Write effective business communications, including bad news, good news, persuasive writing, presentations, emails, memos, business reports and press releases\n2. Learn how to edit and proofread business documents\n3. Learn how to write for a global market","tutor":"Sue Robins","provider":"Coursera","language":"English","skills":["usa","north america"],"subject":"Communication Skills","studentsInterested":"821","courseLink":"https://www.coursera.org/learn/business-writing","classCentralLink":"https://www.class-central.com/course/coursera-high-impact-business-writing-2724"},{"title":"De-Mystifying Mindfulness","about":"Interest in meditation, mindfulness, and contemplation has grown exponentially in recent years. Rather than being seen as mystical practices from ancient Buddhism or esoteric philosophy, they are increasingly seen as technologies rooted in evidence from psychology and neuroscience. Mindfulness has become the basis for numerous therapeutic interventions, both as a treatment in healthcare and as a means of enhancing well-being and happiness. For millions around the world, mindfulness has become a life-style choice, enhancing and enriching everyday experience. Mindfulness is big business.\n\nBut, what actually is mindfulness? Is it really good for you? Can anyone learn it? How can you recognize charlatans? Would you want to live in a mindful society, and would it smell like sandalwood? What does it feel like to be mindful? Are you mindful already, and how would you know?\n\nEvolving from the popular Honours Academy course at Leiden University, this innovative course combines conventional scholarly inquiry from multiple disciplines (ranging from psychology, through philosophy, to politics) with experiential learning (including specially designed ‘meditation labs,’ in which you’ll get chance to practice and analyze mindfulness on yourself). In the end, the course aims to provide a responsible, comprehensive, and inclusive education about (and in) mindfulness as a contemporary phenomenon.\n\nDuring the production of this course, we have been supported by Willem Kuyken, Director of the University of Oxford Mindfulness Centre, and Stephen Batchelor, co-founder of Bodhi College. And we gratefully acknowledge the contributions made by Mark Williams, co-developer of Mindfulness-based Cognitive Therapy (MBCT), and Rebecca Crane, Director of the Centre for Mindfulness Research and Practice at the University of Bangor.","tutor":"Chris Goto-Jones","provider":"Coursera","language":"English","skills":["europe","netherlands"],"subject":"Personal Development","studentsInterested":"939","courseLink":"https://www.coursera.org/learn/mindfulness","classCentralLink":"https://www.class-central.com/course/coursera-de-mystifying-mindfulness-6951"},{"title":"La Solución del Conflicto Ético","about":"En este curso los participantes lograrán identificar y tomar decisiones sobre casos clínicos con conflictos éticos en el área de la salud por medio de la aplicación del razonamiento ético desde una perspectiva universal y considerando los aspectos médicos y éticos, el marco jurídico y la decisión ética.\n\nLa ética en lo general es un elemento esencial para el avance del ser humano porque resulta de la capacidad de cuestionar, reflexionar y razonar sobre todo lo que es y todo lo que cambia en la vida. Existe evidencia de que la percepción y los juicios, que sobre la moral hace un individuo, definen su comportamiento. Estas capacidades que se desarrollan en forma paulatina, permiten atender y resolver los conflictos éticos.\n\nPara facilitar tus logros tendrás disponibles videos y evaluaciones.","tutor":"Dra. Irene Durante Montiel","provider":"Coursera","language":"Spanish","skills":["conflict resolution","ethics","mexico","north america"],"subject":"Communication Skills","studentsInterested":"29","courseLink":"https://www.coursera.org/learn/etica","classCentralLink":"https://www.class-central.com/course/coursera-la-solucion-del-conflicto-etico-4639"},{"title":"Successful Career Development","about":"No matter the professional level, we can all benefit from learning how to succeed in our careers. Whether a well-seasoned professional, a management trainee, or a service level employee, this course will help you enrich your career by honing your professional behavior and networking.\n\nThrough industry expert support and resources, this course is designed to prepare you for success in any chosen career. You will develop the habits and attitudes you need to perform effectively in the job market. You will identify a mentor to add value to your career. You will analyze your relationships and develop a practical approach for engaging your LinkedIn network. You will differentiate between networking and networking with intention. You will also discover the most effective ways to ask for help from your peer or professional group. Finally, you will evaluate the best methods of adjusting your career path at various stages of life.","tutor":"Dan Stotz, Elke M Leeds, Ph.D., Ana T. Baida, Ed.D. and Wes Rhea, J.D.","provider":"Coursera","language":"English","skills":["usa","north america"],"subject":"Career Development","studentsInterested":"234","courseLink":"https://www.coursera.org/learn/career-advancement","classCentralLink":"https://www.class-central.com/course/coursera-successful-career-development-7018"},{"title":"Excel aplicado a los negocios (Nivel Avanzado)","about":"Objetivos Generales: Al finalizar el curso, podrás:\n\n1.- ENTENDER y profundizar convenientemente aspectos específicos de diferentes formas de trabajo (individual o grupal),\n2.- EVALUAR el uso de funciones avanzadas para manipular datos y CREAR tus propios análisis utilizando técnicas específicas tales como tablas dinámicas, análisis de hipótesis, administración de escenarios, tablas de simple y doble entrada, análisis de optimización de recursos.\n3.- ANALIZAR cómo vincular Excel con otras aplicaciones importando información desde archivos de texto y bases de datos, exportando información a archivos de texto de diversas formas.\n4.- ENTENDER el uso de macros lo que te permitirá vislumbrar otro universo de aplicaciones que harán mucho más productiva tu labor.\n\nLos ejemplos sobre los cuales se apoyan los contenidos dictados por los profesores, tienen una profunda aplicabilidad al mundo de los negocios, con lo que su inmediata utilización empresarial está al alcance de la mano.\nFinalmente, los profesores que han diseñado y elaborado este curso para ti, no solamente dan una visión académica de los usos avanzados del software, sino que, debido a su gran trayectoria profesional apoyada justamente en un uso intensivo y profundo de Excel, te transmitirán su propia vivencia, lo cual te permitirá tener una visión más concreta de las posibilidades que te brinda esta herramienta.","tutor":"Jorge Lardizabal and Paola Serafini","provider":"Coursera","language":"Spanish","skills":["business","microsoft excel","new-moocs-2017"],"subject":"Career Development","studentsInterested":"30","courseLink":"https://www.coursera.org/learn/excel-aplicado-negocios-avanzado","classCentralLink":"https://www.class-central.com/course/coursera-excel-aplicado-a-los-negocios-nivel-avanzado-9571"},{"title":"Excel Skills for Business: Advanced","about":"Spreadsheet software remains one of the most ubiquitous pieces of software used in workplaces around the world. Learning to confidently operate this software means adding a highly valuable asset to your employability portfolio. Across the globe, millions of job advertisements requiring Excel skills are posted every day. At a time when digital skills jobs are growing much faster than non-digital jobs, completing this course will position you ahead of others, so keep reading.\n\nIn this last course of our Specialization Excel Skills for Business you will build on the strong foundations of the first three courses: Essentials, Intermediate I + II. In the Advanced course, we will prepare you to become a power user of Excel - this is your last step before specializing at a professional level. The topics we have prepared will challenge you as you learn how to use advanced formula techniques and sophisticated lookups. You will clean and prepare data for analysis, and learn how to work with dates and financial functions. An in-depth look at spreadsheet design and documentation will prepare you for our big finale, where you will learn how to build professional dashboards in Excel.","tutor":"Dr Yvonne Breyer","provider":"Coursera","language":"English","skills":["business","microsoft excel","new-moocs-2017"],"subject":"Career Development","studentsInterested":"200","courseLink":"https://www.coursera.org/learn/excel-advanced","classCentralLink":"https://www.class-central.com/course/coursera-excel-skills-for-business-advanced-9639"},{"title":"Excel Skills for Business: Intermediate II","about":"Spreadsheet software remains one of the most ubiquitous pieces of software used in workplaces across the world. Learning to confidently operate this software means adding a highly valuable asset to your employability portfolio. In this third course of our Excel specialization Excel Skills for Business you will delve deeper into some of the most powerful features Excel has to offer. When you have successfully completed the course you will be able to\n\nCheck for and prevent errors in spreadsheets;\nCreate powerful automation in spreadsheets;\nApply advanced formulas and conditional logic to help make informed business decisions; and\nCreate spreadsheets that help forecast and model data.\n\nOnce again, we have brought together a great teaching team that will be with you every step of the way. Nicky, Prashan and myself will guide you through each week. As we are exploring these more advanced topics, we are following Alex who is an Excel consultant called in by businesses that experience issues with their spreadsheets.","tutor":"Dr Yvonne Breyer","provider":"Coursera","language":"English","skills":["business","microsoft excel","new-moocs-2017"],"subject":"Career Development","studentsInterested":"184","courseLink":"https://www.coursera.org/learn/excel-intermediate-2","classCentralLink":"https://www.class-central.com/course/coursera-excel-skills-for-business-intermediate-ii-9641"},{"title":"Influencing People","about":"This course will improve your ability to influence people in situations where you cannot use formal authority. You will learn about effective ways to build, develop, and sustain a power base in your organization. You will also learn influence tactics that enable you to be more persuasive and influential in working with your superiors, peers, and even subordinates. In addition, you will learn how to build and maintain high-quality relationships to further maximize your informal power and ability to influence others. Importantly, you will distinguish between influence and manipulation and learn how to protect yourself from the unwanted influence of others.\n\nThe influence strategies you learn in this course will make you a more confident and influential leader, presenter, and decision-maker. You will more effective in pitching business ideas to your superiors, influencing customers, and building coalitions across stakeholders. This course will not only give you strategic guidance on how to develop and maintain your network for influence and power, but we will also equip you with specific tactics and strategies that are proven to work for gaining power and influencing people.","tutor":"Scott DeRue, Ph.D. and Maxim Sytch, Ph.D.","provider":"Coursera","language":"English","skills":["influence","usa","north america"],"subject":"Communication Skills","studentsInterested":"1.6k","courseLink":"https://www.coursera.org/learn/influencing-people","classCentralLink":"https://www.class-central.com/course/coursera-influencing-people-4243"},{"title":"Career Success Project","about":"The purpose of the Capstone Project in the Career Success Specialization is for you to apply the methods and techniques you learned in the series of courses to a personal experience, giving you a way to communicate your value to potential employers. You’ll focus your communication, management, negotiation, problem solving, business writing, time management, finance, entrepreneurship, and project management skills into a single project that demonstrates your career readiness.\n\nUpon completing this course, you will be able to:\n1. Apply the methods, techniques and skills you have learned throughout the Specialization to add value, every day, to your organization by effectively gathering, synthesizing, analyzing and presenting information\n2. Develop and hone your critical thinking skills as you evaluate ideas, concepts, approaches and assumptions to arrive at a practical, yet innovative, solution to an organizational problem\n3. Learn to skillfully use a powerful strategic planning tool\n4. Effectively communicate information, ideas, problems and solutions to senior-level decision makers","tutor":"Margaret Meloni, Dave Nagy, Patricia Bravo, MBA, SPHR , David Standen, Rob Stone and Sue Robins, M.S. Ed.","provider":"Coursera","language":"English","skills":["career planning","success","usa","north america"],"subject":"Career Development","studentsInterested":"32","courseLink":"https://www.coursera.org/learn/career-success-capstone","classCentralLink":"https://www.class-central.com/course/coursera-career-success-project-5099"},{"title":"Career Options: Exploring a New Career","about":"This course is for you if you are interested in researching a new career and acquiring the skills necessary to succeed in it. You will be asked to reflect on your experiences and critically evaluate what you currently know, what you need to acquire, and how to go about getting it. You will then identify groups and individuals that can serve and support you in exploring a new career. During this course, you will identify the elements of a well-structured career plan and evaluate career options by individual fit to determine how to effectively engage your network in your career journey.\n\nYou will design a tactical career plan and identify pitfalls in behavior, communication and appearance that can derail a new career. You will also develop a targeted cover letter and resume using a proven business format. Your experiential learning can also be a valuable asset, linking your personal experiences with your chosen career. We will help you define your career objective statement and align this with your strengths and goals. Finally, you will be challenged to research and identify your personal values inventory, and evaluate how to best navigate the current job market by using an innovative approach called career rockclimbing.","tutor":"Elke M Leeds, Ph.D., Ana T. Baida, Ed.D., Wes Rhea, J.D. and Dan Stotz","provider":"Coursera","language":"English","skills":["usa","north america"],"subject":"Career Development","studentsInterested":"267","courseLink":"https://www.coursera.org/learn/career-exploration","classCentralLink":"https://www.class-central.com/course/coursera-career-options-exploring-a-new-career-7026"},{"title":"Personality Types at Work","about":"Knowing yourself, your team, your manager, and your organization are keys to personal and business success. What were once labeled soft skills are now modern requirements in today\u0027s workplace - especially if you are trying to get in the door or are already leading a team. This course is specifically designed for the:\n\n-Job Seeker: You will create a usable cover letter with feedback from your peers as well as develop exceptional responses to some of the most common, yet challenging interview questions. We will get you the skills to help get in the door!\n\n-Team Member: You will develop an action plan to confront your personality weaknesses and highlight your strengths so you can ace your annual review. We will also cover strategies that will help you uncover your true worth so you can ask with more confidence. We will get you the skills to get ahead!\n\n-Manager: You will create an effective action plan for an employee, team, or organization based on your new knowledge of personality types and you will create a 360 degree review plan to better identify your strengths and weaknesses. We will get you the skills to rise above the rest!\n\nWe will dive deep into the types and teach you how to translate your new knowledge into business success by leveraging personality and emotional intelligence in the workplace - wherever you may be! Join us!","tutor":"Toni Ratliff","provider":"Coursera","language":"English","skills":["usa","north america"],"subject":"Personal Development","studentsInterested":"259","courseLink":"https://www.coursera.org/learn/personality-types-at-work","classCentralLink":"https://www.class-central.com/course/coursera-personality-types-at-work-7021"},{"title":"Mi Primer Empleo (MPE)","about":"¿Qué debo tener en cuenta en mi primer empleo? El curso \"Mi Primer Empleo\" (MPE) te ayudará a enfrentar con éxito el tránsito entre tu formación profesional y el mundo del trabajo. Los objetivos de aprendizaje de este curso son:\n\n• Identificar las expectativas laborales personales actuales y futuras.\n• Preparar el curriculum vitae y la entrevista de trabajo.\n• Gestionar la huella digital.\n\nEl MPE abordará los siguientes tópicos:\n\n• MI PROYECTO LABORAL: lo que puedo hoy y lo que deseo para el futuro.\n• PARA CADA OFERTA LABORAL, UN CURRICULUM: Construyendo e Intencionado el Curriculum Vitae.\n• EL PRIMER ENCUENTRO: cómo preparar la entrevista laboral.\n• LA VIDA PERSONAL, LABORAL E INTERNET: Gestionando la Huella Digital.\n\nEste curso es parte del proyecto Erasmus + \"MOOC MAKER\": Construcción de Capacidades de Gestión de MOOCs en la Educación Superior. Más información visitar: http://www.mooc-maker.org/","tutor":"Rodolfo Chiple and Oscar Jerez","provider":"Coursera","language":"Spanish","skills":["job skills","career development","new-moocs-2017"],"subject":"Career Development","studentsInterested":"9","courseLink":"https://www.coursera.org/learn/mi-primer-empleo","classCentralLink":"https://www.class-central.com/course/coursera-mi-primer-empleo-mpe-9375"},{"title":"Teamwork Skills: Communicating Effectively in Groups","about":"Effective teamwork and group communication are essential for your professional and personal success. In this course you will learn to: make better decisions, be more creative and innovative, manage conflict and work with difficult group members, negotiate for preferred outcomes, improve group communication in virtual environments, develop a better overall understanding of human interaction, and work more effectively as a team. Our goal is to help you understand these important dynamics of group communication and learn how to put them into practice to improve your overall teamwork.","tutor":"Matthew A. Koschmann, PhD","provider":"Coursera","language":"English","skills":["communication","teamwork","collaboration"],"subject":"Communication Skills","studentsInterested":"102","courseLink":"https://www.coursera.org/learn/teamwork-skills-effective-communication","classCentralLink":"https://www.class-central.com/course/coursera-teamwork-skills-communicating-effectively-in-groups-9661"},{"title":"Digital Skills: Retail","about":"Understand how digital technology is changing retail\nDigital technology is transforming the world of retail. You’ll learn about the impact of this transformation, from data transforming customer experiences and operations, to the increasing impact of connected devices and automation.\nYou will also look ahead, asking what the different concepts and technologies mean for the future of retail and for those that work in this industry.\nThis course is for anyone seeking to develop their entrepreneurial skills, preparing to enter the workplace or looking to change careers. No prior experience or qualifications required.\nInterested in growing your digital skills more widely? Discover more Digital Skills courses from Accenture.","tutor":"Simon Blosse","provider":"FutureLearn","language":"English","skills":["digital skills","technology","retail"],"subject":"Career Development","studentsInterested":"22","courseLink":"https://www.futurelearn.com/courses/digital-skills-retail","classCentralLink":"https://www.class-central.com/course/futurelearn-digital-skills-retail-9781"},{"title":"Converting Challenges into Opportunities","about":"In a very competitive workplace, demonstrating your ability to turn challenges into opportunities is an important to way stand out to hiring managers and to your existing management/leadership. In this course, you will learn how to utilize the knowledge and skills needed to leverage left- and right-brain thinking, analyze problems, spur creativity, and implement innovative ideas for your workplace. Using the power of design thinking and Creative Problem Solving models you will work toward data-driven solutions to workplace challenges. You will engage in an active process of identifying/defining a specific challenge, generating a plan to address the challenge, collecting and analyzing data/information in order to sell your solution to your leadership, implementing your data-driven solution, and evaluating success of the solution.\n\nCourse Outcomes:\n1. Understand Design, out-of-the box, whole brain thinking, Your workplace strengths\n2. Apply Qualitative and scientific research method for workplace problems, Setting priorities and analyzing for outcomes\n3. Apply Creative problem solving and creative thinking, using creative techniques to overcome challenges and bring about innovation\n4. Create Action plan, Learn to implement innovative ideas and present ideas","tutor":"Drew Dougherty and Josh Shapiro, PhD","provider":"Coursera","language":"English","skills":["opportunities","self help","challenge","new-moocs-2017"],"subject":"Self Improvement","studentsInterested":"363","courseLink":"https://www.coursera.org/learn/converting-challenges-into-opportunities","classCentralLink":"https://www.class-central.com/course/coursera-converting-challenges-into-opportunities-9142"},{"title":"Trabajar para ser feliz","about":"En nuestra vida diaria nos movemos a toda velocidad por diferentes escenarios: la familia, el trabajo, la vida social.\nMuchas veces podemos quedar atrapados en la vorágine o en la rutina del día a día y olvidarnos de algo importante y que da sentido a todo lo que hacemos: cómo ser felices y cómo hacer felices a los que nos rodean en casa y en el trabajo.\nHoy en día existe una confusión, porque estamos muy centrados en el “bienestar”. Vivimos en una cultura que tiende al consumismo, al activismo y nos olvidamos del “bienser”, entendido como ese sentido de plenitud que lleva a sentirse bien con uno mismo y con su entorno.\nEl trabajo ocupa muchas horas del día y tantas veces es fuente de preocupaciones. Nos preocupa más el bono, la evaluación de desempeño, los reconocimientos externos que nos dan cierto status y tranquilidad económica, pero nos olvidamos de lo verdaderamente importante: estar bien con uno mismo y compartir esta felicidad con las personas que queremos.\nEste curso te permitirá entender mejor esos escenarios donde se desarrolla tu vida y te dará herramientas e ideas para que puedas construir tu propio proyecto personal para alcanzar una vida plena de sentido en el mundo actual.\nLo hemos preparado un grupo de profesores con la ilusión de ayudarte a reflexionar y ojalá que tu aprendizaje puedes compartirlo con otros, tanto en el trabajo como en casa.\nTe invitamos a sumarte y recorrer juntos este camino de aprendizaje compartido.","tutor":"Alberto Willi, Patricia Debeljuh, Rodolfo Rivarola, María Elena Ordóñez y Revuelta, Germán Debeljuh and Omar Rodriguez","provider":"Coursera","language":"Spanish","skills":["work life balance","happiness","new-moocs-2017"],"subject":"Self Improvement","studentsInterested":"36","courseLink":"https://www.coursera.org/learn/familia-trabajo-sociedad","classCentralLink":"https://www.class-central.com/course/coursera-trabajar-para-ser-feliz-9572"},{"title":"Advanced Interviewing Techniques","about":"People interviewing for jobs today often fail because they are using yesterday\u0027s strategies. Recruiting technology has become more sophisticated, and the best employers are constantly changing the way interviews are done. This course gives you detailed strategies for handling tough competency-based, or behavioral, interviews so that you can communicate the knowledge, skills, and abilities that you have and that employers demand.\n\nYou will be able to:\n\n1. Identify what the hiring organization is looking for in using behavioral interviewing techniques.\n\n2. List the steps in the S.T.A.R. response strategy and apply the steps, using reasonably correct language, to respond to behavioral interview questions.\n\n3. Use your responses to behavioral and competency-based questions to communicate your personal values.\n\n4. Identify what the hiring organization is looking for in asking situational and wild-card interview questions.\n\n5. List the steps in the P.R.E.P. and 5 W\u0027s response strategies and apply the steps, using reasonably correct language, to answer at least one wild-card and two situational interview questions.\n\n6. Develop an optimal strategy for responding to the weaknesses question, based on recognizing why a hiring organization asks these questions.\n\n7. Demonstrate your personal strengths and maturity through your responses to the weaknesses question.\n\n8. Correctly apply hedging language to soften a negative and boosting language to emphasize a positive aspect of your professional and/or academic background.\n\n9. Ask questions to determine how well an organization fits with your personality, career goals and salary objectives.\n\n10. Ask questions that communicate your competencies and strengths.\n\n11. Negotiate the best job offer and compensation package for yourself.\n\n12. Perform successfully on telephone interviews.","tutor":"Charles Duquette and Daniela Wagner","provider":"Coursera","language":"English","skills":["job interview","star","prep","5w","usa","north america"],"subject":"Career Development","studentsInterested":"1.6k","courseLink":"https://www.coursera.org/learn/interview-techniques","classCentralLink":"https://www.class-central.com/course/coursera-advanced-interviewing-techniques-5494"},{"title":"Engaging in Persuasive and Credible Communication","about":"In \"Engaging in Persuasive and Credible Communication\", you will learn the key skill of persuasion, in the context of professional communication in a globalised world.\n\nPersuasive communication is essential to any professional workplace. From a simple email request for your colleague to help you, to developing a presentation for the board of directors, these are acts of communication that require a good degree of persuasion. Even the process of entering the workforce requires effective persuasive communication, for in the act of writing your resume, cover-letter, or in the interview process, you are essentially persuading the potential employer to hire you.\n\nBy the end of this course, you will be able to structure and express your ideas in a convincing and persuasive manner in writing, apply basic principles of persuasive writing to convince different sets of audiences at the globalised workplace, and learn to engage in persuasive and credible communication across different cultures in a complex globalised environment.","tutor":"Derrick Ng","provider":"Coursera","language":"English","skills":["communication","asia","persuasion","singapore"],"subject":"Communication Skills","studentsInterested":"298","courseLink":"https://www.coursera.org/learn/persuasive-communication","classCentralLink":"https://www.class-central.com/course/coursera-engaging-in-persuasive-and-credible-communication-5538"},{"title":"Designing Your Personal Weight Loss Plan","about":"This 5 week course will guide learners through the essential steps in planning an individualized weight loss program. There is no guarantee of weight loss through completing the course; learners will have the framework and essential components for an evidence-based weight loss program. This course is intended for healthy adults who do not have any chronic disease such as diabetes, high blood pressure, heart disease, lung disease or any others. In addition, this course does not provide information for people who have food allergies or intolerances.\n\nLosing weight and keeping it off requires planning and goal-setting. Crash diets or fad diets are ineffective and can be dangerous. This course provides evidence-based information for planning a weight loss program that is safe and effective in producing a one to two pound loss per week.\n\nThis course will help learners establish the following:\n\n1. A realistic goal weight with a specific plan for rate of weight loss and time frame for achieving goal weight.\n2. A realistic goal for the frequency, duration, and intensity of exercise that will enable the learner to achieve and maintain the goal weight.\n3. A specific set of strategies for grocery shopping, eating in restaurants, eating at social occasions, and dealing with hunger and emotional eating.\n4. A plan for monitoring food intake, exercise and weight loss.\n5. A plan for continued evaluation of progress to goals and strategies for adjusting goals for continued weight loss for the next 6 months or longer.\n6. A thorough understanding of the difficulty of maintaining weight loss and a plan for maximizing the chances of keeping off the weight lost.","tutor":"Mary Beth Kavanagh","provider":"Coursera","language":"English","skills":["usa","north america"],"subject":"Personal Development","studentsInterested":"189","courseLink":"https://www.coursera.org/learn/weight-loss-plan","classCentralLink":"https://www.class-central.com/course/coursera-designing-your-personal-weight-loss-plan-7022"},{"title":"Digital Footprint","about":"If I Googled you, what would I find?\n\nAs we move around the online world we leave tracks and traces of our activity all the time: social media accounts, tagged images, professional presences, scraps of text, but also many artefacts we don\u0027t always realise we are leaving behind, or that others leave about us.\n\nIn this course you will hear from a range of experts and you will have an opportunity to explore and reflect on your own online tracks and traces, to understand why your digital footprint is important. We will introduce you to some of the tools and approaches to effectively manage your online presence (or digital footprint).\n\nThe course will focus on the different dimensions of a digital footprint, including developing an effective online presence, managing your privacy, creating opportunities for networking, balancing and managing professional and personal presences (eprofessionalism). By the end of this course (MOOC) you should be equipped to ensure that your digital footprint works for you, whether you want to be more private online, or are looking to create a more effective and impactful presence.\n\nYou can also join the conversation on Twitter using the hashtag #DFMOOC and follow us @DFMOOC\n\nWe hope you enjoy the course!","tutor":"Louise Connelly and Nicola Osborne","provider":"Coursera","language":"English","skills":["new-moocs-2017"],"subject":"Career Development","studentsInterested":"58","courseLink":"https://www.coursera.org/learn/digital-footprint","classCentralLink":"https://www.class-central.com/course/coursera-digital-footprint-8277"},{"title":"The Arts and Science of Relationships: Understanding Human Needs","about":"This course provides an introduction to:\n1. Basic concepts of The Strategies and Skills Learning and Development System (SSLD), their relevance for every day relationships and provide advanced concepts for participants who work in fields of social work and health care .\n2. Basic practice principles and methods of SSLD, illustrated by relationship management case studies.\n3. The SSLD framework for relationship management assessment; N3C (needs, circumstances, characteristics, capacity) and problem translation.\n4. Core competencies in the relationship management application of the SSLD system: Observation learning, simulation, real life implementation, review and monitoring.","tutor":"A. Ka Tat Tsang","provider":"Coursera","language":"English","skills":["new-moocs-2017"],"subject":"Personal Development","studentsInterested":"578","courseLink":"https://www.coursera.org/learn/human-needs","classCentralLink":"https://www.class-central.com/course/coursera-the-arts-and-science-of-relationships-understanding-human-needs-8253"},{"title":"Translation in Practice","about":"This course offers you basic but valuable techniques used by a good translator in the translation between English and Chinese. We’ll discuss what is translation, what is good translation, and learn about how to produce good translations.\n\nAll the examples used in this course are taken from the course instructor\u0027s own translations of various genres and topics of writing. These examples are elaborated on to show you how to understand the idea, style and tone of the writer, the historical and cultural context of the writing, as well as the explicit and implied meanings of words, the grammatical structures of sentences, and the logic of sentences and paragraphs in order to achieve faithfulness, expressiveness, and elegance in the translation.\n\nAfter completing this course, you will know what makes a qualified professional translator and acquire the abilities and skills that such a translator needs","tutor":"Yuan Yao","provider":"Coursera","language":"English","skills":["english","chinese language","translation studies"],"subject":"Communication Skills","studentsInterested":"62","courseLink":"https://www.coursera.org/learn/translation-in-practice","classCentralLink":"https://www.class-central.com/course/coursera-translation-in-practice-9775"},{"title":"職場素養 (Professionalism)","about":"介紹國際職場素養的內涵及相關課題，培育學生應有的職場視野與能力，便利學生融入職場環境，迅速自新手成為高手，裕如地發揮所學與所長。","tutor":"陳 嫦芬","provider":"Coursera","language":"Chinese","skills":["asia","taiwan"],"subject":"Communication Skills","studentsInterested":"30","courseLink":"https://www.coursera.org/learn/zhichang-suyang","classCentralLink":"https://www.class-central.com/course/coursera--professionalism-2369"},{"title":"Strategic Career Self-Management","about":"According to the U.S. Bureau of Labor Statistics, in the current economy, Americans shift jobs every 4-5 years, which translates into 8-10 job transitions, including several career changes, over one’s life time. With competition for jobs on the rise, a person’s continuing employability and career success are increasingly defined by his or her mastery of individual career development and the ability to effectively \"manage oneself\" (P. Drucker).\n\nIn this course, you will learn how to think strategically and professionally about your career self-management. Through this course you\u0027ll develop an objective, external view of your marketable skills as a solid foundation for building a strong career brand. In particular, you\u0027ll be able to:\n\n- explain why developing a protean and boundaryless career perspective based on transferable (portable) skills is advantageous for continuing employability and career growth;\n- design your portable skills portfolio, identify and examine critically important competencies underpinning your transferable skills, and analyze your career self-management competency gaps;\n- increase self-awareness, pinpoint your career goals, and envision your future work self;\n- recognize the central role of self-management for developing transferable, marketable, skills and create a customized self-management information system (Career Development Lab) for ongoing personal development and professional growth;\n- conduct a thorough, competency-based job analysis in your area of interest and examine practices of evidence-based, data-driven competitive employee selection;\n-implement your newly developed skills for crafting effective selection criteria statements and refining your job applications.","tutor":"Michele Forte, Dr. Kymn Harvin Rutigliano , Amy Giaculli, Dr. Valeri Chukhlomin, Dr. Tonka Jokelova and Dr. John M. Beckem II","provider":"Coursera","language":"English","skills":["self-management","career development","usa","north america"],"subject":"Career Development","studentsInterested":"294","courseLink":"https://www.coursera.org/learn/strategic-career-self-management","classCentralLink":"https://www.class-central.com/course/coursera-strategic-career-self-management-5457"},{"title":"Las estrategias y habilidades para las negociaciones","about":"En este cuarto y último curso estudiaremos y analizaremos las estrategias, herramientas y criterios para dar efectividad al proceso de las negociaciones. También se propondrá el empleo del concepto de áreas de efectividad y orientación a resultados, que facilitará la definición de objetivos específicos y cuantificables para planear estratégicamente nuestra negociación con el empleo del establecimiento de los máximos aceptables y mínimos que cada propuesta de solución presenta para un manejo efectivo de las concesiones, intercambios y toma de decisiones, con el fin de lograr acuerdos compartidos. Finalmente se establecerá una visión futura de creación de valor, sobre el acuerdo para continuar en el tiempo obteniendo beneficios compartidos.","tutor":"Fernando Guerra","provider":"Coursera","language":"Spanish","skills":["negotiation","mexico","north america"],"subject":"Communication Skills","studentsInterested":"42","courseLink":"https://www.coursera.org/learn/estrategias-negociacion","classCentralLink":"https://www.class-central.com/course/coursera-las-estrategias-y-habilidades-para-las-negociaciones-5464"},{"title":"Introducción al mundo de las negociaciones","about":"En este primer curso, los participantes conocerán el proceso de una negociación, la naturaleza de uno mismo (capacidades y potencialidades) y la de los oponentes, para establecer negociaciones efectivas, en donde se establece una dinámica de propuestas y transacciones racionales y emocionales, en el marco de la globalización, para generar un ambiente de negociación y cooperación creativa, para diseñar estrategias para lograr resultados de negociación, diseñar argumentos para negociar, saber escuchar y comunicarse y convenir en un intercambio de los recursos y bienes en juego, favorable a los intereses de ambas partes. .","tutor":"Fernando Guerra","provider":"Coursera","language":"Spanish","skills":["negotiation","mexico","north america"],"subject":"Communication Skills","studentsInterested":"44","courseLink":"https://www.coursera.org/learn/estrategias-de-negociacion","classCentralLink":"https://www.class-central.com/course/coursera-introduccion-al-mundo-de-las-negociaciones-5483"},{"title":"Психология призвания","about":"Об этом курсе\n\nЭто курс по психологии, но не для специалистов по психологии, а для людей, стремящихся сделать свою жизнь, жизнь своих близких или даже жизнь своих предприятий наполненной призванием, контролем, подлинностью и точностью. Феномен призвания неизменно интересен всем, кто изучал и изучает проблемы мотивации, счастья, лидерства.\nВ основе курса лежит идея о первичности целого, хорошего, настоящего, о том, что плохое – это испорченное хорошее, и мы можем возвращаться к хорошему, то есть к целому, воспитывая в себе и в других чувствительность к призванию.\n\nПрактический смысл курса\n\nВ современном мире, ставшем в некоторых социальных направлениях очень тесным, жестким жить по призванию становится не только желательно, но и необходимо.\nПрагматический смысл изучения психологии можно свести к проблеме мотивации. Мотивация бывает разного качества. Если вы понимаете, как возникает и сохраняется мотивация, вы владеете ситуацией. Если мотивация для вас – неизвестность, случайность, сомнение и пр., то ситуация владеет вами. Данный курс способствует опыту осознания решающих точек вашего возможного «возвышения до человека» и «падения до человека»\n\nЦели курса\n\nДанный курс построен на диалектике призвания и принуждения. Нечувствительность к призванию ведет к принуждению, длящемуся до тех пор, пока чувствительность к призванию не будет восстановлена. Эта закономерность справедлива для самых разных уровней человеческого диалога с миром. Кем бы вы ни были: родителями, воспитателями, преподавателями, руководителями, тренерами, командирами, супругами, для вас будет полезным точно понимать: что такое призвание и принуждение, как они появляются и проявляются в вашей жизни.\nПроявления жизни по призванию - это обновление, жизнестойкость, инициатива, талант, эффективность. Но мы не всегда в достаточной степени чутки, открыты к призванию. Этот курс направлен на то, чтобы развить Вашу чувствительность к интонациям призвания и принуждения в жизни вообще и в конкретных делах в частности.","tutor":"Анастасия Стайпек and Олег Лукьянов","provider":"Coursera","language":"Russian","skills":["new-moocs-2017"],"subject":"Personal Development","studentsInterested":"6","courseLink":"https://www.coursera.org/learn/psykhologiya-prizvaniya","classCentralLink":"https://www.class-central.com/course/coursera---8557"},{"title":"Creativity Toolkit II: Creative Collaboration","about":"Creativity requires us to collaborate with others. This course is designed to make you a better creative collaborator. Creativity can require us to bring together knowledge from different areas, often known by different people. We need to foster effective collaboration rather than have those differences lead to misunderstandings and conflict. The ideas that we generate, individually or collectively, will be evaluated by others, such as bosses, funders, and customers. These audiences will likely have different concerns when they hear about your ideas and are likely to evaluate ideas differently than you do. We need to pitch our ideas in ways that get others excited about them, rather than bored or confused, so that we can expand the group of collaborators in our creative efforts.","tutor":"Jeffrey Loewenstein and Jack Goncalo","provider":"Coursera","language":"English","skills":["creativity","collaboration","new-moocs-2017"],"subject":"Personal Development","studentsInterested":"67","courseLink":"https://www.coursera.org/learn/creativity-toolkit-2","classCentralLink":"https://www.class-central.com/course/coursera-creativity-toolkit-ii-creative-collaboration-8735"},{"title":"Networking and Volunteerism for Career Success","about":"In a very competitive workplace, establishing, growing, and leveraging your professional community can make all the difference as you search for your initial work opportunity, improve satisfaction at your current job, or find your next work adventure. In this course, you will learn how to tap into your existing personal and professional networks to find your tribe and then leverage your professional community for your benefit (and sometimes the benefit of your employer!). Given that job satisfaction and job opportunities, are often integrally intertwined with “doing good,” you will engage in an introspective exercise evaluating your interests and values so you can incorporate those ideals into your work. Finally, you will understand how service experiences can be extremely valuable in growing your professional community and contributing to company success.","tutor":"Jess Yuen and Gretchen Laue","provider":"Coursera","language":"English","skills":["networking","career planning","volunteering"],"subject":"Career Development","studentsInterested":"42","courseLink":"https://www.coursera.org/learn/networking-volunteerism-career-success","classCentralLink":"https://www.class-central.com/course/coursera-networking-and-volunteerism-for-career-success-9670"},{"title":"Interview Research and Preparation","about":"This course, the first in the \"Interviewing and Resume Writing in English\" specialization, guides you to discover the interests, talents and competencies that you can use to find and do work that leverages your strengths, passions and who you are as a person, so you can start doing work that matters to you and to the world. Whether you already have a career and are looking to move forward, whether you’re looking to change careers, whether you’re starting out in the world of work, whether you’re coming back into the world of work after some time away – this course will help you see your path more clearly and will teach you how to communicate your value to an employer in a way that he or she can immediately recognize.\n\nAfter completing this course, you will be able to 1) use your individual cognitive, social and emotional traits, together with areas of interest, to discover how to find the future jobs that can give you the greatest satisfaction; 2) identify transferable skills of greatest value to the employers who have the jobs you’re interested in; 3) apply a simple strategy for presenting your skills to an employer in an effective and convincing fashion.","tutor":"Charles Duquette","provider":"Coursera","language":"English","skills":["job interview","preperation","usa","north america"],"subject":"Career Development","studentsInterested":"1.7k","courseLink":"https://www.coursera.org/learn/interview-preparation","classCentralLink":"https://www.class-central.com/course/coursera-interview-research-and-preparation-5465"},{"title":"Writing Winning Resumes and Cover Letters","about":"How can you bring your resume to the top of the pile? How can you present yourself to prospective employers using the language they already speak inside their organization? This course will give you answers to those questions. You will learn how to convert a boring resume into a dynamic asset statement that conveys your talents in the language that an employer understands.\n\nAfter completing this course, you will be able to:\n\n1. Identify the real purpose of a resume.\n\n2. Identify relevant competencies for a position.\n\n3. Adapt your resumes to Applicant Tracking Systems (resume screening software).\n\n4. Write powerful and convincing accomplishment statements using your accomplishments inventory to strategically assemble the most relevant evidence of competency for a specific position.\n\n5. Use the resume skills tier method to strengthen your resume.\n\n6. Write summary sections and objective statements aligned to a job position.\n\n7. Take advantage of web resources to find power language for your resume.\n\n8. Produce a strong resume in a format that is suitable both to your background and the position you\u0027re interested in.\n\n9. Produce strong cover letters that use A.I.D.A. to help you achieve your career goals.\n\n10. Produce effective follow-up letters that help you stand out from the competition.","tutor":"Charles Duquette","provider":"Coursera","language":"English","skills":["resume","cv writing","usa","north america"],"subject":"Career Development","studentsInterested":"5.0k","courseLink":"https://www.coursera.org/learn/resume-writing","classCentralLink":"https://www.class-central.com/course/coursera-writing-winning-resumes-and-cover-letters-5477"},{"title":"Career Planning: A Pathway to Employment","about":"This course is designed to foster creative approaches to launching a new career. You will articulate best ways to make a first impression and analyze your strengths by creating a personal statement. You will identify appropriate elements to make your resume stand out from the crowd. You will also identify the most effective ways a cover letter can answer a job description, and how to best leverage social media in your job search. In short, this course will help you to prepare for a new job. You will learn how to apply, network, leverage social media, interview, follow-up, and evaluate options through research and with the help of experienced faculty and talented professional.\n\nLaunching Your Career provides insight from industry leaders on job search, networking and interviewing. You will receive guidance and best practice tips on how to master the interview and professionally close the loop. You will also compose a thank you note and clearly relate your ideal career to existing job titles and offers.","tutor":"Dan Stotz, Elke M Leeds, Ph.D., Ana T. Baida, Ed.D. and Wes Rhea, J.D.","provider":"Coursera","language":"English","skills":["usa","north america"],"subject":"Career Development","studentsInterested":"96","courseLink":"https://www.coursera.org/learn/career-planning","classCentralLink":"https://www.class-central.com/course/coursera-career-planning-a-pathway-to-employment-7024"},{"title":"Speaking to persuade: Motivating audiences with solid arguments and moving language","about":"In the professional realm, we need to be able to argue without being argumentative. Whether you are fundraising for a nonprofit, pitching a business proposal, or suggesting a change to company policy, you are making arguments. In making the case for your topic, you often want to raise awareness, identify a pressing problem, discuss appropriate solutions, and outline specific steps for the audience.\n\nTo be persuasive, you must be clear (the audience may have little to no existing knowledge), you must be convincing (you are trying to sway the audience that your argument is valid), and you must be compelling (you are trying to motivate the audience enough so that they want to take specific actions). Persuasive speaking thus requires clarity, strategy, topic mastery, plus a sense of style and presence.\n\nBy the end of this course, you should be able to design persuasive speeches that address problems and solutions and that motivate audience members. You should be able to use rhetorical style strategically and deliver passionate and compelling speeches. Learners will record speeches, providing and receiving peer feedback.","tutor":"Dr. Matt McGarrity","provider":"Coursera","language":"English","skills":["usa","north america","new-moocs-2017"],"subject":"Communication Skills","studentsInterested":"371","courseLink":"https://www.coursera.org/learn/persuade-speech","classCentralLink":"https://www.class-central.com/course/coursera-speaking-to-persuade-motivating-audiences-with-solid-arguments-and-moving-language-7461"},{"title":"Negotiation Fundamentals","about":"This course gives you access to negotiation practical tools and best practices gathered by Professor Aurélien Colson \u0026 his team from assignments in more than seventy countries and in a wide set of sectors, be they services, industry, high tech, or public organizations.\n\nIn an interactive manner, this course will help you, among other topics: get prepared for any negotiation; avoid traps; know how to prompt value-creating partnerships; structure an effective negotiation sequence; bargain in an efficient and respectful manner; overcome deadlocks; and much more!\n\nIndeed, negotiation is not simply about deciding who gets what now – it is first and foremost about creating productive, fair, and therefore long-term partnerships. This course guides you through innovative and proven approaches – “win-win…but not at any price”.\n\nTogether with its specialization, this course will lead you towards high impact and sustainable negotiations at all levels, whether finding solutions to people management issues, sealing a deal on a sales package, or entering into high-level strategic or political negotiations involving multi-party stakeholders.","tutor":"Aurélien Colson","provider":"Coursera","language":"English","skills":["europe","france","new-moocs-2017"],"subject":"Communication Skills","studentsInterested":"184","courseLink":"https://www.coursera.org/learn/negotiation-fundamentals","classCentralLink":"https://www.class-central.com/course/coursera-negotiation-fundamentals-8089"},{"title":"Achieving Your Optimal Performance","about":"In a very competitive workplace, outstanding performance, versus good performance, can make all the difference in opportunities for retention and advancement. Outstanding performance depends a great deal though on circumstances, the people you are interacting with, the task at hand, and your personality. Do you know what it takes to achieve your optimal performance?\n\nIn this course you will discover your optimal performance profile in order to turn any situation to your performance advantage. You will (1) learn the optimal performance model, (2) apply the model to your unique profile, (3) test the model via a practical case situation, and (4) articulate your ability to use the model career success.","tutor":"Bruce Dunn and Rich Mayhew","provider":"Coursera","language":"English","skills":["performance","competition","new-moocs-2017"],"subject":"Personal Development","studentsInterested":"331","courseLink":"https://www.coursera.org/learn/achieving-your-optimal-performance","classCentralLink":"https://www.class-central.com/course/coursera-achieving-your-optimal-performance-9138"},{"title":"Excel Skills for Business: Essentials","about":"In this first course of the specialization Excel Skills for Business you will learn the Essentials of Microsoft Excel. Within six weeks, you will learn to expertly navigate the Excel user interface, perform basic calculations with formulas and functions, professionally format spreadsheets, and create visualizations of data through charts and graphs.\n\nWhether you are self-taught and want to fill in the gaps for better efficiency and productivity, or whether you have never used Excel before, this course will set you up with a solid foundation to become a confident user and develop more advanced skills in later courses.\n\nWe have brought together a great teaching team that will be with you every step of the way. A broad range of practice quizzes and challenges will provide great opportunities to build up your skillset. Work through each new challenge with our team and in no time you will surprise yourself with how far you have come.\n\nSpreadsheet software is one of the most ubiquitous pieces of software used in workplaces across the world. Learning to confidently operate this software means adding a highly valuable asset to your employability portfolio. At a time when digital skills jobs are growing much faster than non-digital jobs, make sure to position yourself ahead of the rest by adding Excel skills to your employment portfolio.","tutor":"Dr Yvonne Breyer","provider":"Coursera","language":"English","skills":["business","microsoft excel","new-moocs-2017"],"subject":"Career Development","studentsInterested":"451","courseLink":"https://www.coursera.org/learn/excel-essentials","classCentralLink":"https://www.class-central.com/course/coursera-excel-skills-for-business-essentials-9638"},{"title":"Excel Skills for Business: Intermediate I","about":"Spreadsheet software remains one of the most ubiquitous pieces of software used in workplaces across the world. Learning to confidently operate this software means adding a highly valuable asset to your employability portfolio. In the United States alone, millions of job advertisements requiring Excel skills are posted every day. Research by Burning Glass Technologies and Capital One shows that digitals skills lead to higher income and better employment opportunities at a time when digital skills job are growing much faster than non-digital jobs.\n\nIn this second course of our Excel specialization Excel Skills for Business you will build on the strong foundations of the Essentials course. Intermediate Skills I will expand your Excel knowledge to new horizons. You are going to discover a whole range of skills and techniques that will become a standard component of your everyday use of Excel. In this course, you will build a solid layer of more advanced skills so you can manage large datasets and create meaningful reports. These key techniques and tools will allow you to add a sophisticated layer of automation and efficiency to your everyday tasks in Excel.\n\nOnce again, we have brought together a great teaching team that will be with you every step of the way. Prashan and Nicky will guide you through each week (and I am even going to make a guest appearance in Week 5 to help you learn about my favourite tool in Excel - shh, no spoilers!). Work through each new challenge step-by-step and in no time you will surprise yourself by how far you have come. This time around, we are going to follow Uma\u0027s trials and tribulations as she is trying to find her feet in a new position in the fictitious company PushPin. For those of you who have done the Essentials course, you will already be familiar with the company. Working through her challenges which are all too common ones that we encounter everyday, will help you to more easily relate to the skills and techniques learned in each week and apply them to familiar and new contexts.","tutor":"Dr Yvonne Breyer","provider":"Coursera","language":"English","skills":["business","microsoft excel","new-moocs-2017"],"subject":"Career Development","studentsInterested":"209","courseLink":"https://www.coursera.org/learn/excel-intermediate-1","classCentralLink":"https://www.class-central.com/course/coursera-excel-skills-for-business-intermediate-i-9640"},{"title":"Communication theory: bridging academia and practice","about":"This course is about communication on various levels. Over these 9 weeks we will cover a number of theories, cases and applications in the field of communication science. We will start with the foundational concepts of communication theory, defining what the theory is and going through a number of approaches to communication itself.\n\nEach week you will have a test to check on your progress and understanding. We also have a final text in the end of the course and a little bit of writing. As Oscar Wilde said, if you cannot write, you cannot think. If you cannot think, others will do thinking for you. So we find writing and reflecting pretty important for our classes. Along the course we provide you with in-class materials: lecture presentations, articles and additional readings. If you really want to get into the topic, don’t avoid this extra work.\n\nAlthough a substantial part of this course is theory-based, communication theory has a very practical application. Communication is an underlying process which creates and develops relationships, communities, societies. We communicative on a daily basis via a variety of means and channels. In our globalised and increasingly interconnected world, communication skills are essential in both the personal and professional spheres. It is our goal to leave you with a contextualisation and conceptualisation of communicative processes that will poise you to hone your own communicative skills — in other words, to put theory into practice.","tutor":"Olga Solovyeva and Maria Mordvinova","provider":"Coursera","language":"English","skills":["communication","communication theory"],"subject":"Communication Skills","studentsInterested":"18","courseLink":"https://www.coursera.org/learn/communicationtheory-academia-practice","classCentralLink":"https://www.class-central.com/course/coursera-communication-theory-bridging-academia-and-practice-9986"},{"title":"Introduction to Negotiation: A Strategic Playbook for Becoming a Principled and Persuasive Negotiator","about":"This course will help you be a better negotiator. Unlike many negotiation courses, we develop a framework for analyzing and shaping negotiations. This framework will allow you to make principled arguments that persuade others. It will allow you to see beneath the surface of apparent conflicts to uncover the underlying interests. You will leave the course better able to predict, interpret, and shape the behavior of those you face in competitive situations.\n\nIn this course, you will have several opportunities to negotiate with other students using case studies based on common situations in business and in life. You can get feedback on your performance and compare what you did to how others approached the same scenario. The cases also provide a setting to discuss a wide-ranging set of topics including preparing for a negotiation, making ultimatums, avoiding regret, expanding the pie, and dealing with someone who has a very different perspective on the world. Advanced topics include negotiating when you have no power, negotiating over email, and the role of gender differences in negotiation. To close out the course, we will hear insights from three negotiation experts: Linda Babcock, Herb Cohen, and John McCall MacBain. Enjoy.","tutor":"Barry Nalebuff","provider":"Coursera","language":"English","skills":["negotiation","usa","north america"],"subject":"Communication Skills","studentsInterested":"7.2k","courseLink":"https://www.coursera.org/learn/negotiation","classCentralLink":"https://www.class-central.com/course/coursera-introduction-to-negotiation-a-strategic-playbook-for-becoming-a-principled-and-persuasive-negotiator-4336"},{"title":"Successful Presentation","about":"Few kinds of communication can have the effect of a powerful presentation. Even a short speech can motivate people to change long-held beliefs or to take action, and a wonderfully delivered speech can transform a normal person into a leader.\n\nIn this course, Prof. William Kuskin provides a series of pragmatic videos and exercises for successful public speaking and presentations. The course develops through four themes—mastering fear, developing a creative formula, using verbal and body language, and anticipating the room—so that you can discover your personal power as a speaker and give excellent presentations.\n\nSuccessful presentations do not rely on perfect teeth, a deep voice, or an army of scriptwriters. They depend largely on the same skills as successful Business Writing and Graphic Design: clarity, structure, and revision. The goal of the course, therefore, is to enable you to discover your own internal power as a speaker and express it to the world. After this course, with some practice, you will be able to go into any situation and command the room for as long as you like.","tutor":"Professor William Kuskin","provider":"Coursera","language":"English","skills":["public speaking","communication","presentations","usa","north america"],"subject":"Communication Skills","studentsInterested":"489","courseLink":"https://www.coursera.org/learn/presentation-skills","classCentralLink":"https://www.class-central.com/course/coursera-successful-presentation-6596"},{"title":"International Travel Preparation, Safety, \u0026 Wellness","about":"Whether you\u0027ve traveled before or not, living and working overseas can be challenging. Learn how best to prepare and make the most of your time internationally.\n\nThis course will prepare you to work and live overseas. It explores the epidemiology of common morbidity and mortality among travelers and examines key prevention, safety, and travel medicine principles and services to contextualize risks and maintain wellness. The course reviews applicable interventions, appropriate vaccines, and personal protection methods to prepare you to respond to expected and unexpected situations and will challenge you to examine travel health and safety priorities through case studies and discussions.\n\nThe Honors Lesson will assist you with personal preparations for travel through the creation of a country-specific profile.","tutor":"Anna Kalbarczyk","provider":"Coursera","language":"English","skills":["new-moocs-2017"],"subject":"Personal Development","studentsInterested":"198","courseLink":"https://www.coursera.org/learn/international-travel","classCentralLink":"https://www.class-central.com/course/coursera-international-travel-preparation-safety-wellness-8782"},{"title":"Digital Discovery 1: Build Your Confidence Online","about":"Improve your confidence and make the most of the internet.\nIn Week 1 we explore your mindset towards learning new digital skills and discover strategies for overcoming fears and barriers. In Week 2 we explore techniques for protecting yourself and staying safe online.\nThis course is designed to act as a launch pad for novice digital users to build their online capability and versatility.\nTo take part in this course, you’ll need a computer and/or smart device (smart phone or tablet) and internet access.","tutor":"Marcus O\u0027Donnell","provider":"FutureLearn","language":"English","skills":["digital literacy","digital skills"],"subject":"Self Improvement","studentsInterested":"39","courseLink":"https://www.futurelearn.com/courses/digital-discovery-confidence-online","classCentralLink":"https://www.class-central.com/course/futurelearn-digital-discovery-1-build-your-confidence-online-11202"},{"title":"Communication in the 21st Century Workplace","about":"In today\u0027s fast-paced business environment, employees at all levels find themselves being asked to handle more tasks, meet more deadlines, take on more responsibilities, and adapt to more change. Added to these challenges is the constantly shifting diversity of the workplace, where coworkers cope with generational, gender, age and cultural differences. Communication, both verbal and nonverbal, is at the foundation of everything we do and say, and is especially important in the 21st century workplace. The good news is that communication is a learned skill, and can be improved upon with the right training. The focus of this course is to heighten students’ awareness of workplace communication, and add new interpersonal skills, with the end result of becoming a more competent communicator overall. Target areas include: the process and functions of communication, behavioral patterns, perceptions as reality, verbal and nonverbal cues and behaviors, confidence, assertiveness, tact, anger management, criticism and constructive feedback, conflict resolution, team building, leadership, interviewing, and communicating more effectively with technology (email, Skype, texting, etc.).\n\nUpon completing this course, you will be able to:\n1. Define communication and its role in the workplace\n2. Describe benefits of effective communication in the workplace\n3. Identify and explain most common audiences and techniques for communicating with each audience\n4. Identify and solve common obstacles to effective communication\n5. Summarize the 5 Step Technique and explain its usefulness in communicating with your manager\n6. Discuss the best approaches and communication techniques for delivering bad news to your manager\n7. Describe ways to make positive connections with your staff.\n8. Discuss techniques for deciphering the communication styles of executive managers\n9. Discuss techniques for identifying the characteristics and drivers of executive managers\n10. Discuss techniques for persuading executive management\n11. Identify best practices for working successfully with virtual/remote teams\n12. Apply proven techniques for effective conference calls and webinars","tutor":"Patricia Bravo","provider":"Coursera","language":"English","skills":["usa","north america"],"subject":"Communication Skills","studentsInterested":"752","courseLink":"https://www.coursera.org/learn/communication-in-the-workplace","classCentralLink":"https://www.class-central.com/course/coursera-communication-in-the-21st-century-workplace-2723"},{"title":"Negociações de sucesso: estratégias e habilidades essenciais (em Português)","about":"Todos nós negociamos diariamente. No nível pessoal, negociamos com amigos, família, proprietários do imóvel em que moramos, vendedores de carro, funcionários, entre outros. A negociação também é a chave para o sucesso nos negócios. Nenhuma empresa consegue sobreviver sem contratos lucrativos. Dentro de uma empresa, as habilidades de negociação podem levar a avanços na carreira.\n\nEste curso fornece uma introdução prática e holística às estratégias e habilidades que podem levar a negociações de sucesso na vida pessoal e nas transações de negócios. O curso cobre os quatro principais estágios da negociação: (1) planejamento, (2) negociação, (3) criação do contrato e (4) execução do contrato.\n\nCada estágio analisa as principais questões que você deverá estar preparado para responder em negociações futuras, como:\n• Quais são os principais elementos em uma análise de negociação, incluindo o preço de reserva fixado, a meta de expansão, alternativas para o negócio em questão e a zona de acordo potencial?\n• Que diretrizes devem ser seguidas ao confrontar questões de ética?\n• Qual é a sua fonte de poder nas negociações e como é possível aumentar o seu poder?\n• Quais ferramentas psicológicas podem ser usadas durante as negociações e quais armadilhas psicológicas devem ser evitadas?\n• Quais são as quatro principais questões de lei contratual que devem estar no checklist de negociação?\n• Quais conceitos e ferramentas podem ser usados ao resolver controvérsias?\n\nDurante o curso, você assistirá a uma série de pequenos vídeos (que vão de 5 a 20 minutos) sobre cada estágio da negociação. Os vídeos são interativos e incluem questões para testar o seu entendimento sobre estratégias e habilidades de negociação. O curso também inclui vídeos que dramatizam a arbitragem de uma controvérsia na área de construção e a mediação de uma controvérsia de software de robótica.\n\nDependendo do seu planejamento, pode assistir aos vídeos ao longo de algumas semanas ou pode assisti-los todos de uma vez. Um aluno que assistiu a todos os vídeos de uma vez concluiu que \"É uma série tão boa quanto Breaking Bad\".\n\nApós assistir aos vídeos sobre os quatro principais estágios da negociação, você poderá participar de uma negociação individual que testará as suas qualificações como negociador. Os vídeos finais do curso verificam a sua negociação e revisam os conceitos e as ferramentas tratados no curso. Você também receberá feedback sobre o que faz de melhor como negociador e como pode melhorar.\n\nThis is a translated version. To join the original English version, please visit this page: https://www.coursera.org/learn/negotiation-skills","tutor":"George Siedel","provider":"Coursera","language":"Portuguese","skills":["negotiation","usa","north america"],"subject":"Communication Skills","studentsInterested":"51","courseLink":"https://www.coursera.org/learn/negociacao","classCentralLink":"https://www.class-central.com/course/coursera-negociacoes-de-sucesso-estrategias-e-habilidades-essenciais-em-portugues-4217"},{"title":"Types of Conflict","about":"Conflict is everywhere and it is impossible to avoid conflicting viewpoints. However, not all conflict is bad, nor is it inherently negative. How conflict is handled makes all the difference. It is through proper identification and understanding of conflict that allows for effective resolutions, some of which may yield positive outcomes. In this course, we will examine the different types of conflict, how to understand and embrace the positive aspects of conflict, and how to successfully navigate conflict to positive resolution.\n\nThis course presents the material though video lessons, case studies, and interviews. In each module students will be presented with in-video quiz questions to test their understanding. To further their mastery of the content students will also be asked to complete two peer reviewed assignments.\n\nUpon completing this course, you will be able to:\n1. Identify the different types of conflict\n2. Illustrate the positive aspects of conflict\n3. Provide examples of positive ways to deal with conflict","tutor":"Najla DeBow","provider":"Coursera","language":"English","skills":["conflict resolution","usa","north america"],"subject":"Communication Skills","studentsInterested":"454","courseLink":"https://www.coursera.org/learn/types-of-conflict","classCentralLink":"https://www.class-central.com/course/coursera-types-of-conflict-4250"},{"title":"How to Write a Resume (Project-Centered Course)","about":"What you’ll achieve:\nIn this project-centered course*, you will craft an essential cornerstone of the modern-day job or internship search: the resume. You’ll review resume best practices and explore current trends with guidance from a professional career counselor and recruiter, and you’ll exchange structured feedback with your peers as you work to polish your own resume. When you complete the course, you’ll have an eye-catching resume that lets your professional strengths shine.\n\nWhat you’ll need to get started:\nThis course is designed primarily for young professionals or college students who are writing their first resume or looking to give an old resume a fresh and polished professional look. All job seekers will benefit from the course material and project, however, regardless of their career stage or professional background. All you will need is word processing software that allows you to create a resume on a computer- there are free tools available.\n\n*About Project-Centered Courses: Project-centered courses are designed to help you complete a personally meaningful real-world project, with your instructor and a community of like-minded supportive learners with similar goals providing guidance and suggestions along the way. By actively applying new concepts as you learn, you’ll master the course content more efficiently; you’ll also get a head start on using the skills you gain to make positive changes in your life and career. When you complete the course, you’ll have a finished project that you’ll be proud to use and share.","tutor":"Zach Slaybaugh","provider":"Coursera","language":"English","skills":["resume writing","usa","north america"],"subject":"Career Development","studentsInterested":"2.4k","courseLink":"https://www.coursera.org/learn/how-to-write-a-resume","classCentralLink":"https://www.class-central.com/course/coursera-how-to-write-a-resume-project-centered-course-5830"},{"title":"Habilidades humanas y de negocios para negociar","about":"En este curso los participantes analizarán los conceptos de efectividad de una negociación, que consiste en una interacción humana, y la satisfacción de los deseos e intereses en las negociaciones.\n\nTodos tenemos el deseo de mejorar y superarnos. La forma de lograrlo es conocerse a sí mismo y a las personas con las que se negocia o se interactúa.","tutor":"Fernando Guerra","provider":"Coursera","language":"Spanish","skills":["negotiation","communication","mexico","north america"],"subject":"Communication Skills","studentsInterested":"40","courseLink":"https://www.coursera.org/learn/habilidades-negociacion","classCentralLink":"https://www.class-central.com/course/coursera-habilidades-humanas-y-de-negocios-para-negociar-5487"},{"title":"La comunicación laboral en el siglo XXI","about":"En el acelerado ambiente empresarial de hoy en día, a los empleados de todo nivel se les pide que se encarguen cada vez de más tareas, que cumplan más plazos, que asuman más responsabilidad y que se adapten a más innovación. Además de esos retos está la cuestión de la gran diversidad de personas con las que uno trabaja, y que continuamente están cambiando, por lo que es necesario saber manejar las diferencias generacionales, culturales, de sexo y de edad. La comunicación, tanto verbal como no verbal, constituye la base de todo lo que hacemos y decimos y es trascendental en el entorno laboral del siglo XXI. Afortunadamente, es posible aprender a comunicarse, y con la instrucción adecuada uno puede mejorar. El propósito de este curso es sensibilizar a los alumnos sobre la importancia de la comunicación en el lugar de trabajo y enseñarles nuevas destrezas interpersonales, a fin de que se vuelvan en general mejores comunicadores. Estos son algunos de los temas tratados: proceso y funciones de la comunicación, patrones conductuales, percepción de la realidad, señales verbales y no verbales, confianza, asertividad, tacto, control de la ira, críticas y observaciones positivas, resolución de conflictos, creación de equipos, liderazgo, entrevistas, empleo eficaz de la tecnología (correo electrónico, Skype, mensajes de texto, etc.) para comunicarse.","tutor":"Patricia Bravo, MBA, SPHR","provider":"Coursera","language":"Spanish","skills":["communication","interpersonal skills","usa","north america"],"subject":"Communication Skills","studentsInterested":"20","courseLink":"https://www.coursera.org/learn/comunicacion-trabajo","classCentralLink":"https://www.class-central.com/course/coursera-la-comunicacion-laboral-en-el-siglo-xxi-4655"},{"title":"Cómo resolver problemas y tomar decisiones con eficacia","about":"El pensamiento crítico (la aplicación de métodos científicos y del razonamiento lógico) constituye la base para resolver problemas y tomar decisiones con eficacia. El pensamiento crítico nos permite evitar escollos frecuentes, verificar la validez de nuestras creencias y suposiciones y corregir las distorsiones que pueden haberse producido en nuestros procesos mentales. Con este curso adquirirás la confianza para evaluar acertadamente los problemas, sopesar soluciones alternativas y prever probables riesgos. Aprenderás a usar el análisis, la síntesis y las preguntas positivas para abordar problemas tanto individuales como organizacionales y cultivarás el pensamiento crítico que se necesita en estos tiempos turbulentos. Mediante estudios de caso y de situaciones en que se han visto otros alumnos, se exploran modelos exitosos y métodos de probada eficacia que son fácilmente reproducibles en el trabajo.","tutor":"Rob Stone","provider":"Coursera","language":"Spanish","skills":["critical thinking","problem solving","usa","north america"],"subject":"Self Improvement","studentsInterested":"64","courseLink":"https://www.coursera.org/learn/resolucion-decisiones","classCentralLink":"https://www.class-central.com/course/coursera-como-resolver-problemas-y-tomar-decisiones-con-eficacia-4667"},{"title":"Працюйте розумніше, а не більше: управління часом для особистої та професійної продуктивності","about":"Працюйте розумніше, а не більше\nВи зможете здобути і застосувати ваші знання та розуміння особистої та професійної обізнаності, організованості та виконання зобов’язань, а також використовувати інструменти, методи та прийоми, про які ви дізналися, для постановки цілей та пріоритетів, планування та делегування для подолання управлінських викликів та покращення продуктивності.\n\nThis course is translated by the Ukrainian mobile network operator, lifecell.","tutor":"Margaret Meloni","provider":"Coursera","language":"English","skills":["productivity","time management","usa","north america"],"subject":"Self Improvement","studentsInterested":"12","courseLink":"https://www.coursera.org/learn/upravlinnya-chasom","classCentralLink":"https://www.class-central.com/course/coursera-------------5261"},{"title":"Career Decisions: From Insight to Impact","about":"I am an adult developmental psychologist by training and a career counselor by trade, currently the Director of the Gordon Career Center at Wesleyan University in Connecticut. In this course, I draw from my decades of experience as well as research from the fields of psychology, organizational behavior, and sociology to help you understand best practices for making career decisions. This content will help you develop the tools you need to make the right choices for you, from deciding an area of study to exploring potential lines of work to pursue—and knowing when to pivot at any time in your career.","tutor":"Sharon Belden Castonguay","provider":"Coursera","language":"English","skills":["career planning","career development"],"subject":"Career Development","studentsInterested":"81","courseLink":"https://www.coursera.org/learn/career-decisions","classCentralLink":"https://www.class-central.com/course/coursera-career-decisions-from-insight-to-impact-11108"},{"title":"The Art of Negotiation","about":"The art of negotiation comes into play daily in the life of employees at all levels and in every position. Participants explore how current approaches to negotiation strategy and tactics are used, what negotiation entails, types of negotiation relationships that exist from hard bargain to win-win, to fully partnered relationships and personal ones. The course explores the personal and behavioral characteristics of an effective negotiator. Participants discuss how empowerment, power, and authority affect the negotiation process and outcome. Topics include how important it is to plan and prepare for a negotiation session.\n\nUpon completing this course, you will be able to:\n1. Learn about the nature of negotiation and how it differs from selling\n2. Gain awareness of the basic doctrines of negotiation and barriers to effective negotiation\n3. Explain the role of authority and how to address it in negotiations\n4. Explain the role of power in negotiations and how to address power inequities\n5. Explain the positive and negative influences of empowerment\n6. Learn the different “stances” or negotiation styles negotiators might adopt\n7. Demonstrate the factors that influence which negotiation style is implemented\n8. Describe the personal and behavioral characteristics of an effective negotiator\n9. Demonstrate your grasp of emotional intelligence and how it impacts the effectiveness of a negotiator\n10. Assess your own values and personal style and how they affect the negotiation process\n11. Learn about the critical importance of planning and preparation in the negotiation process","tutor":"Sue Robins","provider":"Coursera","language":"English","skills":["negotiation","usa","north america"],"subject":"Communication Skills","studentsInterested":"1.0k","courseLink":"https://www.coursera.org/learn/art-of-negotiation","classCentralLink":"https://www.class-central.com/course/coursera-the-art-of-negotiation-2725"},{"title":"Etkili Konuşma (Effective Speaking)","about":"Bu ders konuşmayı daha etkili hale getirecek temel özellikleri geliştirmeyi amaçlar. Doğru nefes, sesin iyi ve etkili kullanılması, doğru vurgu ve tonlamanın inceliklerinin fark edilmesi için gerekli bilgiler verilir, uygulamalar önerilir ve yapılır.","tutor":"Aziz Güler","provider":"Coursera","language":"Turkish","skills":["public speaking","asia","turkey"],"subject":"Communication Skills","studentsInterested":"74","courseLink":"https://www.coursera.org/learn/etkili-konusma","classCentralLink":"https://www.class-central.com/course/coursera-etkili-konusma-effective-speaking-3660"},{"title":"Conflict Resolution Skills","about":"Resolving conflict in a positive manner is a skill than can be developed and practiced. Being heard can be one of the most important goals of someone engaged in conflict. Knowing how to listen and deploy appropriate communication tactics is determinative of whether a conflict will have a positive or negative resolution. Examine listening skills, appropriate and strategic verbal and non-verbal communication skills, and how to assemble a conflict management plan likely to yield positive resolutions.\n\nUpon completing this course, you will be able to:\n1. Use active learning skills when dealing with conflict\n2. Choose appropriate communication tactics when dealing with conflict\n3. Create a usable plan for managing conflict","tutor":"Najla DeBow","provider":"Coursera","language":"English","skills":["conflict resolution","communication skills","usa","north america"],"subject":"Communication Skills","studentsInterested":"439","courseLink":"https://www.coursera.org/learn/conflict-resolution-skills","classCentralLink":"https://www.class-central.com/course/coursera-conflict-resolution-skills-4194"},{"title":"Intercultural Communication and Conflict Resolution","about":"Intercultural Communication and Conflict Resolution is a growing area of importance considering the pace and volume of global transactions. The ease of global communication using technology, the abundance of cheaper transportation costs, and the frequency of businesses using cross-border talent is fostering millions of interactions a day between people of different cultures. Examine how the process of communication can be further complicated during interactions between people of different cultures. The topics of stereotypes, generalizations, communication styles, communication strategies, and communication orientations will be explored.\n\nUpon completing this course, you will be able to:\n1. Explain the dimensions of intercultural interactions that add to conflict\n2. Analyze the dynamics of intercultural interactions\n3. Plan strategies for success in intercultural interactions","tutor":"Najla DeBow and Amit Kothari","provider":"Coursera","language":"English","skills":["conflict resolution","culture","communication","usa","north america"],"subject":"Communication Skills","studentsInterested":"219","courseLink":"https://www.coursera.org/learn/intercultural-communication","classCentralLink":"https://www.class-central.com/course/coursera-intercultural-communication-and-conflict-resolution-4221"},{"title":"El arte de negociar","about":"Empleados de todo nivel y con cargos de todo tipo pueden aplicar a diario el arte de negociar. Los alumnos adquieren una visión actual de las estrategias y tácticas de negociación, aprenden lo que significa negociar y se familiarizan con diversos tipos de negociaciones, como regateos a ultranza, gana-ganas, negociaciones en nombre de una organización y negociaciones a título individual. En el curso se analizan los rasgos personales y la conducta de un negociador eficaz y se habla de cómo el empoderamiento, una posición de fuerza y la autoridad que uno tenga afectan la marcha y el resultado de una negociación. También se aborda la importancia de hacer una buena planificación y preparación antes de una reunión de negociación.","tutor":"Sue Robins, M.S. Ed.","provider":"Coursera","language":"Spanish","skills":["negotiation","usa","north america"],"subject":"Communication Skills","studentsInterested":"46","courseLink":"https://www.coursera.org/learn/arte-de-negociacion","classCentralLink":"https://www.class-central.com/course/coursera-el-arte-de-negociar-4620"},{"title":"Introduction to Personal Branding","about":"Though the concept of personal branding isn\u0027t new, questions remain about how to create one and, more importantly, what it means to maintain and inhabit that brand.\n\nLearners will:\n\no Understand both what personal branding means and what it means to inhabit their brand\no Establish themselves on at least three social media platforms\no Create a mission statement for their personal brand\no Build a board of directors for their brand\no Become familiar with the basics of digital security and reputation management\no Create a system for on-going brand maintenance\n\nJoin instructor Kimberley R. Barker as she provides a warm, supportive atmosphere in which learners are encouraged to intensively explore themselves in order to create a personal brand that authentically and effectively communicates their values and professional gifts. Together we will build a strong community in which to provide encouragement and feedback, and support each other as learners pursue their goal of successful brand creation.","tutor":"Kimberley Barker, MLIS","provider":"Coursera","language":"English","skills":["personal branding","usa","north america"],"subject":"Career Development","studentsInterested":"595","courseLink":"https://www.coursera.org/learn/personal-branding","classCentralLink":"https://www.class-central.com/course/coursera-introduction-to-personal-branding-4865"},{"title":"Speaking to inform: Discussing complex ideas with clear explanations and dynamic slides","about":"In the professional realm, most speeches and presentations we give are informative in scope. A scientist needs to explain her recent research findings. A financial officer needs to report on quarterly earnings to his company’s board. A technology professional needs to educate a consumer about a new product. Any time you need to convey ideas or demonstrate a process, you’re dealing with informative speaking.\n\nInformative speaking is a fun puzzle. You need to think from the perspective of your audience to identify what they need to hear in order to understand the key ideas. How much does the audience already know? What are the most important elements to convey? How should one convey these ideas with appropriate breadth and depth given the time constraints of the speech? This demands a strategic approach to speech design that we’ll undertake in this class.\n\nBy the end of the course, you should be able to explain complex ideas vividly and accessibly, design clear and compelling presentation slides, convey your passion for a topic while maintaining your professional credibility, and speak dynamically from notes and/or a manuscript. Learners will record speeches, providing and receiving peer feedback.","tutor":"Dr. Matt McGarrity","provider":"Coursera","language":"English","skills":["usa","north america","new-moocs-2017"],"subject":"Communication Skills","studentsInterested":"289","courseLink":"https://www.coursera.org/learn/inform-speech","classCentralLink":"https://www.class-central.com/course/coursera-speaking-to-inform-discussing-complex-ideas-with-clear-explanations-and-dynamic-slides-7458"},{"title":"Improving Communication Skills","about":"Learn how to communicate more effectively at work and achieve your goals. Taught by award-winning Wharton professor and best-selling author Maurice Schweitzer, Improving Communications Skills is an essential course designed to give you both the tools you need to improve your communication skills, and the most successful strategies for using them to your advantage. You\u0027ll learn how to discover if someone is lying (and how to react if they are), how to develop trust, the best method of communication for negotiation, and how to apologize. You\u0027ll also learn when to cooperate and when to compete, how to create persuasive messages, ask thoughtful questions, engage in active listening, and choose the right medium (face-to-face conversation, video conference, phone call, or email) for your messages. By the end of the course, you\u0027ll be able to understand what others want, respond strategically to their wants and needs, craft convincing and clear messages, and develop the critical communication skills you need to get ahead in business and in life.","tutor":"Maurice Schweitzer","provider":"Coursera","language":"English","skills":["new-moocs-2017"],"subject":"Communication Skills","studentsInterested":"745","courseLink":"https://www.coursera.org/learn/wharton-communication-skills","classCentralLink":"https://www.class-central.com/course/coursera-improving-communication-skills-8235"},{"title":"Речевой этикет: вежливость и коммуникативные стратегии","about":"Цель курса – знакомство с устройством речевого этикета, вежливостью и коммуникативными стратегиями, которые используются в общении.\nСлушатели узнают особенности русского речевого этикета и увидят его динамику: от дореволюционного к советскому, от советского к сегодняшнему. Мы заглянем в разные сферы: работа, школа, семья, – и обнаружим в русском языке то, о чем не подозревают даже его носители.\nРусский речевой этикет рассматривается в сравнении с другими европейскими и азиатскими этикетами. Различия в них объясняются через коммуникативные стратегии и культурные шаблоны.\nНаряду с вежливостью мы обсудим и противоположные типы поведения – невежливость и анти-вежливость, то есть сознательное нарушение правил речевого поведения. К каким последствиям это может привести?\nВ заключение мы попытаемся ответить на главные вопросы. Зачем нужен речевой этикет? Что случится, если мы откажемся от вежливости и соблюдения речевого этикета?\nСреди задач курса есть и теоретические (см. выше), и практические. Слушатели узнают, как вести себя в определенных, иногда довольно нетривиальных ситуациях и как реагировать на речевое поведение собеседников. Но кроме ответа на вопрос «как», будут предложены ответы и на вопрос «почему». Почему люди себя так ведут и какие коммуникативные стратегии используют?\nНа лекциях мы постараемся достичь определенного баланса между теорией и практикой. В определенных эпизодах рядом с лектором будет находиться симпатичный собеседник, который поможет продемонстрировать как соблюдение, так и нарушение речевого этикета.\nСлушателям будут предложены задания, с помощью которых они проверят практическое усвоение правил этикета и собственную готовность к его использованию в реальной жизни.","tutor":"Кронгауз Максим Анисимович","provider":"Coursera","language":"Russian","skills":["communication","human speech","etiquette","new-moocs-2017"],"subject":"Communication Skills","studentsInterested":"15","courseLink":"https://www.coursera.org/learn/rechevoj-etiket","classCentralLink":"https://www.class-central.com/course/coursera-------9430"},{"title":"Negociación exitosa: Estrategias y habilidades esenciales (en español)","about":"Todos negociamos diariamente. A nivel personal, negociamos con amigos, familia, propietarios, vendedores de autos y empleadores, entre otros. La negociación también es la clave del éxito comercial. Ninguna empresa puede sobrevivir sin contratos rentables. Dentro de una empresa, las habilidades de negociación lo pueden llevar a avanzar en su carrera.\n\nEn este curso, aprenderá y practicará los cuatro pasos necesarios para lograr una negociación exitosa, con un módulo para cada paso:\n(1) Preparación: Planifique su estrategia de negociación\n(2) Negociación: Use las tácticas claves para el éxito\n(3) Cierre: Cree un contrato\n(4) Cumplimiento y evaluación: El juego final\n\nPara completar exitosamente este curso y mejorar su capacidad de negociar, deberá completar los tres pasos siguientes:\n(1) Mire los videos breves (que van de 5 a 20 minutos) de cada módulo. Los videos son interactivos e incluyen preguntas para evaluar su entendimiento de las estrategias y habilidades de negociación. Los videos se pueden acelerar o ralentizar para adaptarse al ritmo que prefiera escucharlos. Según sus horarios, puede ver los videos en unas semanas o verlos todos juntos. Un estudiante que vio el curso de una sola vez concluyó que \"es tan bueno como Breaking Bad\".\n(2) Complete la negociación del Módulo 6 para evaluar sus capacidad de negociación. Puede negociar con un amigo local o usar los Debates para encontrar un socio de otra parte del mundo. Su socio de negociación le brindará una devolución sobre sus capacidad de negociación. En el camino, puede resultarle útil utilizar esta aplicación móvil gratuita que está relacionada con el curso y contiene varias herramientas de planificación de la negociación. http://negotiationplanner.com/\n(3) Tome el examen final. Para completar el curso exitosamente, debe responder correctamente el 80 % de las preguntas. Este examen es un examen de dominio, lo que significa que puede tomarlo las veces que quiera hasta que domine el material.\n\nAdemás, este curso incluye la opción de obtener un Certificado verificado (CV) a través de la verificación de su identidad y la finalización exitosa del curso. Un CV le proporciona un reconocimiento formal de sus logros en el curso e incluye el logo de la Universidad de Michigan.\n\nSi usted está considerando obtener un CV, debe completar el proceso de verificación antes de tomar el examen final. Puede elegir pagar los cargos asociados antes o después del examen. Para obtener más información acerca de los CV, visite: learner.coursera.help/hc/en-us/articles/201212399-Verified-Certificates\n\nEl logo compuesto del curso se comparte con una licencia Creative Commons CC BY-SA (https://creativecommons.org/licenses/by-sa/2.0/) y fue creado con las imágenes proporcionadas por cortesía de Flazingo Photos (http://bit.ly/1zOylRm) y K2 Space (https://www.flickr.com/photos/k2space/14257556613/in/set-72157644732478432).\n\nThis is a translated version. To join the original English version, visit this page: https://www.coursera.org/learn/negotiation-skills/","tutor":"George Siedel","provider":"Coursera","language":"Spanish","skills":["negotiation","usa","north america"],"subject":"Communication Skills","studentsInterested":"53","courseLink":"https://www.coursera.org/learn/negociacion","classCentralLink":"https://www.class-central.com/course/coursera-negociacion-exitosa-estrategias-y-habilidades-esenciales-en-espanol-4188"},{"title":"Trabaja inteligentemente, no más duro: Gestión del tiempo para la productividad personal y profesional","about":"Podrás aplicar los conocimientos que adquieras en cuanto a conciencia personal y profesional, organización y compromiso, y utilizar las herramientas, técnicas y métodos aprendidos para fijarte metas, jerarquizar tareas, programar y delegar, todo con el fin de superar las dificultades asociadas a la gestión del tiempo y mejorar la productividad.","tutor":"Margaret Meloni","provider":"Coursera","language":"Spanish","skills":["time management","usa","north america"],"subject":"Self Improvement","studentsInterested":"58","courseLink":"https://www.coursera.org/learn/trabaja-inteligentemente","classCentralLink":"https://www.class-central.com/course/coursera-trabaja-inteligentemente-no-mas-duro-gestion-del-tiempo-para-la-productividad-personal-y-profesional-4652"},{"title":"Proyecto Final de Éxito Profesional","about":"El propósito del Proyecto Final de la Programa Especializado de Éxito Profesional es que apliques a una experiencia personal los métodos y las técnicas que has aprendido en la serie de cursos, dándote una manera de comunicar tu valor a empleadores potenciales. Centrarás tus habilidades de comunicación, dirección, negociación, resolución de problemas, redacción empresarial, gestión del tiempo, finanzas, emprendimiento y gestión de proyecto en un único proyecto que demostrará tu preparación profesional.","tutor":"Margaret Meloni, Dave Nagy, Patricia Bravo, MBA, SPHR , David Standen, Rob Stone and Sue Robins, M.S. Ed.","provider":"Coursera","language":"Spanish","skills":["negotiation","capstone","communication","success","usa","north america"],"subject":"Career Development","studentsInterested":"3","courseLink":"https://www.coursera.org/learn/proyecto-profesional","classCentralLink":"https://www.class-central.com/course/coursera-proyecto-final-de-exito-profesional-5201"},{"title":"Presentations: Speaking so that People Listen","about":"Do you have to give presentations in school or at your work? Is it nerve-racking? Then you\u0027ve come to the right place. Everyone gets a little nervous when they think about having to stand in front of other people and speak intelligently. This course will give you helpful tips for making effective speeches and delivering them well in typical American settings. You\u0027ll learn how to organize a presentation, how to make it memorable, and how to communicate clearly. In the course, you\u0027ll have several opportunities to demonstrate the presentation skills that you learn. This will help you gain the experience you need to be more confident when you give a speech in an American classroom or on the job. Learners will record several videos of themselves giving assigned presentations and upload the videos for peer feedback.\n\nPlease note that the free version of this class gives you access to all of the instructional videos and handouts. The peer feedback and quizzes are only available in the paid version.","tutor":"Tamy Chapman","provider":"Coursera","language":"English","skills":["usa","north america"],"subject":"Communication Skills","studentsInterested":"206","courseLink":"https://www.coursera.org/learn/presentations-speaking-so-that-people-listen","classCentralLink":"https://www.class-central.com/course/coursera-presentations-speaking-so-that-people-listen-6824"},{"title":"Mediation and Conflict Resolution","about":"Mediation is a crucial means to reaching peaceful and agreed solutions in today’s world – on an international, political, industrial, peace-keeping or social level.\n\nWith the course you will be able to choose and lead a mediation process. You will gain a deeper understanding of workplace and international conflict resolution. Fundamentals of Negotiation are required to complete this MOOC. You can acquire them through our MOOC \"Negotiation Fundamentals\".\n\nAfter this course, you will be able to:\n\nDefine what a mediation is and choose when to use it;\nList different types of mediation;\nIdentify typical challenges and difficulties that most mediators face;\nChoose the adequate strategies within a repertoire of options;\nIdentify the do’s and don’ts in mediation.\n\nThis MOOC offers video lectures from leading experts, interactive questions, case studies, practice and graded quizzes.\n\nDesigned as a logical follow on from the suite of ESSEC IRENE online courses in negotiation, this course about mediation and conflict resolution teaches a whole set of additional skills and approaches. Developed by one of Europe’s leading institutes of research and education in negotiation and mediation, ESSEC IRENE, this course provides you with a meaningful and effective bouquet of practical cases, tools, approaches and skills to put your mediation into high-impact practice.","tutor":"Alan Jenkins, Aurélien Colson and Joseph Maila","provider":"Coursera","language":"English","skills":["conflict resolution","mediation","new-moocs-2017"],"subject":"Communication Skills","studentsInterested":"244","courseLink":"https://www.coursera.org/learn/conflict-resolution-mediation","classCentralLink":"https://www.class-central.com/course/coursera-mediation-and-conflict-resolution-9157"},{"title":"Negotiation, Mediation, and Conflict Resolution - Capstone Project","about":"This course has been designed to help you apply knowledge, skills, and know-how you have developed in negotiation and in mediation, both as a result of your own practice and the follow up of the previous Courses of the ESSEC “Negotiation, Mediation, and Conflict Resolution” specialization.\n\nBefore you enroll this course, we strongly recommend that you acquire the necessary pre-requisites. A number of tools, concepts, and methods are outlined in 3 MOOCS: Negotiation Fundamentals, Cross-cultural Negotiations, and Mediation \u0026 Conflict Resolution.\n\nTo be more specific, the following subjects must be mastered:\n- Get prepared for any negotiation;\n- Avoid traps;\n- Know how to prompt value-creating partnerships;\n- Structure an effective negotiation sequence;\n- Bargain in an efficient and respectful manner;\n- Overcome deadlocks;\n- Manager cultural differences in a negotiation;\n- Define what a mediation is and choose when to use it;\n- List different types of mediation;\n- Identify typical challenges and difficulties that most mediators face;\n- Choose the adequate strategies within a repertoire of options;\n- Identify the do’s and don’ts in mediation.\n\nThe purpose of this course is to help you to put everything together, sharpen your skills and enhance your command of negotiation techniques and behaviors.\n\nWe’ve designed this MOOC in a highly interactive way. You will be engaged in a negotiation with peers. You will demonstrate your improved capacity to analyze, and therefore conduct, negotiations and mediation.\n\nThis capstone project will comprise three exercises. Here is an overview.\n\nIn the first exercise, you will analyse a real-life negotiation of your own choice. As an expert of negotiation dynamics, you will provide your reader with a detailed analysis of this real negotiation. Indeed as a professional, your task might not always be to conduct a negotiation - but to analyse what is going on in a given negotiation, or to help others (your boss, for instance) get ready for a high-stake negotiation. Guidelines will be provided in a separate document, to help you structure your assignment.\n\nFor the second exercise, you will negotiate directly with a peer. We’ve prepared a business case inspired from a true story.\n\nThe third exercise is linked to the previous one. Imagine that this negotiation is not successful, and that the relationship between the two negotiators becomes too tense. You will be asked to step into the shoes of a mediator - and to structure a mediation process.\n\nEach of these three exercises will be peer-evaluated.\n\nAs a result, it is really worth your engagement! Go ahead, engage fully into the exercises - you will have fun, and you will make further progress for real-life negotiation, mediation, and conflict management.","tutor":"Aurélien Colson","provider":"Coursera","language":"English","skills":["conflict resolution","negotiation","capstone"],"subject":"Communication Skills","studentsInterested":"48","courseLink":"https://www.coursera.org/learn/negotiation-project","classCentralLink":"https://www.class-central.com/course/coursera-negotiation-mediation-and-conflict-resolution-capstone-project-9190"},{"title":"Mindshift: Transforma tu mente para superar obstáculos en el aprendizaje y descubrir tu potencial oculto.","about":"Mindshift es un curso diseñado para ayudarte a impulsar tu carrera profesional y tu vida personal en el mundo de cambios acelerados que vivimos hoy en día. Cualquiera que sea tu edad o etapa de formación, Mindshift te enseñará técnicas para aprovechar al máximo tu experiencia de aprendizaje en línea, estrategias para conseguir y trabajar con mentores, secretos para evitar estancamientos (y catástrofes) en tu carrera profesional, y reflexiones sobre el valor de la ignorancia selectiva y la competencia general. Te proporcionaremos prácticas enseñanzas basadas en la ciencia sobre cómo aprender y transformar tu mente de manera efectiva, incluso durante la madurez, utilizando como base lo que ya conoces para guiar tu evolución en fantásticas nuevas direcciones. Este curso está diseñado para enseñarte cómo reflexionar sobre lo que estás aprendiendo, y sobre tu lugar en los acontecimientos que se desarrollan en la sociedad a tu alrededor, para que logres convertirte en lo que quieras ser y cumplas tus metas, teniendo presente las limitaciones que el mundo real pone sobre todos nosotros. ¡Verás que al usar estas técnicas y estrategias mentales, podrás aprender y hacer más -mucho más- de lo que podrías haber soñado!\n\nEste curso puede ser tomado de manera independiente, en conjunto o subsecuente a su curso asociado, Aprendiendo a Aprender. (Mindshift está más orientado a carreras profesionales, y Aprendiendo a Aprender está más orientado al aprendizaje).","tutor":"Dr. Barbara Oakley, Dr. Terrence Sejnowski and M.S. Orlando Trejo","provider":"Coursera","language":"Spanish","skills":["self help","self improvement"],"subject":"Self Improvement","studentsInterested":"18","courseLink":"https://www.coursera.org/learn/mindshift-transforma-mente","classCentralLink":"https://www.class-central.com/course/coursera-mindshift-transforma-tu-mente-para-superar-obstaculos-en-el-aprendizaje-y-descubrir-tu-potencial-oculto-10619"},{"title":"Career Management for Early Career Academic Researchers","about":"Explore different career options and understand what you want from a career\nBeing an early career academic researcher, whether you’re a doctoral student or research staff, can be challenging: should you pursue further academic research? What skills will help you progress in an academic career? What other career options are open to you?\nOn this course you will answer these questions and more, considering how to manage you career and reflecting on what you want out of a career. You will be encouraged to consider different career options, both within and outside academic research, and build your confidence in marketing yourself in applications and interviews.\nThis course is for academic researchers - both postgraduate researchers (PhDs) and early career researchers (post-docs).","tutor":"Katrina Gardner","provider":"FutureLearn","language":"English","skills":["academics","career planning"],"subject":"Career Development","studentsInterested":"42","courseLink":"https://www.futurelearn.com/courses/career-management","classCentralLink":"https://www.class-central.com/course/futurelearn-career-management-for-early-career-academic-researchers-10551"},{"title":"Autoliderazgo y gestión de emociones para avanzar en desafíos complejos","about":"\"Autoliderazgo y Gestión de Emociones para Avanzar en Desafíos Complejos\" es un curso práctico, enfocado en tu primer círculo de influencia: tú mismo. El curso te invitará a conectarte con tus propósitos e identificar la forma en la que tus creencias, miedos y hambres con frecuencia dificultan el logro de tus propósitos y tu avance en desafíos de liderazgo. El curso te va a permitir identificar, y si lo decides, trabajar temas personales que te ayudarán a ser más efectivo y a acercarte más a vivir tu vida como quieres vivirla.\n\nEn este curso vamos a preguntarnos ¿cómo alineas tus recursos emocionales con tus propósitos para progresar en desafíos complejos que te importan?, ¿cómo gestionas tus emociones para poder ver y elegir opciones de acción que mejoren tu calidad de vida y la de otros?.\n\nEl curso te acompañará en el proceso de conocer y poner en práctica una metodología de diagnóstico e intervención en ti y tu vida personal que llamamos Espiral de Liderazgo Personal, que si te das el espacio y la oportunidad te va a ayudar a:\n\n1. conectar con tus propósitos\n2. profundizar tu autoconocimiento consciencia de ti: tus recursos y fortalezas, miedos, carencias y excusas\n3. descubrir los compromisos internos que a veces dificultan tu avance\n4. mejorar tus habilidades para:\na. gestionar tus emociones productivamente\nb. movilizarte a tener la vida que quieres tener\n\nEstos objetivos de aprendizaje implican que el curso al que vas a entrar no está diseñado de forma convencional, como clases magistrales en las que un experto te “enseña” conceptos, sino que el rol de los profesores en este curso es el de diseñar oportunidades de aprendizaje para ti, y acompañarte en reflexionar sobre ellas.\n\n\"Autoliderazgo y Gestión de Emociones para Avanzar en Desafíos Complejos\" es el segundo de cuatro cursos que componen el programa especializado en \"Liderazgo Efectivo para el Siglo XXI\". Los otros tres cursos son: \"Estilos de Liderazgo: Opciones para Avanzar en Desafíos Complejos\"; \"Comunicación, Experimentación y Aprendizaje en Liderazgo\"; y \"Liderazgo para el siglo XXI: Proyecto Final\". Puedes tomar todos los cursos por separado o sólo uno de ellos, sin embargo te recomendamos que te inscribas y participes en los cuatro, ojalá en el orden que te proponemos.\n\nEste programa está dirigido a cualquier persona interesada en conectarse con sus propósitos y profundizar sus habilidades para progresar en desafíos personales y colectivos muy complejos. Es especialmente útil para personas en mandos medios y altos en organizaciones públicas, privadas y no gubernamentales (ONGs). También para líderes comunitarios, activistas y en general gente que trabaja con personas y que necesita desarrollar o profundizar habilidades y herramientas para crear, a partir de grupos con opiniones e intereses diversos comunidades que trabajan juntas para avanzar en los temas que les importan. Va a ser útil, también, para personas interesadas en aprender a mejorar los resultados que observan en su esfera de vida más personal.","tutor":"Maite Careaga Tagüeña and Héctor F. Hernández V.","provider":"Coursera","language":"Spanish","skills":["colombia","south america"],"subject":"Personal Development","studentsInterested":"36","courseLink":"https://www.coursera.org/learn/autoliderazgo-gestion-emociones","classCentralLink":"https://www.class-central.com/course/coursera-autoliderazgo-y-gestion-de-emociones-para-avanzar-en-desafios-complejos-6919"},{"title":"Comunicación, experimentación y aprendizaje en liderazgo","about":"Este es un curso práctico, enfocado en planear experimentos, ensayos y errores para intervenir en sistemas humanos y movilizarlos a trabajar en desafíos complejos. El Liderazgo para problemas complejos es un deporte de contacto, es muy útil entrenar, tener planes y luego ser capaz de improvisar efectivamente durante la acción. Este es un curso práctico, enfocado a darte oportunidades para desarrollar/profundizar:\n\n1. habilidades para investigar y movilizar un sistema humano a través de estrategias de ensayo, error, reflexión y aprendizaje\n2. habilidades sociales para crear lazos, alianzas, comunidades\n3. habilidades de comunicación para tener conversaciones incómodas, valientes y cruciales\n4. habilidades para crecer desde el fracaso\n5. habilidades emocionales para ponerte en los zapatos de otros, para entender sus temores y motores, para ayudar a otros a usar sus emociones para su bien y el bien del grupo\n\nEstos objetivos de aprendizaje implican que el curso al que vas a entrar no está diseñado de forma convencional, como clases magistrales en las que un experto te “enseña” conceptos, sino que el rol de los profesores en este curso es el de diseñar oportunidades de aprendizaje para ti, y acompañarte en reflexionar sobre ellas.\n\n\"Comunicación, Experimentación y Aprendizaje en Liderazgo\" es el tercero de cuatro cursos que componen el programa especializado en “Liderazgo Efectivo para el Siglo XXI”. Los otros tres cursos son: \"Estilos de Liderazgo: Opciones para Avanzar en Desafíos Complejos\"; : \"Autoliderazgo y Gestión de Emociones para Avanzar en Desafíos Complejos\"; y \"Liderazgo para el siglo XXI: Proyecto Final\". Puedes tomar todos los cursos por separado o sólo uno de ellos, sin embargo te recomendamos que te inscribas y participes en los cuatro, ojalá en el orden que te proponemos.\n\nEste curso y el programa están dirigido a cualquier persona interesada en conectarse con sus propósitos y profundizar sus habilidades para progresar en desafíos personales y colectivos muy complejos. Es especialmente útil para personas en mandos medios y altos en organizaciones públicas, privadas y no gubernamentales (ONGs). También para líderes comunitarios, activistas y en general gente que trabaja con personas y que necesita desarrollar o profundizar habilidades y herramientas para crear, a partir de grupos con opiniones e intereses diversos comunidades que trabajan juntas para avanzar en los temas que les importan. Va a ser útil, también, para personas interesadas en aprender a mejorar los resultados que observan en su esfera de vida más personal.","tutor":"Maite Careaga Tagüeña and Héctor F. Hernández V.","provider":"Coursera","language":"Spanish","skills":["colombia","south america"],"subject":"Personal Development","studentsInterested":"17","courseLink":"https://www.coursera.org/learn/comunicacion-experimentacion-aprendizaje","classCentralLink":"https://www.class-central.com/course/coursera-comunicacion-experimentacion-y-aprendizaje-en-liderazgo-6930"},{"title":"Speaking to Inspire: Ceremonial and Motivational Speeches","about":"The most memorable speeches inspire, entertain, and praise. By blending stories and eloquence, great speeches highlight the core values motivating an audience. You might need to do this in a keynote address, a eulogy, or simply a business meeting. Inspiring audiences is a common, but difficult writing challenge. You want a speech that elevates the topic and the audience.\n\nThis course gives you a method for preparing and delivering speeches that inspire and entertain. By the end of this course, you should be able to compose and deliver moving speeches that praise core audience values through evidence, storytelling, and humor. You should be able to write eloquent passages in tones appropriate to the audience and occasion and speak fluidly from either a well-prepared manuscript or from memory. Learners will record speeches, providing and receiving peer feedback.","tutor":"Dr. Matt McGarrity","provider":"Coursera","language":"English","skills":["usa","north america","new-moocs-2017"],"subject":"Personal Development","studentsInterested":"195","courseLink":"https://www.coursera.org/learn/speak-to-inspire-ceremonial-motivational-speeches","classCentralLink":"https://www.class-central.com/course/coursera-speaking-to-inspire-ceremonial-and-motivational-speeches-7459"},{"title":"Taller para la Resolucion de Conflictos, Liderazgo y Desarrollo Personal","about":"Este curso promueve la capacidad de negociación como un elemento clave para profesionales que se desenvolverán en una sociedad altamente compleja. El curso aportará a que las y los estudiantes puedan utilizar sus conocimientos, habilidades y aptitudes en función del cumplimiento de objetivos personales, formativos o profesionales. Se entregarán herramientas que les permitirán desarrollar capacidades de colaboración, trabajo en equipo y participación que aporten de forma positiva a la transformación de nuestra sociedad. Al finalizar el curso, los estudiantes comprenderán al liderazgo y la negociación como herramientas y acciones concretas y específicas que logran movilizar y transformar positivamente su entorno. El curso combina trabajo clase a clase de entrenamiento con una guía de ejercicios periódicos para aplicar y desarrollar las habilidades enseñadas.","tutor":"Rodolfo Chiple","provider":"Coursera","language":"Spanish","skills":["new-moocs-2017"],"subject":"Communication Skills","studentsInterested":"36","courseLink":"https://www.coursera.org/learn/introduccion-negociacion","classCentralLink":"https://www.class-central.com/course/coursera-taller-para-la-resolucion-de-conflictos-liderazgo-y-desarrollo-personal-8314"},{"title":"Media ethics \u0026 governance","about":"Media Ethics and Governance\nAbout this course: This course explores some of the basic theories, models and concepts in the field of media ethics. We will introduce influential ethical theories and perspectives, explore changing societal demands and expectations of media creation and media use, and we will elaborate on existing ethical norms for media professionals. After following this course, you will be able to reflect on ethical dilemmas and develop a well-substantiated argumentation for ethical decision making in a variety of media-related contexts.\n\nUpon completion of this course, students should:\n• have knowledge of the history and development of perspectives on media ethics;\n• have knowledge of the dominant theoretical approaches and concepts;\n• be able to use this knowledge to develop a well-substantiated argumentation","tutor":"Rutger de Graaf, Sandra Jacobs, Damian Trilling, Annemarie van Oosten and Lotte Salome","provider":"Coursera","language":"English","skills":["ethics","governance","media ethics","new-moocs-2017"],"subject":"Communication Skills","studentsInterested":"101","courseLink":"https://www.coursera.org/learn/media-ethics-governance","classCentralLink":"https://www.class-central.com/course/coursera-media-ethics-governance-9312"},{"title":"Public Relations Capstone","about":"The capstone project will be a strategic plan. Students will be given a specific problem and will be asked to conduct a situation analysis based on research, which will then serve as the basis of the strategic plan outlining the objectives and specific communication strategies for addressing the problem.\n\nThe project will test the knowledge of students in basic principles of public relations, public relations research, strategy and new media, asking students to come up with a strategic plan. The strategic plan will be the roadmap for a public relations campaign and will integrate the key concepts offered through the four courses.","tutor":"Tracy Loh, Iccha Basnyat and Mohan Dutta","provider":"Coursera","language":"English","skills":["capstone","communication","asia","public relations","singapore"],"subject":"Communication Skills","studentsInterested":"20","courseLink":"https://www.coursera.org/learn/pr-capstone","classCentralLink":"https://www.class-central.com/course/coursera-public-relations-capstone-5133"},{"title":"Build Your Professional ePortfolio in English","about":"Roughly half of the world’s population is already online and so setting yourself apart from the crowd is more important than ever before. One of the best ways to do that is by creating your own ePortfolio. An ePortfolio is a site that showcases or shows your background, your resume, and samples of your work. In this course, you will learn step by step how to build the site and you’ll learn the grammar, vocabulary and writing skills needed to create it. You will learn how to apply information from your ePortfolio to other online tools like LinkedIn, Twitter, Instagram and YouTube in order to network with others so that you get a job or connect with other professionals. For each step in that process, you will listen to lectures, take comprehension quizzes, and learn how to use English appropriately to each part of your site. You will also complete self and peer assessments and gain the needed skills to make your ePortfolio a reality and establish yourself online.\n\nBy the end of this course, you will be able to\n• Write a proper headline or title for your ePortfolio\n• Describe your work in 1 sentence and in longer forms\n• Identify how to use hashtags effectively\n• Write an effective summary about yourself and your work\n• Apply appropriate vocabulary to write your education and professional experience for your resume\n• Understand how to write a tweet to get a job\n• Discover how to write specific comments and network work with others\n• Apply what you have on your portfolio to other tools like Instagram, Twitter, LinkedIn or YouTube.","tutor":"Karen Peterson","provider":"Coursera","language":"English","skills":["eportfolio","online portfolio","usa","north america"],"subject":"Career Development","studentsInterested":"194","courseLink":"https://www.coursera.org/learn/eportfolio-english","classCentralLink":"https://www.class-central.com/course/coursera-build-your-professional-eportfolio-in-english-5789"},{"title":"Career Brand Development and Self-Coaching","about":"In this course, you will engage in developing and strengthening the functional component of your career brand. Acting as “your own Chief Executive Officer” (P. Drucker), you will learn how to use strategic management models and techniques for enhancing your skills portfolio. You will learn how to increase your human capital by developing and documenting high-demand marketable skills. After completing this course, you will be able to:\n- Implement business strategy and models and tools, such as benchmarking and SWOT analysis, for identifying and analyzing your competitive strengths and addressing competency gaps in a skill-based, competitive job selection context;\n- Understand evidence-based, data-driven skill assessment methodologies and techniques;\n- Select appropriate assessment tools and apply them for a thorough, accurate, evidence-based and data driven self-assessment of your transferable skills;\n- Create your critical competency profile (\"The Self-Assessment Grid for Evaluation, or SAGE\") and use it as an effective instrument for an objective, 360 degree self-assessment of your competitive strengths and competency gaps;\n- Create and use an effective instrument for organizing, directing and monitoring your skill-building activities (“The Skill-Building Dashboard, or Skill-Builder”);\n- Develop an effective tool (“The T-Portfolio”) for gathering and organizing samples of standards, best practices, assessment instruments and techniques in your chosen field;\n- Effectively organize your self-management information system to systematically collect and analyze job-related data, evaluate and assess required competencies and skills, develop and implement plans for self-improvement, and monitor your progress;\n- Develop and implement a realistic performance metric for your career development activities (\"Your Present Job Market Value\");\n- Engage in self-coaching to support active self-development.","tutor":"Michele Forte, Dr. Kymn Harvin Rutigliano , Amy Giaculli, Dr. Valeri Chukhlomin, Dr. Tonka Jokelova and Dr. John M. Beckem II","provider":"Coursera","language":"English","skills":["career branding","self branding","swot analysis","usa","north america"],"subject":"Career Development","studentsInterested":"460","courseLink":"https://www.coursera.org/learn/career-brand-development-self-coaching","classCentralLink":"https://www.class-central.com/course/coursera-career-brand-development-and-self-coaching-5482"},{"title":"Becoming Part of the Globalised Workplace","about":"The final course aims to build learners’ confidence and adaptability when communicating in cross-cultural environments as they assume leadership responsibility to communicate influence in persuasive workplace contexts. The course focuses on enhancing learners’ professional persona for skilful engagement and intercultural communication with stakeholders within and beyond the organization, including cross-departmental work teams, clients and external partners.\nLearners will also discover and apply good practices in organising information, using visual aids and body language for presentations while demonstrating a heightened sense of cultural sensitivity in a given context. In all, learners will acquire skills to demonstrate persuasive verbal and intercultural communication in workplace contexts which may include dialogues and presentations to critical stakeholders and effective task delegation to team members.\n\nAt the end of this course, learners will be able to:\n- Analyse factors of motivation among workplace counterparts.\n- Recognise the impact of culture on factors of motivation.\n- Critique and craft persuasive verbal communication products (i.e. script of dialogue) for exchanges with work teams and critical stakeholders.\n- Apply principles of effective PowerPoint slide design with consideration for cultural sensitivity.\n- Identify and adopt strategies on the use of voice and body language for engaging presentations.","tutor":"Susan Lee","provider":"Coursera","language":"English","skills":["communication","asia","presentations","conversation skills","singapore"],"subject":"Communication Skills","studentsInterested":"83","courseLink":"https://www.coursera.org/learn/intercultural-communications","classCentralLink":"https://www.class-central.com/course/coursera-becoming-part-of-the-globalised-workplace-5569"},{"title":"Strategic Self-Marketing and Personal Branding","about":"In this course, you will learn how to use strategic marketing and personal branding techniques for designing, enhancing, and promoting your professional image. Acting as \"your own Chief Executive Officer\" (P. Drucker), you will learn how to use relationship and network marketing and impression management to showcase your skills to prospective employers, colleagues, supervisors, and other interested parties. This course will help you to:\n\n- Recognize the importance of marketing orientation and career brand building for your career development; use marketing communication strategies for your self-marketing;\n\n- Implement strategic marketing planning for your career development and engage in creating your own strategic self-marketing plan;\n\n- Devise strategies for managing your professional reputation; begin creating your personal brand, and plan steps for strategic personal branding;\n\n- Create personal branding statements, and integrate social networking into your career branding;\n\n- Refine your self-management information system to systematically collect and analyze self-marketing and personal branding related data, select appropriate tools and apply them for a thorough, accurate, evidence-based and data driven self-assessment of your self-marketing and personal branding skills;\n\n- Develop and implement an effective instrument for displaying your artifacts and monitoring your marketing communications strategies (\"The Showcaser\") and a realistic performance metric for evaluating your career brand building activities (\"The Career Brand Equity Builder\").","tutor":"Michele Forte, Amy Giaculli, Dr. Valeri Chukhlomin, Dr. Tonka Jokelova and Dr. John M. Beckem II","provider":"Coursera","language":"English","skills":["personal branding","self marketing","professional image","usa","north america"],"subject":"Career Development","studentsInterested":"388","courseLink":"https://www.coursera.org/learn/self-marketing","classCentralLink":"https://www.class-central.com/course/coursera-strategic-self-marketing-and-personal-branding-6241"},{"title":"Success","about":"Do you want to be more successful? This course was designed to help you define what success means to you, and to develop a plan for achieving it. Wharton Professor G. Richard Shell, an award-winning author and the creator of the popular Wharton School course on the meaning of success, created this course to help you answer the questions that arise when you consider how best to use your life. Drawing on his decades of research and mentoring, Shell offers personalized assessments to help you probe your past, imagine your future, and measure your strengths. He then combines these with the latest scientific insights on everything from self-confidence and happiness to relationships and careers. Throughout, he shares inspiring examples of people who found what they were meant to do by embracing their own true measure of success. Get ready for the journey of a lifetime—one that will help you reevaluate your future and envision success on your own terms. Students and executives say that Richard Shell’s courses and executive training programs have changed their lives. Let this course change yours.","tutor":"Richard Shell","provider":"Coursera","language":"English","skills":["usa","north america"],"subject":"Personal Development","studentsInterested":"2.1k","courseLink":"https://www.coursera.org/learn/wharton-succcess","classCentralLink":"https://www.class-central.com/course/coursera-success-6893"},{"title":"Professional IQ Capstone","about":"The capstone project, for those wishing to earn a certificate, is to design a Personal Leadership Credo: personal values, quotes and beliefs; a personal dilemma in 2MC style that gets worked through using DMF and TRAGEDIES; some personal scripts; and a personal leadership development plan.","tutor":"C. K. Gunsalus","provider":"Coursera","language":"English","skills":["leadership","capstone","usa","north america","personal growth","2mc"],"subject":"Personal Development","studentsInterested":"12","courseLink":"https://www.coursera.org/learn/professional-iq-capstone","classCentralLink":"https://www.class-central.com/course/coursera-professional-iq-capstone-5996"}]