[{"title":"Mountains 101","about":"Mountains 101­­ is a broad and integrated overview of the mountain world. This 12-lesson course covers an interdisciplinary field of study focusing on the physical, biological, and human dimensions of mountain places in Alberta, Canada, and around the world. Specifically, we\u0027ll study the geological origins of mountains, how they’re built-up and worn-down over time; we’ll learn about their importance for biodiversity and water cycles, globally and locally; we’ll explore their cultural significance to societies around the globe, and how that relationship has evolved over time; and we’ll learn how mountains are used, how they’re protected, and how today they’re experiencing rapid change in a warming climate.\n\nAt the end of each lesson, Mountains 101 will also provide learners with some smart tricks -- Tech Tips -- to safely enjoy time in the high alpine environment: from how to pick the best footwear for hiking to making smart decisions in avalanche terrain.\n\nWe’ll be delivering your online lessons from valley bottoms to mountaintops, from museums and labs, to alpine huts and other spectacular alpine sites, and we’ll do so with the help of a whole host of experts.\n\nWe invite you to join us for this online adventure! The mountains are calling...","tutor":"Zac Robinson and David Hik","provider":"Coursera","language":"English","skills":["usa","north america","new-moocs-2017"],"subject":"Environmental Science","studentsInterested":"7.8k","courseLink":"https://www.coursera.org/learn/mountains-101","classCentralLink":"https://www.class-central.com/course/coursera-mountains-101-7455"},{"title":"Introduction to Complexity","about":"We have re-opened our popular introductory course indefinitely; all units will be open once the course is launched. You will be able to complete this course at any time of the year and receive a certificate. There will be a course instructor offering office hours and monitoring the forums to support your complexity learning journey.\nIn this course you\u0027ll learn about the tools used by scientists to understand complex systems. The topics you\u0027ll learn about include dynamics, chaos, fractals, information theory, self-organization, agent-based modeling, and networks. You’ll also get a sense of how these topics fit together to help explain how complexity arises and evolves in nature, society, and technology. There are no prerequisites. You don\u0027t need a science or math background to take this introductory course; it simply requires an interest in the field and the willingness to participate in a hands-on approach to the subject.","tutor":"Melanie Mitchell","provider":"Complexity Explorer","language":"English","skills":["complexity theory","complex systems","usa","north america"],"subject":"Science","studentsInterested":"7.4k","courseLink":"https://www.http://intro.complexityexplorer.org/","classCentralLink":"https://www.class-central.com/course/complexity-explorer-introduction-to-complexity-557"},{"title":"Quantum Mechanics for Everyone","about":"Quantum Mechanics for Everyone is a four-week long MOOC that teaches the basic ideas of quantum mechanics with a method that requires no complicated math beyond taking square roots (and you can use a calculator for that). Quantum theory is taught without “dumbing down” any of the material, giving you the same version experts use in current research. We will cover the quantum mystery of the two-slit experiment and advanced topics that include how to see something without shining light on it (quantum seeing in the dark) and bunching effects of photons (Hong-Ou-Mandel effect).\nTo get a flavor for the course and see if it is right for you, watch \"Let\u0027s get small\", which shows you how poorly you were taught what an atom looks like, and \"The fallacy of physics phobia.\" \nPlease note: the four sections of this course will be released on a weekly basis from April 18, 2017 to May 9, 2017, when all the course material will be available and the course will become fully self-paced.\n ","tutor":"James Freericks","provider":"edX","language":"English","skills":["georgetownx"],"subject":"Quantum Mechanics","studentsInterested":"3.6k","courseLink":"https://www.edx.org/course/quantum-mechanics-everyone-georgetownx-phyx-008-01x","classCentralLink":"https://www.class-central.com/course/edx-quantum-mechanics-for-everyone-8284"},{"title":"The Science of Everyday Thinking","about":"We will explore the psychology of our everyday thinking: why people believe weird things, how we form and change our opinions, why our expectations skew our judgments, and how we can make better decisions. We’ll discuss and debate topics such as placebos, the paranormal, medicine, miracles, and more.\nYou will use the scientific method to evaluate claims, make sense of evidence, and understand why we so often make irrational choices. You will begin to rely on slow, effortful, deliberative, analytic, and logical thinking rather than fast, automatic, instinctive, emotional, and stereotypical thinking.\nWe will provide tools for how to think independently, how to be skeptical, and how to value data over personal experience. We will examine the mental shortcuts that people use and misuse, and apply this knowledge to help make better decisions, and improve critical thinking.","tutor":"Matthew Thompson and Jason Tangen","provider":"edX","language":"English","skills":["uqx"],"subject":"Science","studentsInterested":"18.1k","courseLink":"https://www.edx.org/course/science-everyday-thinking-uqx-think101x-6","classCentralLink":"https://www.class-central.com/course/edx-the-science-of-everyday-thinking-1332"},{"title":"Extinctions: Past and Present","about":"##\nThis free online course explores how life on earth has been shaped by five mass extinction events in the distant past. At present, biodiversity is facing a crisis, with the prospect of a sixth extinction event today.\nExplore the five mass extinctions of the past\nEach week there are discussions with scientists about how their research informs us about the biodiversity of our planet including the very first life forms; fish and tetrapod diversification; the radiation of reptiles and dinosaurs; and the rise of mammals.\nWe focus on the five previous mass extinction events that have shaped the biodiversity of our planet. The fossil record reveals evidence of species that went extinct during these mass extinctions and the new opportunities created for the surviving biota to diversify.\nThe threat of a “sixth extinction” today\nTurning to the present and the anthropocene period, we look at how human behaviour is now beginning to impact the Earth’s ecosystems.\nWe consider the threat of the so-called ‘sixth extinction’, finding out how our actions are reducing biodiversity and threatening the survival of many species.\nLearn with one of the world’s leading paleontologists","tutor":"Anusuya Chinsamy-Turan","provider":"FutureLearn","language":"English","skills":["africa","south africa","new-moocs-2017"],"subject":"Biology","studentsInterested":"2.7k","courseLink":"https://www.futurelearn.com/courses/extinctions-past-present","classCentralLink":"https://www.class-central.com/course/futurelearn-extinctions-past-and-present-8004"},{"title":"Medical Neuroscience","about":"Medical Neuroscience explores the functional organization and neurophysiology of the human central nervous system, while providing a neurobiological framework for understanding human behavior. In this course, you will discover the organization of the neural systems in the brain and spinal cord that mediate sensation, motivate bodily action, and integrate sensorimotor signals with memory, emotion and related faculties of cognition. The overall goal of this course is to provide the foundation for understanding the impairments of sensation, action and cognition that accompany injury, disease or dysfunction in the central nervous system. The course will build upon knowledge acquired through prior studies of cell and molecular biology, general physiology and human anatomy, as we focus primarily on the central nervous system.\n\nThis online course is designed to include all of the core concepts in neurophysiology and clinical neuroanatomy that would be presented in most first-year neuroscience courses in schools of medicine. However, there are some topics (e.g., biological psychiatry) and several learning experiences (e.g., hands-on brain dissection) that we provide in the corresponding course offered in the Duke University School of Medicine on campus that we are not attempting to reproduce in Medical Neuroscience online. Nevertheless, our aim is to faithfully present in scope and rigor a medical school caliber course experience.\n\nThis course comprises six units of content organized into 12 weeks, with an additional week for a comprehensive final exam:\n- Unit 1 Neuroanatomy (weeks 1-2). This unit covers the surface anatomy of the human brain, its internal structure, and the overall organization of sensory and motor systems in the brainstem and spinal cord.\n- Unit 2 Neural signaling (weeks 3-4). This unit addresses the fundamental mechanisms of neuronal excitability, signal generation and propagation, synaptic transmission, post synaptic mechanisms of signal integration, and neural plasticity.\n- Unit 3 Sensory systems (weeks 5-7). Here, you will learn the overall organization and function of the sensory systems that contribute to our sense of self relative to the world around us: somatic sensory systems, proprioception, vision, audition, and balance senses.\n- Unit 4 Motor systems (weeks 8-9). In this unit, we will examine the organization and function of the brain and spinal mechanisms that govern bodily movement.\n- Unit 5 Brain Development (week 10). Next, we turn our attention to the neurobiological mechanisms for building the nervous system in embryonic development and in early postnatal life; we will also consider how the brain changes across the lifespan.\n- Unit 6 Cognition (weeks 11-12). The course concludes with a survey of the association systems of the cerebral hemispheres, with an emphasis on cortical networks that integrate perception, memory and emotion in organizing behavior and planning for the future; we will also consider brain systems for maintaining homeostasis and regulating brain state.","tutor":"Leonard E. White","provider":"Coursera","language":"English","skills":["usa","north america"],"subject":"Biology","studentsInterested":"12.4k","courseLink":"https://www.coursera.org/learn/medical-neuroscience","classCentralLink":"https://www.class-central.com/course/coursera-medical-neuroscience-384"},{"title":"The Science of the Solar System","about":"Learn about the science behind the current exploration of the solar system in this free class. Use principles from physics, chemistry, biology, and geology to understand the latest from Mars, comprehend the outer solar system, ponder planets outside our solar system, and search for habitability in our neighborhood and beyond. This course is generally taught at an advanced level assuming a prior knowledge of undergraduate math and physics, but the majority of the concepts and lectures can be understood without these prerequisites. The quizzes and final exam are designed to make you think critically about the material you have learned rather than to simply make you memorize facts. The class is expected to be challenging but rewarding.","tutor":"Mike Brown","provider":"Coursera","language":"English","skills":["usa","north america"],"subject":"Astronomy","studentsInterested":"11.9k","courseLink":"https://www.coursera.org/learn/solar-system","classCentralLink":"https://www.class-central.com/course/coursera-the-science-of-the-solar-system-1813"},{"title":"Astrobiology and the Search for Extraterrestrial Life","about":"Learn about the origin and evolution of life and the search for life beyond the Earth.","tutor":"Charles Cockell","provider":"Coursera","language":"English","skills":["europe","scotland"],"subject":"Astronomy","studentsInterested":"3.2k","courseLink":"https://www.coursera.org/learn/astrobiology","classCentralLink":"https://www.class-central.com/course/coursera-astrobiology-and-the-search-for-extraterrestrial-life-415"},{"title":"Introduction to Genetics and Evolution","about":"Introduction to Genetics and Evolution is a college-level class being offered simultaneously to new students at Duke University. The course gives interested people a very basic overview of some principles behind these very fundamental areas of biology. We often hear about new \"genome sequences,\" commercial kits that can tell you about your ancestry (including pre-human) from your DNA or disease predispositions, debates about the truth of evolution, why animals behave the way they do, and how people found \"genetic evidence for natural selection.\" This course provides the basic biology you need to understand all of these issues better, tries to clarify some misconceptions, and tries to prepare students for future, more advanced coursework in Biology (and especially evolutionary genetics). No prior coursework is assumed.","tutor":"Mohamed Noor","provider":"Coursera","language":"English","skills":["usa","north america"],"subject":"Biology","studentsInterested":"6.0k","courseLink":"https://www.coursera.org/learn/genetics-evolution","classCentralLink":"https://www.class-central.com/course/coursera-introduction-to-genetics-and-evolution-381"},{"title":"How Things Work: An Introduction to Physics","about":"An introduction to physics in the context of everyday objects.","tutor":"Louis A. Bloomfield","provider":"Coursera","language":"English","skills":["usa","north america"],"subject":"Physics","studentsInterested":"8.4k","courseLink":"https://www.coursera.org/learn/how-things-work","classCentralLink":"https://www.class-central.com/course/coursera-how-things-work-an-introduction-to-physics-431"},{"title":"Dino 101: Dinosaur Paleobiology","about":"Dino 101: Dinosaur Paleobiology is a 12-lesson course teaching a comprehensive overview of non-avian dinosaurs. Topics covered: anatomy, eating, locomotion, growth, environmental and behavioral adaptations, origins and extinction. Lessons are delivered from museums, fossil-preparation labs and dig sites. Estimated workload: 3-5 hrs/week.","tutor":"Philip Currie and Betsy Kruk","provider":"Coursera","language":"English","skills":["usa","north america"],"subject":"Biology","studentsInterested":"3.4k","courseLink":"https://www.coursera.org/learn/dino101","classCentralLink":"https://www.class-central.com/course/coursera-dino-101-dinosaur-paleobiology-1057"},{"title":"Introductory Human Physiology","about":"In this course, students learn to recognize and to apply the basic concepts that govern integrated body function (as an intact organism) in the body\u0027s nine organ systems.","tutor":"Emma Jakoi and Jennifer Carbrey","provider":"Coursera","language":"English","skills":["usa","north america"],"subject":"Biology","studentsInterested":"7.6k","courseLink":"https://www.coursera.org/learn/physiology","classCentralLink":"https://www.class-central.com/course/coursera-introductory-human-physiology-380"},{"title":"Introduction to Biology - The Secret of Life","about":"Read fully to understand the verified-certificate option. Join Professor Eric Lander and the MITx Biology team in this unique introductory biology learning experience. All 7.00x course materials are available here for exploration and completion, including video and interactive problem sets and exams for skill building. We strongly encourage you to work through the activities, towards a goal of learning biology. We have optimized the course settings for learning: instant feedback after trying problems and all content available at all times. We offer a rigorous means of certifying edX learners in their mastery of the MITx introductory biology content, through the MITx 7.00x Introduction to Biology Competency Exam. This exciting option is available ONLY to those who register for the verified-certificate track, and successful completion of this exam is the only assessment that counts toward a certificate. We highly recommend preparing for the Competency Exam certification by using the current course materials and MIT OpenCourseWare problems. The next Competency Exam will be open February 20, 2018 to February 27, 2018.\n\n7.00x is an introductory level biology course hosted by professor Eric Lander, who was one of the leaders of the Human Genome Project. The course content reflects the topics taught in the MIT introductory biology courses and many biology courses across the world. As a learner, you will first focus on the structure and function of macromolecules such as DNA, RNA and proteins. You will discover how changes in the structure of some of these macromolecules alter their functions and what the implications of such changes have on human health. As you continue in the course, you will apply an understanding of heredity and information flow within cells to human health and disease and will learn about molecular biological techniques and their potential to impact our changing world. After you complete this course, you will have a foundation in biology that will allow you to understand the remarkable medical revolution going on today.\n\nMITx 7.00x: Introduction to Biology – The Secret of Life will let you explore the mysteries of biochemistry, genetics, molecular biology, recombinant DNA technology and genomics, and rational medicine. We are excited to take this journey with you!","tutor":"Eric S. Lander and Graham Walker","provider":"edX","language":"English","skills":["mitx"],"subject":"Biology","studentsInterested":"7.6k","courseLink":"https://www.edx.org/course/introduction-biology-secret-life-mitx-7-00x-7","classCentralLink":"https://www.class-central.com/course/edx-introduction-to-biology-the-secret-of-life-637"},{"title":"Understanding the Brain: The Neurobiology of Everyday Life","about":"Learn how the nervous system produces behavior, how we use our brain every day, and how neuroscience can explain the common problems afflicting people today. We will study functional human neuroanatomy and neuronal communication, and then use this information to understand how we perceive the outside world, move our bodies voluntarily, stay alive, and play well with others.","tutor":"Peggy Mason","provider":"Coursera","language":"English","skills":["usa","north america"],"subject":"Biology","studentsInterested":"11.9k","courseLink":"https://www.coursera.org/learn/neurobiology","classCentralLink":"https://www.class-central.com/course/coursera-understanding-the-brain-the-neurobiology-of-everyday-life-1606"},{"title":"From the Big Bang to Dark Energy","about":"We have learned a lot recently about how the Universe evolved in 13.7 billion years since the Big Bang. More than 80% of matter in the Universe is mysterious Dark Matter, which made stars and galaxies to form. The newly discovered Higgs-boson became frozen into the Universe a trillionth of a second after the Big Bang and brought order to the Universe. Yet we still do not know how ordinary matter (atoms) survived against total annihilation by Anti-Matter. The expansion of the Universe started acceleration about 7 billion years ago and the Universe is being ripped apart. The culprit is Dark Energy, a mysterious energy multiplying in vacuum. I will present evidence behind these startling discoveries and discuss what we may learn in the near future.\n\nThis course is offered in English.","tutor":"Hitoshi Murayama","provider":"Coursera","language":"English","skills":["japan","asia"],"subject":"Astronomy","studentsInterested":"3.4k","courseLink":"https://www.coursera.org/learn/big-bang","classCentralLink":"https://www.class-central.com/course/coursera-from-the-big-bang-to-dark-energy-722"},{"title":"Dog Emotion and Cognition","about":"Dog Emotion and Cognition will introduce you to the exciting new study of dog psychology, what the latest discoveries tell us about how dogs think and feel about us, and how we can use this new knowledge to further strengthen our relationship with our best friends.","tutor":"Brian Hare","provider":"Coursera","language":"English","skills":["canine psychology","dogs","usa","north america"],"subject":"Science","studentsInterested":"2.5k","courseLink":"https://www.coursera.org/learn/dog-emotion-and-cognition","classCentralLink":"https://www.class-central.com/course/coursera-dog-emotion-and-cognition-3627"},{"title":"Anatomy: Know Your Abdomen","about":"##\nThis course will help you identify the positions of organs within the abdomen and will introduce you to common anatomical terminology.\nYou will look at the anterior (front) abdominal wall, exploring how the ‘abs’ are considered in relation to health and beauty. You’ll then move on to look at the composition of the gastrointestinal tract. Focussing on common problems that can occur in this tract, you’ll hear from an abdominal surgeon about the work he does to treat and cure such problems.\nThis course is part of the Going to University collection which has been specifically designed for schools and colleges. The course can be used as a teachers’ classroom enrichment resource or can be studied independently by students.","tutor":"James Pickering","provider":"FutureLearn","language":"English","skills":["human anatomy","europe","uk","abdomen","stomach"],"subject":"Biology","studentsInterested":"272","courseLink":"https://www.futurelearn.com/courses/anatomy-know-your-abdomen","classCentralLink":"https://www.class-central.com/course/futurelearn-anatomy-know-your-abdomen-5008"},{"title":"The Brain and Space","about":"This course is about how the brain creates our sense of spatial location from a variety of sensory and motor sources, and how this spatial sense in turn shapes our cognitive abilities.\n\nKnowing where things are is effortless. But “under the hood,” your brain must figure out even the simplest of details about the world around you and your position in it. Recognizing your mother, finding your phone, going to the grocery store, playing the banjo – these require careful sleuthing and coordination across different sensory and motor domains. This course traces the brain’s detective work to create this sense of space and argues that the brain’s spatial focus permeates our cognitive abilities, affecting the way we think and remember.\n\nThe material in this course is based on a book I\u0027ve written for a general audience. The book is called \"Making Space: How the Brain Knows Where Things Are\", and is available from Amazon, Barnes and Noble, or directly from Harvard University Press.\n\nThe course material overlaps with classes on perception or systems neuroscience, and can be taken either before or after such classes.\n\nDr. Jennifer M. Groh, Ph.D.\nProfessor\nPsychology \u0026 Neuroscience; Neurobiology\nDuke University\nwww.duke.edu/~jmgroh\n\nJennifer M. Groh is interested in how the brain process spatial information in different sensory systems, and how the brain\u0027s spatial codes influence other aspects of cognition. She is the author of a recent book entitled \"Making Space: How the Brain Knows Where Things Are\" (Harvard University Press, fall 2014).\n\nMuch of her research concerns differences in how the visual and auditory systems encode location, and how vision influences hearing. Her laboratory has demonstrated that neurons in auditory brain regions are sometimes responsive not just to what we hear but also to what direction we are looking and what visual stimuli we can see. These surprising findings challenge the prevailing assumption that the brain’s sensory pathways remain separate and distinct from each other at early stages, and suggest a mechanism for such multi-sensory interactions as lip-reading and ventriloquism (the capture of perceived sound location by a plausible nearby visual stimulus).\n\nDr. Groh has been a professor at Duke University since 2006. She received her undergraduate degree in biology from Princeton University in 1988 before studying neuroscience at the University of Michigan (Master’s, 1990), the University of Pennsylvania (Ph.D., 1993), and Stanford University (postdoctoral, 1994-1997). Dr. Groh has been teaching undergraduate classes on the neural basis of perception and memory for over fifteen years. She is presently a faculty member at the Center for Cognitive Neuroscience and the Duke Institute for Brain Sciences at Duke University. She also holds appointments in the Departments of Neurobiology and Psychology \u0026 Neuroscience at Duke.\n\nDr. Groh’s research has been supported by a variety of sources including the John S. Guggenheim Foundation, the National Institutes of Health, the National Science Foundation, and the Office of Naval Research Young Investigator Program, the McKnight Endowment Fund for Neuroscience, the John Merck Scholars Program, the EJLB Foundation, the Alfred P. Sloan Foundation, the Whitehall Foundation, and the National Organization for Hearing Research.","tutor":"Jennifer Groh","provider":"Coursera","language":"English","skills":["neuroscience","human brain","perception","spatial recognition","usa","north america"],"subject":"Chemistry","studentsInterested":"7.7k","courseLink":"https://www.coursera.org/learn/human-brain","classCentralLink":"https://www.class-central.com/course/coursera-the-brain-and-space-1362"},{"title":"Understanding Einstein: The Special Theory of Relativity","about":"In this course we will seek to “understand Einstein,” especially focusing on the special theory of relativity that Albert Einstein, as a twenty-six year old patent clerk, introduced in his “miracle year” of 1905. Our goal will be to go behind the myth-making and beyond the popularized presentations of relativity in order to gain a deeper understanding of both Einstein the person and the concepts, predictions, and strange paradoxes of his theory. Some of the questions we will address include: How did Einstein come up with his ideas? What was the nature of his genius? What is the meaning of relativity? What’s “special” about the special theory of relativity? Why did the theory initially seem to be dead on arrival? What does it mean to say that time is the “fourth dimension”? Can time actually run more slowly for one person than another, and the size of things change depending on their velocity? Is time travel possible, and if so, how? Why can’t things travel faster than the speed of light? Is it possible to travel to the center of the galaxy and return in one lifetime? Is there any evidence that definitively confirms the theory, or is it mainly speculation? Why didn’t Einstein win the Nobel Prize for the theory of relativity?\n\nAbout the instructor: Dr. Larry Lagerstrom is the Director of Academic Programs at Stanford University’s Center for Professional Development, which offers graduate certificates in subjects such as artificial intelligence, cyber security, data mining, nanotechnology, innovation, and management science. He holds degrees in physics, mathematics, and the history of science, has published a book and a TED Ed video on \"Young Einstein: From the Doxerl Affair to the Miracle Year,\" and has had over 30,000 students worldwide enroll in his online course on the special theory of relativity (this course!).","tutor":"Larry Randles Lagerstrom","provider":"Coursera","language":"English","skills":["usa","north america"],"subject":"Physics","studentsInterested":"2.5k","courseLink":"https://www.coursera.org/learn/einstein-relativity","classCentralLink":"https://www.class-central.com/course/coursera-understanding-einstein-the-special-theory-of-relativity-765"},{"title":"Genes and the Human Condition (From Behavior to Biotechnology)","about":"To acquire an understanding of the fundamental concepts of genomics and biotechnology, and their implications for human biology, evolution, medicine, social policy and individual life path choices in the 21st century.","tutor":"Dr. Tammatha O\u0027Brien and Dr. Raymond St. Leger","provider":"Coursera","language":"English","skills":["usa","north america"],"subject":"Biology","studentsInterested":"4.8k","courseLink":"https://www.coursera.org/learn/genes","classCentralLink":"https://www.class-central.com/course/coursera-genes-and-the-human-condition-from-behavior-to-biotechnology-597"},{"title":"The Age of Sustainable Development","about":"The Age of Sustainable Development\" gives students an understanding of the key challenges and pathways to sustainable development - that is, economic development that is also socially inclusive and environmentally sustainable.","tutor":"Jeffrey Sachs","provider":"Coursera","language":"English","skills":["usa","north america"],"subject":"Environmental Science","studentsInterested":"7.4k","courseLink":"https://www.coursera.org/learn/sustainable-development","classCentralLink":"https://www.class-central.com/course/coursera-the-age-of-sustainable-development-1533"},{"title":"Animal Behaviour and Welfare","about":"Animal welfare has been described as a complex, multi-faceted public policy issue which includes important scientific, ethical, and other dimensions. Improving our understanding of animal welfare, involves the fascinating study of animal behavior as well as the challenge of accessing the emotions of animals.\n\nThis is the On-Demand version of this course, which means you can start the course at any time and work through the course materials at your own pace. The materials and quizzes will always be available to you.\n\nYou can come and talk about the course on Twitter using the hashtag #EdAniWelf","tutor":"Nat Waran and Fritha Langford","provider":"Coursera","language":"English","skills":["europe","scotland"],"subject":"Biology","studentsInterested":"844","courseLink":"https://www.coursera.org/learn/animal-welfare","classCentralLink":"https://www.class-central.com/course/coursera-animal-behaviour-and-welfare-1357"},{"title":"Good Brain, Bad Brain: Basics","about":"Understand your own amazing brain\nWe will look at what your brain is made of, how these components are organised and how they function.\nThis information is helping neuroscientists across the globe understand the brain - and how it is able to do everything from stopping you falling off your bike, to making you feel sad that your football team lost their game, to helping you learn how your brain works.\nThis course is aimed at anyone with an interest in finding out the fundamentals of how the human brain works. It assumes that you will have basic school-level biological knowledge.\nYou might be doing your A-levels and considering a neuroscience-related degree; a computer-scientist interested in neural networks; or in business and wondering how the workings of your employees’ brains influences the culture of your business.","tutor":"Alison Cooper","provider":"FutureLearn","language":"English","skills":["europe","uk"],"subject":"Biology","studentsInterested":"392","courseLink":"https://www.futurelearn.com/courses/good-brain-bad-brain-basics","classCentralLink":"https://www.class-central.com/course/futurelearn-good-brain-bad-brain-basics-1444"},{"title":"The Bilingual Brain","about":"This course explores the brain bases of bilingualism by discussing literature relevant to differences in age of initial learning, proficiency, and control in the nonverbal, single language and dual-language literature. Participants will learn about the latest research related to how humans learn one or two languages and other cognitive skills.","tutor":"Arturo Hernandez and","provider":"Coursera","language":"English","skills":["usa","north america"],"subject":"Biology","studentsInterested":"2.2k","courseLink":"https://www.coursera.org/learn/bilingual","classCentralLink":"https://www.class-central.com/course/coursera-the-bilingual-brain-2667"},{"title":"Astronomy: Exploring Time and Space","about":"This course is designed for anyone who is interested in learning more about modern astronomy. We will help you get up to date on the most recent astronomical discoveries while also providing support at an introductory level for those who have no background in science.","tutor":"Chris Impey and Matthew Wenger","provider":"Coursera","language":"English","skills":["astronomy","usa","north america"],"subject":"Astronomy","studentsInterested":"3.0k","courseLink":"https://www.coursera.org/learn/astro","classCentralLink":"https://www.class-central.com/course/coursera-astronomy-exploring-time-and-space-3007"},{"title":"Introduction to Physical Chemistry","about":"Chemical reactions underpin the production of pretty much everything in our modern world. But, what is the driving force behind reactions? Why do some reactions occur over geological time scales whilst others are so fast that we need femtosecond-pulsed lasers to study them? Ultimately, what is going on at the atomic level? Discover the answers to such fundamental questions and more on this course in introductory physical chemistry.\n\nThe course covers the key concepts of three of the principal topics in first-year undergraduate physical chemistry: thermodynamics, kinetics and quantum mechanics. These three topics cover whether or not reactions occur, how fast they go and what is actually going on at the sub-atomic scale.","tutor":"Patrick O\u0027Malley, Michael Anderson and Jonathan Agger","provider":"Coursera","language":"English","skills":["europe","uk"],"subject":"Chemistry","studentsInterested":"763","courseLink":"https://www.coursera.org/learn/physical-chemistry","classCentralLink":"https://www.class-central.com/course/coursera-introduction-to-physical-chemistry-1456"},{"title":"Introduction to Forensic Science","about":"We have all seen forensic scientists in TV shows, but how do they really work? What is the science behind their work?\n\nThe course aims to explain the scientific principles and techniques behind the work of forensic scientists and will be illustrated with numerous case studies from Singapore and around the world.\n\nSome questions which we will attempt to address include:\n\nHow did forensics come about? What is the role of forensics in police work? Can these methods be used in non-criminal areas?\nBlood. What is it? How can traces of blood be found and used in evidence?\nIs DNA chemistry really so powerful?\nWhat happens (biologically and chemically) if someone tries to poison me? What happens if I try to poison myself?\nHow can we tell how long someone has been dead? What if they have been dead for a really long time?\nCan a little piece of a carpet fluff, or a single hair, convict someone?\nWas Emperor Napoleon murdered by the perfidious British, or killed by his wallpaper?\n\n*For Nanyang Technological University (NTU) students, please be noted that this course will no longer be eligible for credit transfer.","tutor":"Roderick Bates","provider":"Coursera","language":"English","skills":["forensic science","asia","singapore"],"subject":"Science","studentsInterested":"2.6k","courseLink":"https://www.coursera.org/learn/forensic-science","classCentralLink":"https://www.class-central.com/course/coursera-introduction-to-forensic-science-1264"},{"title":"Intro to Physics","about":"Study physics abroad in Europe -- virtually! Learn the basics of physics on location in Italy, the Netherlands and the UK, by answering some of the discipline\u0027s major questions from over the last 2000 years.\n\n\nWhy Take This Course?\nThis unique class gives you the chance to see the sites where physics history was made and learn some of the subject\u0027s most captivating concepts.","tutor":"Andy Brown","provider":"Udacity","language":"English","skills":["physics"],"subject":"Physics","studentsInterested":"1.7k","courseLink":"https://www.udacity.com/course/intro-to-physics--ph100","classCentralLink":"https://www.class-central.com/course/udacity-intro-to-physics-363"},{"title":"Greatest Unsolved Mysteries of the Universe","about":"Despite spectacular recent progress, there is still a lot we don\u0027t know about our universe. We don\u0027t know why the Big Bang happened. We don\u0027t know what most of the universe is made of. We don\u0027t know whether there is life in space. We don\u0027t know how planets form, how black holes get so big, or where the first stars have gone. This course will take you through nine of the greatest unsolved problems of modern astrophysics. We can\u0027t promise you the answers, but we will explain what we do and don\u0027t know, and give you an up-to-date understanding of current research. This course is designed for people who would like to get a deeper understanding of these mysteries than that offered by popular science articles and shows. \nThis is the first of four ANUx courses which together make up the Australian National University\u0027s first year astrophysics program. It is followed by courses on exoplanets, on the violent universe, and on cosmology. These courses compromise the Astrophysics XSeries. Learn more about the XSeries program and register for all the courses in the series today!","tutor":"Paul Francis and Brian Schmidt","provider":"edX","language":"English","skills":["anux"],"subject":"Astronomy","studentsInterested":"3.8k","courseLink":"https://www.edx.org/course/greatest-unsolved-mysteries-universe-anux-anu-astro1x-2","classCentralLink":"https://www.class-central.com/course/edx-greatest-unsolved-mysteries-of-the-universe-1598"},{"title":"Synapses, Neurons and Brains","about":"These are very unique times for brain research. The aperitif for the course will thus highlight the present “brain-excitements” worldwide. You will then become intimately acquainted with the operational principles of neuronal “life-ware” (synapses, neurons and the networks that they form) and consequently, on how neurons behave as computational microchips and how they plastically and constantly change - a process that underlies learning and memory. Recent heroic attempts to realistically simulate large cortical networks in the computer will be highlighted (e.g., “the Blue Brain Project”) and processes related to perception, cognition and emotions in the brain will be discussed. For dessert we will deliberate on the future of brain research, including the questions of “brain and art”, consciousness and free will. For more information see the course promo below and read “About the course.”","tutor":"Idan Segev","provider":"Coursera","language":"English","skills":["asia","israel"],"subject":"Biology","studentsInterested":"1.5k","courseLink":"https://www.coursera.org/learn/synapses","classCentralLink":"https://www.class-central.com/course/coursera-synapses-neurons-and-brains-504"},{"title":"Gut Check: Exploring Your Microbiome","about":"Imagine if there were an organ in your body that weighed as much as your brain, that affected your health, your weight, and even your behavior. Wouldn’t you want to know more about it? There is such an organ — the collection of microbes in and on your body, your human microbiome.","tutor":"Rob Knight, Jessica Metcalf and Katherine Amato","provider":"Coursera","language":"English","skills":["biology","usa","north america"],"subject":"Biology","studentsInterested":"928","courseLink":"https://www.coursera.org/learn/microbiome","classCentralLink":"https://www.class-central.com/course/coursera-gut-check-exploring-your-microbiome-2305"},{"title":"AstroTech: The Science and Technology behind Astronomical Discovery","about":"\"How do they know that?\"\n\nModern astronomy has made some astonishing discoveries - how stars burn and how black holes form; galaxies from the edge of the universe and killer rocks right next door; where the elements come from and how the expanding universe is accelerating. But how do we know all that? The truth is that astronomy would be impossible without technology, and every advance in astronomy is really an advance in technology. But the technology by itself is not enough. We have to apply it critically with a knowledge of physics to unlock the secrets of the Universe.\n\nEach week we will cover a different aspect of Astronomical technology, matching each piece of technology to a highlight science result. We will explain how the technology works, how it has allowed us to collect astronomical data, and, with some basic physics, how we interpret the data to make scientific discoveries.\n\nThe class will consist of video lectures, weekly quizzes, and discussion forums. Each week there will be five videos, totalling approximately 40 minutes. They will be in a regular pattern - a short introduction, an example science story, an explanation of the key technology area, a look at how the technology is used in practice, and finally a look at what the future may hold.","tutor":"Andy Lawrence and Catherine Heymans","provider":"Coursera","language":"English","skills":["europe","scotland"],"subject":"Astronomy","studentsInterested":"869","courseLink":"https://www.coursera.org/learn/astronomy-technology","classCentralLink":"https://www.class-central.com/course/coursera-astrotech-the-science-and-technology-behind-astronomical-discovery-1360"},{"title":"Marine and Antarctic Science","about":"Have you ever wondered about the diversity of marine biota in our oceans? Do you know what a nudibranch is? Or how a kelp forest functions? Did you realise that the ocean ‘pumps’ carbon? Are you interested in how marine systems; from coral reefs to Antarctic ecosystems are managed?\nThis course will introduce you to the fascinating world of our oceans. You will learn about marine life and key features of the ocean system. You will also explore some of the stressors on marine systems caused by human activity. Finally, this course will cover how society might sensibly approach managing those threats into the future.\nWhat will I learn?\nHow life has evolved in the sea\nHow marine food webs are structured\nHow some particularly interesting ecosystems function such as kelp forests, the Antarctic ocean, and the deep sea\nWhat oceanographers do and some of the technologies they use\nWhat drives plant growth and thus ecosystem productivity in the oceans\nThe role of the ocean in shaping and regulating our climate\nHow plate tectonics shape the ocean basins and influence current patterns\nConsequences of climate change for ocean processes and marine biota\nHow fishing and other human pressures affect ocean systems\nHow seafood is likely to be an important food source in the future","tutor":"Professor Craig Johnson and Dr Jess Melbourne-Thomas","provider":"Open2Study","language":"English","skills":[],"subject":"Environmental Science","studentsInterested":"3.1k","courseLink":"https://www.open2study.com/courses/marine-and-antarctic-science","classCentralLink":"https://www.class-central.com/course/open2study-marine-and-antarctic-science-1641"},{"title":"Energy 101: The Big Picture","about":"As a society and individually, we use energy every moment of our lives to improve our quality of life. Energy 101 will develop the big picture and connect the details of our energy use, technology, infrastructure, impact, and future.","tutor":"Sam Shelton","provider":"Coursera","language":"English","skills":["energy","energy policy","sustainability"],"subject":"Environmental Science","studentsInterested":"341","courseLink":"https://www.coursera.org/learn/energy-101","classCentralLink":"https://www.class-central.com/course/coursera-energy-101-the-big-picture-405"},{"title":"Quantum Mechanics: 1D Scattering and Central Potentials","about":"In this quantum physics course you will learn the basic concepts of scattering – phase-shifts, time delays, Levinson’s theorem, and resonances – in the simple context of one-dimensional problems. We then turn to the study of angular momentum and the motion of particles in three-dimensional central potentials. We learn about the radial equation and study the case of the hydrogen atom in detail.\nThis is the final course in a series which includes:\nQuantum Mechanics: Wavefunctions, Operators, and Expectation Values\nQuantum Mechanics: Quantum Physics in 1D Potentials\nQuantum Mechanics: 1D Scattering and Central Potentials\nThe series is based on the MIT 8.04: Quantum Mechanics I. At MIT, 8.04 is the first of a three-course sequence in Quantum Mechanics, a cornerstone in the education of physics majors that prepares them for advanced and specialized studies in any field related to quantum physics.\nAfter completing the 8.04x series, you will be ready to tackle the Mastering Quantum Mechanics course series on edX, which will be available in Spring 2018.","tutor":"Barton Zwiebach , Jolyon Bloomfield and Saif Rayyan","provider":"edX","language":"English","skills":["mitx"],"subject":"Quantum Mechanics","studentsInterested":"713","courseLink":"https://www.edx.org/course/quantum-mechanics-1d-scattering-central-mitx-8-04-3x","classCentralLink":"https://www.class-central.com/course/edx-quantum-mechanics-1d-scattering-and-central-potentials-8769"},{"title":"Fundamentals of Neuroscience Part 1: Electrical Properties of the Neuron","about":"Fundamentals of Neuroscience is a three part course that explores the structure and function of the nervous system -- from the microscopic inner workings of a single nerve cell, to the staggering complexity of the brain, and beyond to the social interactions and societal dynamics that our brains make possible.\nIn this first module we’ll look at how individual neurons use electricity to transmit information.  We’ll invite you to build up a neuron, piece by piece, using interactive simulations, and we’ll take you on field trips in and around Harvard and Boston, bring you into the lab, and show you how to conduct DIY neuroscience experiments on your own.\nLessons will include video content, interactive content, forum spaces associated with the lessons, and in Lessons 3, labs and lab content.\nYou can move around within the lessons at your own pace. The only \u0027graded\u0027 part of the course is your final exam. You don\u0027t have to get everything correct to \u0027complete\u0027 lessons, you just have to engage with the content! \nPlease note that this course is NOT hosted on the edX platform, but can be found at  www.mcb80x.org. To receive a certificate for this course, you must register for the course through EdX and successfully complete the final exam during an established exam period.\nHarvardX requires individuals who enroll in its courses on edX to abide by the terms of the edX honor code. HarvardX will take appropriate corrective action in response to violations of the edX honor code, which may include dismissal from the HarvardX course; revocation of any certificates received for the HarvardX course; or other remedies as circumstances warrant. No refunds will be issued in the case of corrective action for such violations. Enrollees who are taking HarvardX courses as part of another program will also be governed by the academic policies of those programs.","tutor":"David Cox","provider":"edX","language":"English","skills":["harvardx","usa","north america"],"subject":"Biology","studentsInterested":"3.2k","courseLink":"https://www.edx.org/course/fundamentals-neuroscience-part-1-harvardx-mcb80-1x-0","classCentralLink":"https://www.class-central.com/course/edx-fundamentals-of-neuroscience-part-1-electrical-properties-of-the-neuron-942"},{"title":"Physics-Based Sound Synthesis for Games and Interactive Systems","about":"This course introduces the basics of Digital Signal Processing and computational acoustics, motivated by the vibrational physics of real-world objects and systems. We will build from a simple mass-spring and pendulum to demonstrate oscillation, learn how to simulate those systems in the computer, and also prove that these simple oscillations behave as a sine wave. From that we move to plucked strings and struck bars, showing both solutions as combined traveling waves and combined sine wave harmonics. We continue to build and simulate more complex systems containing many vibrating objects and resonators (stringed instruments, drum, plate), and also learn how to simulate echos and room reverberation. Through this process, we will learn about digital signals, filters, oscillators, harmonics, spectral analysis, linear and non-linear systems, particle models, and all the necessary building blocks to synthesize essentially any sound. The free open-source software provided will make it possible for anyone to use physical models in their art-making, game or movie sound, or any other application.","tutor":"Perry R. Cook and Julius O. Smith III","provider":"Kadenze","language":"English","skills":["physics","signal processing","digital audio synthesis","usa","north america"],"subject":"Physics","studentsInterested":"1.2k","courseLink":"https://www.kadenze.com/courses/physics-based-sound-synthesis-for-games-and-interactive-systems","classCentralLink":"https://www.class-central.com/course/kadenze-physics-based-sound-synthesis-for-games-and-interactive-systems-3763"},{"title":"Science \u0026 Cooking: From Haute Cuisine to Soft Matter Science (part 1)","about":"During each module of this course, chefs reveal the secrets behind some of their most famous culinary creations — often right in their own restaurants. Inspired by such cooking mastery, the Harvard team will then explain the science behind the recipe.\nTopics will include:\nHow molecules influence flavor\nThe role of heat in cooking\nDiffusion, revealed by the phenomenon of spherification, the culinary technique pioneered by Ferran Adrià.\nYou will also have the opportunity to become an experimental scientist in your very own laboratory — your kitchen. By following along with the engaging recipe of the week, taking precise measurements, and making skillful observations, you will learn to think like both a cook and a scientist. The lab is certainly one of the most unique components of this course — after all, in what other science course can you eat your experiments?\nHarvardX requires individuals who enroll in its courses on edX to abide by the terms of the edX honor code : https://www.edx.org/edx-terms-service. HarvardX will take appropriate corrective action in response to violations of the edX honor code, which may include dismissal from the HarvardX course; revocation of any certificates received for the HarvardX course; or other remedies as circumstances warrant. No refunds will be issued in the case of corrective action for such violations. Enrollees who are taking HarvardX courses as part of another program will also be governed by the academic policies of those programs.","tutor":"Michael Brenner, David Weitz and Pia Sörensen","provider":"edX","language":"English","skills":["harvardx"],"subject":"Science","studentsInterested":"3.5k","courseLink":"https://www.edx.org/course/science-cooking-haute-cuisine-soft-harvardx-spu27-1x-0","classCentralLink":"https://www.class-central.com/course/edx-science-cooking-from-haute-cuisine-to-soft-matter-science-part-1-811"},{"title":"Best Practices for Biomedical Research Data Management","about":"With the increasing focus on research data, this course has been developed to address present and future researchers’ data management learning needs.","tutor":"Elaine Martin and Julie Goldman","provider":"Canvas Network","language":"English","skills":["data management","data","biomedical research"],"subject":"Biology","studentsInterested":"325","courseLink":"https://http://www.canvas.net/browse/harvard-medical/courses/biomed-research-data-mgmt","classCentralLink":"https://www.class-central.com/course/canvas-network-best-practices-for-biomedical-research-data-management-10172"},{"title":"Understanding Plants - Part I: What a Plant Knows","about":"For centuries we have collectively marveled at plant diversity and form—from Charles Darwin’s early fascination with stems and flowers to Seymour Krelborn’s distorted doting in Little Shop of Horrors. This course intends to present an intriguing and scientifically valid look at how plants themselves experience the world—from the colors they see to the sensations they feel. Highlighting the latest research in genetics and more, we will delve into the inner lives of plants and draw parallels with the human senses to reveal that we have much more in common with sunflowers and oak trees than we may realize. We’ll learn how plants know up from down, how they know when a neighbor has been infested by a group of hungry beetles, and whether they appreciate the music you’ve been playing for them or if they’re just deaf to the sounds around them. We’ll explore definitions of memory and consciousness as they relate to plants in asking whether we can say that plants might even be aware of their surroundings. This highly interdisciplinary course meshes historical studies with cutting edge modern research and will be relevant to all humans who seek their place in nature.\n\nThis class has three main goals: 1. To introduce you to basic plant biology by exploring plant senses (sight, smell, hearing, touch, taste, balance). 2. To introduce you to biological research and the scientific method. 3. To get the student to question life in general and what defines us as humans.\n\nOnce you\u0027ve taken this course, if you are interested in a more in-depth study of plants, check out my follow-up course, Fundamentals of Plant Biology.\n\nIn order to receive academic credit for this course you must successfully pass the academic exam on campus. For information on how to register for the academic exam – https://tauonline.tau.ac.il/registration\n\nAdditionally, you can apply to certain degrees using the grades you received on the courses. Read more on this here –\nhttps://go.tau.ac.il/b.a/mooc-acceptance\n\nTeachers interested in teaching this course in their class rooms are invited to explore our Academic High school program here – https://tauonline.tau.ac.il/online-highschool","tutor":"Daniel Chamovitz and Aviva Katz","provider":"Coursera","language":"English","skills":["asia","israel"],"subject":"Environmental Science","studentsInterested":"3.7k","courseLink":"https://www.coursera.org/learn/plantknows","classCentralLink":"https://www.class-central.com/course/coursera-understanding-plants-part-i-what-a-plant-knows-975"},{"title":"Epigenetic Control of Gene Expression","about":"While the human genome sequence has transformed our understanding of human biology, it isn’t just the sequence of your DNA that matters, but also how you use it! How are some genes activated and others are silenced? How is this controlled? The answer is epigenetics.\n\nEpigenetics has been a hot topic for research over the past decade as it has become clear that aberrant epigenetic control contributes to disease (particularly to cancer). Epigenetic alterations are heritable through cell division, and in some instances are able to behave similarly to mutations in terms of their stability. Importantly, unlike genetic mutations, epigenetic modifications are reversible and therefore have the potential to be manipulated therapeutically. It has also become clear in recent years that epigenetic modifications are sensitive to the environment (for example diet), which has sparked a large amount of public debate and research.\n\nThis course will give an introduction to the fundamentals of epigenetic control. We will examine epigenetic phenomena that are manifestations of epigenetic control in several organisms, with a focus on mammals. We will examine the interplay between epigenetic control and the environment and finally the role of aberrant epigenetic control in disease.\n\nAll necessary information will be covered in the lectures, and recommended and required readings will be provided. There are no additional required texts for this course. For those interested, additional information can be obtained in the following textbook.\n\nEpigenetics. Allis, Jenuwein, Reinberg and Caparros. Cold Spring Harbour Laboratory Press. ISBN-13: 978-0879697242 | Edition: 1","tutor":"Dr Marnie Blewitt","provider":"Coursera","language":"English","skills":["australia"],"subject":"Biology","studentsInterested":"981","courseLink":"https://www.coursera.org/learn/epigenetics","classCentralLink":"https://www.class-central.com/course/coursera-epigenetic-control-of-gene-expression-486"},{"title":"Astrophysics: Exploring Exoplanets","about":"The discovery of exoplanets is one of the greatest revolutions in modern astrophysics. Twenty years ago, we had no idea whether any of the countless stars out there beyond our solar system had planets or not.\nToday, things are totally different. Over 1,000 planetary systems have been discovered. The universe is teeming with planets. And what strange planets they are - hot Jupiter-like planets skimming the surfaces of their stars, cold and lonely free-floating planets far from any star, planets made of diamond, planets with rain made of glass, super-Earths and even planets orbiting neutron stars. In this course, we’ll bring you up-to-date with the latest research on exoplanets, and how this research has revolutionised our understanding of the formation of solar systems like our own.\nThis course is designed for people who would like to get a deeper understanding of these mysteries than that offered by popular science articles and shows. You will need reasonable high-school level mathematics and physics to get the most out of this course.\nThis is the second of four ANUx courses which together make up the Australian National University\u0027s first year astrophysics program. It follows on from the introductory course on the Greatest Unsolved Mysteries of the Universe, and is followed by courses on the violent universe and on cosmology. These courses compromise the Astrophysics XSeries. Learn more about the XSeries program and register for all the courses in the series today!","tutor":"Paul Francis and Brian Schmidt","provider":"edX","language":"English","skills":["anux"],"subject":"Astronomy","studentsInterested":"4.5k","courseLink":"https://www.edx.org/course/astrophysics-exploring-exoplanets-anux-anu-astro2x-1","classCentralLink":"https://www.class-central.com/course/edx-astrophysics-exploring-exoplanets-1635"},{"title":"Astrophysics: Cosmology","about":"This course covers cosmology – the study of our entire universe. Where did the universe come from? How will it end? What is the nature of space and time?  For the first time in human history, we can give precise, reliable answers to many cosmological questions, thanks to a spectacular series of recent breakthroughs.  But many of the most fundamental mysteries remain unsolved. In this course we will cover the latest advances and the unsolved mysteries. We will explain the recent observations, and with the help of guest speakers Lawrence Krauss and Brian Cox, we will explore the theories behind modern cosmology.\nThis course is designed for people who would like to get a deeper understanding of astronomy than that offered by popular science articles and shows. You will need reasonable high-school level Maths and Physics to get the most out of this course.\nThis is one of four ANUx courses which together make up the Australian National University\u0027s first year astrophysics program. You can take these four courses in any order. These courses compromise the Astrophysics XSeries. Learn more about the XSeries program and register for all the courses in the series today!","tutor":"Paul Francis and Brian Schmidt","provider":"edX","language":"English","skills":["anux"],"subject":"Astronomy","studentsInterested":"5.2k","courseLink":"https://www.edx.org/course/astrophysics-cosmology-anux-anu-astro4x-0","classCentralLink":"https://www.class-central.com/course/edx-astrophysics-cosmology-3031"},{"title":"Climate Change Science and Negotiations","about":"Humanity has just about run out of time to address climate change. Scientists have pointed out that a rise in mean surface temperature of 2º Celsius above pre-industrial levels will put the Earth in dangerous, uncharted territory. Yet we currently are on a path toward an increase of 4º or more this century.\n\nFortunately, solutions exist to deeply decarbonize the global energy systems, and put the world on a 2°C pathway: improvements in energy efficiency in the building, transport and industry sectors; the generation of low-carbon electricity, through a mix of renewable energies (wind, solar), nuclear, and fossil fuels with Carbon Capture and Sequestration (CCS); and the shift to low-carbon energy carriers in energy end-use sectors, such as electric vehicles.\n\nDuring this course, you will learn about these solutions and how they can be applied in different national contexts, based on the results from the Deep Decarbonization Pathways Project (DDPP), a global initiative to show how countries can transition to a low carbon economy by 2050, and how the world can stay within the 2°C limit.\n\nPlease note that this course was created before the 2015 United Nations Climate Change Conference, COP21, in Paris. We are offering it again now because we think much of the course is still relevant. There are other courses, such as Climate Action: Our Changing Planet, that have been more recently updated.","tutor":"Emmanuel Guerin and Jeffrey Sachs","provider":"Independent","language":"English","skills":["climate change","environmental science"],"subject":"Climate Change","studentsInterested":"988","courseLink":"https://courses.sdgacademy.org/learn/climate-change-science-and-negotiations-on-demand","classCentralLink":"https://www.class-central.com/course/climate-change-science-and-negotiations-2484"},{"title":"Sustainable Food Production Through Livestock Health Management","about":"Learn about the impact of infectious disease on sustainable animal-based food production by understanding the science of growth, immunity, and infection and by learning the problem-solving skills needed to advance animal health and food production through optimal management practices.\n\nThere is a growing global need in agricultural production for a workforce that is capable of integrating knowledge of animal health and production with an understanding of consumer preferences in the context of economic reality, business efficiency, and ethical constraint. However, current evidence suggests that there is a growing shortage of people with the knowledge and problem-solving skills required to match the rapid advances being made in animal health, science, and food production. The results of this shortage are wide-ranging and could lead to challenges in food security and agricultural economic competitiveness in some countries.\n\nIn this course we will explore the effect of infectious disease on sustainable animal-based food production. The content and learning outcomes of this new course will be designed to be relevant across different food production sectors (i.e., beef, dairy, poultry, and pigs). While the instructors will provide the participants with a strong scientific base for understanding the impact of infectious disease in animal-based food production, the emphasis of the material will be on practical problem-solving and will be directed towards equipping participants with a platform for developing the skills needed to contribute to sustainable food production.","tutor":"Brian Aldridge, Christopher Burns and Jim Lowe","provider":"Coursera","language":"English","skills":["usa","north america"],"subject":"Environmental Science","studentsInterested":"2.1k","courseLink":"https://www.coursera.org/learn/livestock-farming","classCentralLink":"https://www.class-central.com/course/coursera-sustainable-food-production-through-livestock-health-management-1402"},{"title":"Designing, Running, and Analyzing Experiments","about":"You may never be sure whether you have an effective user experience until you have tested it with users. In this course, you’ll learn how to design user-centered experiments, how to run such experiments, and how to analyze data from these experiments in order to evaluate and validate user experiences. You will work through real-world examples of experiments from the fields of UX, IxD, and HCI, understanding issues in experiment design and analysis. You will analyze multiple data sets using recipes given to you in the R statistical programming language -- no prior programming experience is assumed or required, but you will be required to read, understand, and modify code snippets provided to you. By the end of the course, you will be able to knowledgeably design, run, and analyze your own experiments that give statistical weight to your designs.","tutor":"Scott Klemmer","provider":"Coursera","language":"English","skills":["usa","north america"],"subject":"Science","studentsInterested":"161","courseLink":"https://www.coursera.org/learn/designexperiments","classCentralLink":"https://www.class-central.com/course/coursera-designing-running-and-analyzing-experiments-2789"},{"title":"Basic Notions in Physics - רעיונות מרכזיים בפיזיקה","about":"במהלך מאות השנים האחרונות, פיתחה הפיזיקה מגוון רחב של רעיונות המאפשרים לתאר ולהסביר את העולם שסביבנו בדיוק מפליא ומתוך הבנה עקרונית עמוקה. חלק מרעיונות אלה נראים כיום פשוטים ומובנים, אבל חלקם מורכבים ויצירתיים עד כדי כך שיש מי שיגדירם כיצירות האינטלקטואליות הכבירות ביותר של האנושות.\n\nקורס זה, אשר אינו דורש ידע מוקדם בפיזיקה או נטייה מתמטית, סוקר תחומי פיזיקה מגוונים, החל ממכניקה וכבידה, דרך אלקטרומגנטיות, גלים ואופטיקה, וכלה בתורת הקוונטים, ומציע טעימה ממבחר דוגמאות של רעיונות מרכזיים בפיזיקה. אלה כוללים, בין היתר את רעיון הסימטריה, חוקי שימור, מושגי האנרגיה והאנטרופיה, עקרון היחסות ותפיסת הזמן בפיזיקה, עקרון האוניברסליות ורעיון האיחוד, עקרונות מינימום, וכמובן, עקרון הפרה הכדורית החשוב. במהלך הקורס נכיר את השיטה המדעית עליה מבוססת ההתפתחות הרעיונית בפיזיקה, ונצפה בעשרות הדגמות וניסויים שיסייעו לנו בהבנת הרעיונות והמושגים האלה.\n\nמומלץ לקחת את הקורס במלואו על פי סדר הפרקים, אולם ישנה אפשרות לבחור מבין כמה מסלולי למידה מקוצרים.\n\n\nנושאי הלימוד:\n\nראשית המכניקה – הולדתה של השיטה המדעית המודרנית\nתורת הכבידה – הצלחתה של השיטה המדעית המודרנית\nאלקטרוסטטיקה – האיחוד המופלא בין חשמל, מגנטיות ואור\nסימטריה ושבירתה – עקרון הסימטריה מימי היוונים ועד ימינו\nחוקי שימור בפיזיקה – מה שהיה הוא שיהיה\nרעיון האוניברסליות בפיזיקה – תנודות וגלים\nאור ואופטיקה – רבדים שונים של הבנה\nמושג הזמן בפיזיקה – הקשר למהירות האור ולשיקולים סטטיסטיים\nתורת הקוונטים – הרעיונות המשונים והמופלאים מכולם\n\n\nעל מנת לצבור קרדיט אקדמי של אוניברסיטת תל אביב עבור הקורס, יש לעמוד בהצלחה בבחינה שמתקיימת באוניברסיטת תל אביב. תוכלו למצוא מידע נוסף בקישור-\nhttps://tauonline.tau.ac.il/registration\n\nבנוסף, ניתן להתקבל לחלק ממסלולי הלימוד באוניברסיטת תל אביב באמצעות הקורסים המקוונים - קראו עוד כאן-\nhttps://go.tau.ac.il/b.a/mooc-acceptance\n\nמורים המעוניינים ללמד את הקורסים בכיתותיהם מוזמנים לקרוא בקישור הבא על תוכנית תיכון אקדמי מקוון-\nhttps://tauonline.tau.ac.il/online-highschool","tutor":"Ron Lifshitz, Ph.D.","provider":"Coursera","language":"Hebrew","skills":["new-moocs-2017"],"subject":"Physics","studentsInterested":"6","courseLink":"https://www.coursera.org/learn/physics-intro","classCentralLink":"https://www.class-central.com/course/coursera-basic-notions-in-physics----8129"},{"title":"Act on Climate: Steps to Individual, Community, and Political Action","about":"Are you concerned about climate change? Would you like to learn how to address and respond to this challenge? If so, this course is for you.\n\nAct on Climate: Steps to Individual, Community, and Political Action is intended to help learners understand, address and respond to climate change as individuals and in partnership with their communities and political leaders. The course focuses on how to translate learning into action on climate change in the areas of food, energy, transportation and the built environment (cities). This course was co-developed and taught by Michaela Zint, Professor of Environmental Education and Communication, and University of Michigan Students. A range of academic climate change experts and professional leaders are featured.\n\nAs a result of completing this course, you will be able to:\n\n1) Identify individual, community, and political actions you can engage in to effectively address and respond to climate change.\n\n2) Describe how insights from the social sciences can be employed to create change at the individual, community, and political levels.\n\n3) Feel empowered to continue to influence how you, your community, and political leaders address and respond to climate change.\n\nUse #UMichActonClimate on social media to share what you\u0027re doing and connect with other learners.","tutor":"Michaela Zint","provider":"Coursera","language":"English","skills":["climate change","public policy","new-moocs-2017"],"subject":"Climate Change","studentsInterested":"66","courseLink":"https://www.coursera.org/learn/act-on-climate","classCentralLink":"https://www.class-central.com/course/coursera-act-on-climate-steps-to-individual-community-and-political-action-8737"},{"title":"Patenting in Biotechnology","about":"Far too often, researchers are misinformed about the role and the possibilities arising around patents and Intellectual Property Rights (IPR). In this course we will teach you what IPR are - with a special focus on patents. Also this course will look at the importance of patents in the world of biotechnology - and what you actually can patent.\n\nShould your research be protected? Can your research even be protected?\nThere are a lot of misunderstandings about patents, so first step is to know what patents really are and how they work. Then we will introduce how and when to apply for them. Also how to find existing patents is a crucial and necessary element to being able to assess whether your research should be protected or not.\n\nThe course will be divided in 7 sessions, and at the end of the course, you should be able to:\n- describe the different types of IPR\n- explain the conditions of patentability for an invention\n- describe the various stages involved in a patent application\n- search and retrieve patent information from databases\n- read and understand a patent\n- write claims related to biotechnology\n- understand and explain the concept of Freedom To Operate\n\nCourse Materials:\nYou will need the following book as a reading material for the course:\n“Patenting in Biotechnology, a laboratory manual” by Peter Ulvskov, which will be available from http://polyteknisk.dk/home/Detaljer/9788750211068\n\nAlso, you will need to get access from your home institution to these databases:\n- Derwent Innovation Index (via Web of Science)\n- SciFinder\n\nNB:\nThis course is related to a 5 ECTS point course that is a mandatory requirement for access to the BioBusiness and Innovation Platform (BBIP) program at the Copenhagen Business School. NOTE: this Coursera course will NOT be sufficient for attending the BBIP program but successful completion of this course (with a Course Certificate) will be a plus for applying to the BBIP.\nTo obtain the 5 ECTS points, you will have to enrol as a DTU Student, participate on a hands-on workshop on patent databases and pass an exam in presence of an external Censor. For more information, please email me at:\n\nfdemasi@cbs.dtu.dk\n\nLink for BBIP: (http://www.cbs.dk/viden-samfundet/strategiske-indsatsomrader/biobusiness-and-innovation-platform-bbip)","tutor":"Finn Valentin, Peter Ulvskov, Claus Bøttcher Jørgensen, Karin Beukel and Federico De Masi","provider":"Coursera","language":"English","skills":["new-moocs-2017"],"subject":"Biology","studentsInterested":"26","courseLink":"https://www.coursera.org/learn/patenting-bio-ipr","classCentralLink":"https://www.class-central.com/course/coursera-patenting-in-biotechnology-8559"},{"title":"Введение в физиологию (Introduction to physiology)","about":"Курс «Введение в физиологию» позволяет сделать первый шаг в понимании основ функционирования организма человека.\nОбщая цель курса состоит в получении базовых знаний о молекулярно-клеточных процессах, которые лежат в основе деятельности органов, а также принципах их регуляции, позволяющих объединить функции отдельных органов в единый комплекс процессов, необходимых для жизни человека. В конце курса слушатель должен овладеть базовой терминологией, пониманием основ функций клеток, лежащих в основе деятельности органов, базовыми принципами управления функциями органов.","tutor":"Кривой Игорь Ильич , Бекусова Виктория Витальевна, Виолетта Васильевна Кравцова, Алексеев Николай Петрович, Марков Александр Георгиевич and Чернышева Марина Павловна","provider":"Coursera","language":"Russian","skills":["physiology","new-moocs-2017"],"subject":"Biology","studentsInterested":"9","courseLink":"https://www.coursera.org/learn/vvedeniye-fiziologiyu","classCentralLink":"https://www.class-central.com/course/coursera----introduction-to-physiology-9348"},{"title":"Air Pollution – a Global Threat to our Health","about":"We all have to breathe to live. But the air we breathe is polluted both outdoors and indoors. Each year, this pollution costs 7 million lives across the globe – and a lot of suffering. 1 in 8 deaths is due to air pollution. This course will provide you with an introduction to the most recent research in the field of health effects of air pollution as well as a broader understanding of sources and spread of air pollution and what we should do about it.\n\nWhat is air pollution? What are the sources? How and where are we exposed outdoors and indoors? What happens in the body? Which diseases are the result? Who are the most vulnerable? How can we assess the effects of air pollution? And what should we do to reach the Sustainable Development Goal to “substantially reduce the number of deaths and illnesses from hazardous chemicals and air, water and soil pollution”? These are some of the important questions we will address in the course.\n\nDuring the course you will meet researchers and experts from the University of Copenhagen and the Technical University of Denmark. They work with different aspects of air pollution and health: toxicology, exposure assessment, epidemiology, engineering and health impact assessment. It is a global responsibility to combat the health impacts of air pollution, and this fight can only be won through new knowledge and global collaboration.\n\nWe hope you will join us in the course and equip yourself to take part in this global and individual health challenge.","tutor":"Steffen Loft and Peter Møller","provider":"Coursera","language":"English","skills":["public health","air pollution"],"subject":"Environmental Science","studentsInterested":"47","courseLink":"https://www.coursera.org/learn/air-pollution-health-threat","classCentralLink":"https://www.class-central.com/course/coursera-air-pollution-a-global-threat-to-our-health-9829"},{"title":"Origins - Formation of the Universe, Solar System, Earth and Life","about":"The Origins course tracks the origin of all things – from the Big Bang to the origin of the Solar System and the Earth. The course follows the evolution of life on our planet through deep geological time to present life forms.","tutor":"Henning Haack","provider":"Coursera","language":"English","skills":["denmark","north america"],"subject":"Astronomy","studentsInterested":"2.2k","courseLink":"https://www.coursera.org/learn/origins-universe-solarsystem","classCentralLink":"https://www.class-central.com/course/coursera-origins-formation-of-the-universe-solar-system-earth-and-life-668"},{"title":"Chicken Behaviour and Welfare","about":"This course explains the general principles of chicken behaviour and welfare, and the behavioural and physiological indicators that can be used to assess welfare in chickens kept in hobby flocks through to commercial farms. The focus is primarily on laying hens and meat chickens (broilers) although many of the principles are relevant to other types of poultry. The course is likely to be of interest to people who own chickens as pets or keep a small hobby flock, commercial egg and chicken meat producers, veterinarians and vet nurses.\n\nLearning Objectives: at the end of this course, you will be able to -\n- Describe avian sensory perception and motivation\n- Explain the main behaviour patterns of poultry\n- Define welfare and explain the bases of welfare standards\n- Assess chicken welfare, using behavioural and physiological means\n- Understand common welfare problems of chickens\n\nThis course is taught by staff from Scotland\u0027s Rural College (SRUC), University of Glasgow, and St David\u0027s Poultry Team.\n\nYou can follow us on Twitter! #chickenmooc\n\n© University of Edinburgh and Scotland\u0027s Rural College 2016 CC BY","tutor":"Victoria Sandilands","provider":"Coursera","language":"English","skills":["europe","scotland"],"subject":"Biology","studentsInterested":"121","courseLink":"https://www.coursera.org/learn/chickens","classCentralLink":"https://www.class-central.com/course/coursera-chicken-behaviour-and-welfare-2937"},{"title":"结构生物化学（Structural Biochemistry)","about":"生物化学是当今生命科学领域中发展最为迅速、涉及面最广的基础学科之一，其着眼点在于使用化学、物理学和生物学等方法去研究各类生物分子的结构与功能，在分子水平上阐明生命的本质、原理和规律。如今，生物化学的理论和实验技术已渗透到生命科学的方方面面，它的发展一次又一次地带动了整个生命科学的发展。\n生物化学可分为结构生物化学、代谢生物化学和分子生物学三个部分。本课程为第一部分，即结构生物化学，以后还会推出代谢生物化学和分子生物学课程。\n结构生物化学的内容可以说是生物化学最基础的部分，有人把这一部分的内容说成是“静态生化”。其主要内容是各种生物分子（氨基酸、核苷酸、蛋白质、核酸、酶、碳水化合物、脂类和激素等）的结构、性质与功能，特别是三类生物大分子——蛋白质、核酸和酶的结构、性质与功能。\n学完这一部分，将会为你学好生物化学的另外两个部分，即代谢生物化学和分子生物学打下坚实的基础，也为你学好细胞生物学、遗传学等其他生命科学相关课程创造条件。\n\n先修课程：普通生物学和有机化学\n\n大纲（Syllabus)\n\n第一章 蛋白质的结构与功能（Chapter 1 Structure and Function of Proteins)\n1. 氨基酸（Amino acids）\n2. 蛋白质氨基酸与非蛋白质氨基酸（Proteinogenic AA \u0026 non-protenogenic AA）\n3. 疏水氨基酸与亲水氨基酸（Hydrophobic \u0026 Hydrophilic AAs）\n4. 必需氨基酸与非必需氨基酸（Essential \u0026 Non-essential AAs）\n5. 氨基酸的英文缩写（Abbreviations for 22 amino acids）\n6. 氨基酸的缩合反应（AA Condensation reaction）\n7. 氨基酸的手性（Chirality of Amino Acids）\n8. 氨基酸的两性解离与等电点（Acid \u0026 base dissociation of amino acids and pI）\n9. 茚三酮反应（Reaction with Ninhydrin)\n10. Sanger反应（Reaction with DNFB）\n11. Edman反应（Reaction with PITC）\n12. 蛋白质（Proteins）\n13. 蛋白质的一级结构（Primary Structure of Proteins）\n14. 肽键（Peptide bonds）\n15. 蛋白质的二级结构（Secondary Structure of Proteins）\n16. α螺旋（The Alpha Helix）\n17. β折叠（The Beta-Pleated Sheet）\n18. β转角（The Beta Turn）\n19. β突起（The Beta Bulge）\n20. 蛋白质的三级结构（Tertiary structure of Proteins）\n21. 疏水键（Hydrophobic interactions）\n22. 模体（Motif）\n23. 结构域（Domain）\n24. 蛋白质的四级结构（Quaternary Structure of Proteins）\n25. 蛋白质的折叠（Protein folding）\n26. 天然无折叠蛋白（Natively Unfolded Proteins）\n27. Anfinsen实验（Anfinsen’s Experiment）\n28. 分子伴侣（Molecular Chaperone）\n29. 蛋白质二硫化物异构酶（Protein disulfide isomerase，PDI）\n30. 脯氨酰肽酰顺反异构酶（Peptidylprolyl cis-trans isomerase，PPI）\n31. 朊病毒（Prions）\n32. 蛋白质组（Proteome）\n33. 蛋白质的功能（Functions of Proteins）\n34. 兼职蛋白（Moonlighting Proteins）\n35. 蛋白质结构与功能之间的关系（Structure and function relationships of proteins）\n36.α角蛋白（Alpha Keratin）\n37.β角蛋白（Beta Keratin）\n38.胶原蛋白（Collagen）\n39.肌红蛋白与血红蛋白（Myoglobin \u0026 Hemoglobin）\n40.正协同效应（Positive Cooperativity）\n41.波尔效应（Bohr Effect）\n42.别构效应（Allosteric effect）\n43.HbS\n44.HbF\"\n\n第二章 核酸的结构与功能（Chapter 2 Structure and Function of Nucleic Acids)\n1.碱基（Bases）\n2.互变异构（Keto-enol tautomerism）\n3.核苷（Nucleosides）\n4.核苷酸（Nucleotides）\n5.核酸（Nucleic Acids）\n6.多种多样的RNA（Versatile RNAs）\n7.核酸的一级结构（Primary Structure of Nucleic Acids）\n8.B-DNA\nA-DNA\n10.Z-DNA\n11.几种DNA的非常规的二级结构（Other forms of secondary structure of DNA）\n12.RNA二级结构（Secondary structure of RNA）\n13.DNA三级结构（Tertiary Structure of DNA）\n14.RNA三级结构（Tertiary Structure of RNA）\n15.核糖核酸蛋白复合物（RNA-Protein Complex）\n16.核小体（Nucleosome）\n17.RNA世界（The RNA world hypothesis）\n\n第三章 蛋白质和核酸的性质（Chapter 3 Properties of Proteins and Nucleic Acids)\n1. 紫外吸收（UV absorption）\n2. 沉淀（Precipitation）\n3. 两性解离（Acid \u0026 base dissociation and pI）\n4. 变性（Denaturation）\n5. 复性（Renaturation）\n6. Tm\n7. 水解（Hydrolysis）\n8. 蛋白质的颜色反应（Protein coloring reaction)\n9. 电泳（Electrophoresis）\n10. 层析（Chromatography）\n11. 透析与超滤（Dialysis and Ultrafiltration）\n\n第四章 酶的结构与功能（Chapter 4 Structure and Function of Enzymes)\n1. 酶（Enzymes）\n2. 辅助因子（Cofactors)\n3. 核酶（Ribozymes）\n4. 活性中心（The Active Site）\n5. “锁与钥匙”模型（Lock and key model）\n6. “诱导契合”模型（The Induced Fit model）\n7. “三点附着”模型（Three-point attachment model）\n8. 酶的命名和分类（Enzyme Nomenclature）\n9. 酶动力学（Enzyme kinetics）\n10. 米氏方程（The Mechaelis-Menten Equation）\n11. Kcat和kcat/Km（Kcat \u0026 kcat/Km）\n12. 双倒数作图（Double-reciprocal plot）\n13. 酶抑制剂（Enzyme Inhibitors）\n14. 竞争性抑制剂（Competitive Inhibitor）\n15. 非竞争性抑制剂（Non-competitive Inhibitor）\n16. 反竞争性抑制剂（Uncompetitive Inhibitor）\n17. 基团特异性抑制剂（Group Specific Reagent）\n18. 底物类似物（Substrate Analogue）\n19. 自杀性抑制剂（Suicide Inhibitor）\n20. 别构酶（Allosteric Enzymes）\n21. 齐变模型（The Concerted Model）\n22. 序变模型（The Sequential Model）\n23. 过渡态稳定学说（“The transition-state stabilization” theory）\n24. 抗体酶（Abzymes）\n25. 临近与定向效应（Catalysis by proximity and orientation）\n26. 广义酸碱催化（General Acid-base catalysis）\n27. 静电催化（Electrostatic catalysis）\n28. 金属催化（Metal catalysis）\n29. 共价催化（Covalent catalysis）\n30. 底物形变（Substrate strain）\n31. 蛋白酶（Proteases）\n32. 酶活性的调节（Regulation of Enzyme Activities)\n33. 同工酶（Isozymes）\n34. 别构调节（Allosteric control）\n35. 共价修饰调节（Regulation by covalent modification）\n36. 水解激活（Proteolytic activation）\n37. 调节蛋白的激活和抑制（Stimulation and inhibition by control proteins）\n38. 维生素（Vitamins）\n\n第五章 糖类和脂类的结构与功能（Chapter 5 Structure and Function of Carbohydrates and Lipids)\n1. 碳水化合物（Carbohydrates）\n2. 单糖（Monosaccharides）\n3. 差向异构体（Epimers)\n4. 异头体（Anomer）\n5. 寡糖（Oligosaccharides）\n6. 多糖（Polysaccharides）\n7. 糖缀化合物（Glycoconjugates）\n8. 脂类（Lipids）\n9. 脂肪酸（Fatty acids）\n10. 脂肪（Fats）\n11. 反式脂肪（Trans Fats）\n12. 磷脂（Phospholipids）\n13. 胆固醇（Cholesterol）\n14. 脂双层（Lipid Bilayers）\n\n第六章 激素的结构与功能（Chapter 6 Structure and Function of Hormones)\n1. 激素（Hormones）\n2. 放射免疫测定（Radioimmnoessay)\n3. 受体（Receptors）\n4. 第二信使（Second messengers）\n5. G蛋白（G-proteins）\n6. 蛋白质激酶（Protein kinases）\n7. 通过胞内受体的激素作用机制（Mechanism of Hormone action by intracellular receptors）\n8. PKA系统（The PKA system）\n9. PKC系统（The PKC system）\n10. PKG系统（The PKG system）\n11. NO系统（Nitric oxide system）\n12. 受体酪氨酸激酶系统（The RTK System）\n13. 视觉产生相关的信号转导（Visual Signal Transduction）\n14. 嗅觉产生相关的信号转导（Olfactory Signal Transduction）\n15. 信号系统的终止（Termination of the signal）","tutor":"杨荣武","provider":"Coursera","language":"Chinese","skills":["china","asia","structual biochemistry"],"subject":"Chemistry","studentsInterested":"13","courseLink":"https://www.coursera.org/learn/shengwu-huaxue","classCentralLink":"https://www.class-central.com/course/coursera--structural-biochemistry-4553"},{"title":"Advanced Neurobiology II","about":"Hello everyone! Welcome to advanced neurobiology!\n\nNeuroscience is a wonderful branch of science on how our brain perceives the external world, how our brain thinks, how our brain responds to the outside of the world, and how during disease or aging the neuronal connections deteriorate. We’re trying to understand the molecular, cellular nature and the circuitry arrangement of how nervous system works.\n\nThrough this course, you\u0027ll have a comprehensive understanding of basic neuroanatomy, electral signal transduction, movement and several diseases in the nervous system.\n\nThis advanced neurobiology course is composed of 2 parts (Advanced neurobiology I and Advanced neurobiology Il). They are related to each other on the content but not on scoring or certification, so you can choose either or both. It’s recommended that you take them sequentially and it’s great if you’ve already acquired a basic understanding of biology.\n\nThank you for joining us!","tutor":"Chenjian Li, Donggen Luo and Yan Zhang","provider":"Coursera","language":"English","skills":["china","asia"],"subject":"Biology","studentsInterested":"71","courseLink":"https://www.coursera.org/learn/advancedneurobiologyii","classCentralLink":"https://www.class-central.com/course/coursera-advanced-neurobiology-ii-7367"},{"title":"Science of Training Young Athletes Part 2","about":"In this course you will learn how to design the type of training that takes advantage of the plastic nature of the athlete’s body so you mold the right phenotype for a sport. We explore ways the muscular system can be designed to generate higher force and power and the type of training needed to mold the athlete\u0027s physical capacity so it meets the energy and biochemical demands of the sport.\n\nWe also examine the cost of plasticity when it is carried beyond the ability of the body to adjust itself to meet the imposed training stresses. The cost of overextending plasticity comes in the form injuries and chronic fatigue. In essence, a coach can push the athlete’s body too far and it can fail. Upon completion of this course you will be able to assemble a scientifically sound annual training plan.","tutor":"Dr. Chris Brooks","provider":"Coursera","language":"English","skills":["new-moocs-2017"],"subject":"Science","studentsInterested":"21","courseLink":"https://www.coursera.org/learn/science-of-training-young-athletes-part-2","classCentralLink":"https://www.class-central.com/course/coursera-science-of-training-young-athletes-part-2-8137"},{"title":"Particle Physics: an Introduction","about":"This course introduces you to subatomic physics, i.e. the physics of nuclei and particles.\n\nMore specifically, the following questions are addressed:\n- What are the concepts of particle physics and how are they implemented?\n- What are the properties of atomic nuclei and how can one use them?\n- How does one accelerate and detect particles and measure their properties?\n- What does one learn from particle reactions at high energies and particle decays?\n- How do electromagnetic interactions work and how can one use them?\n- How do strong interactions work and why are they difficult to understand?\n- How do weak interactions work and why are they so special?\n- What is the mass of objects at the subatomic level and how does the Higgs boson intervene?\n- How does one search for new phenomena beyond the known ones?\n- What can one learn from particle physics concerning astrophysics and the Universe as a whole?\n\nThe course is structured in eight modules. Following the first one which introduces our subject, the modules 2 (nuclear physics)\nand 3 (accelerators and detectors) are rather self contained and can be studied separately. The modules 4 to 6 go into more depth about matter and forces as described by the standard model of particle physics. Module 7 deals with our ways to search for new phenomena. And the last module introduces you to two mysterious components of the Universe, namely Dark Matter and Dark Energy.","tutor":"Martin Pohl, Mercedes Paniccia and Anna Sfyrla","provider":"Coursera","language":"English","skills":["new-moocs-2017"],"subject":"Physics","studentsInterested":"97","courseLink":"https://www.coursera.org/learn/particle-physics","classCentralLink":"https://www.class-central.com/course/coursera-particle-physics-an-introduction-8252"},{"title":"Introduction to Molecular Spectroscopy","about":"The course introduces the three key spectroscopic methods used by chemists and biochemists to analyse the molecular and electronic structure of atoms and molecules. These are UV/Visible , Infra-red (IR) and Nuclear Magnetic Resonance (NMR) spectroscopies. The content is presented using short focussed and interactive screencast presentations accompanied by formative quizzes to probe understanding of the key concepts presented. Numerous exercises are provided to facilitate mastery of each topic. A unique virtual spectroscopic laboratory is made available to enable students to measure and analyse spectra online. Assessment is via summative quizzes completed during the course period.","tutor":"Patrick J O\u0027Malley, D.Sc","provider":"Coursera","language":"English","skills":["new-moocs-2017"],"subject":"Chemistry","studentsInterested":"490","courseLink":"https://www.coursera.org/learn/spectroscopy","classCentralLink":"https://www.class-central.com/course/coursera-introduction-to-molecular-spectroscopy-8550"},{"title":"A Circular Economy of Metals: Towards a Sustainable Societal Metabolism","about":"Metals are present everywhere around us and are one of the major materials upon which our economies are built. Economic development is deeply coupled with the use of metals. During the 20th century, the variety of metal applications in society grew rapidly. In addition to mass applications such as steel in buildings and aluminium in planes, more and more different metals are in use for innovative technologies such as the use of the speciality metal indium in LCD screens.\n\nA lot of metals will be needed in the future. It will not be easy to provide them. In particular in emerging economies, but also in industrialised countries, the demand for metals is increasing rapidly. Mining and production activities expand, and with that also the environmental consequences of metal production.\n\nIn this course, we will explore those consequences and we will also explore options to move towards a more sustainable system of metals production and use. We will focus especially on the options to reach a circular economy for metals: keeping metals in use for a very long time, to avoid having to mine new ones.\n\nThis course is based on the reports of the Global Metals Flows Group of the International Resource Panel that is part of UN Environment. An important aspect that will come back each week, are the UN Sustainable Development Goals, the SDGs. Those are ambitious goals to measure our progress towards a more sustainable world. We will use the SDGs as a touching stone for the assessment of the metals challenge, as well as the solutions we present in this course to solve that challenge.","tutor":"Ester van der Voet","provider":"Coursera","language":"English","skills":["economics","mining","metals","metal production","new-moocs-2017"],"subject":"Science","studentsInterested":"19","courseLink":"https://www.coursera.org/learn/circular-economy-metals","classCentralLink":"https://www.class-central.com/course/coursera-a-circular-economy-of-metals-towards-a-sustainable-societal-metabolism-9659"},{"title":"Climate Change and Water in Mountains: A Global Concern","about":"What is climate change ? How are mountain regions affected by the evolution of water resources and their uses ? What kind of risks need to be considered ?\n\nMountains are recognized as particularly sensitive physical environments where intense and rapid changes have in the past, and may increasingly in the future, place pressure on their resource base.\n\nIn this context, a team of roughly 100 experts worked from 2008 to 2013 for the European ACQWA project (www.acqwa.ch) which was coordinated by the University of Geneva. The primary objectives of the project were to assess the impacts of a changing climate on the quantity and quality of water originating in mountain regions, particularly where snow- and ice melt represent a large, sometimes the largest, streamflow component. A further objective of the project was to determine the potential disruptions to water-dependent economic activities related to the climate impacts on hydrological systems, and to propose a portfolio of possible adaptation strategies.\n\nThis particular MOOC is inspired by the ACQWA Project and offers a better understanding of climate change, its impacts on the quality and quantity of water in mountain regions and the risks related to changing water resources. From an interdisciplinary perspective, the participation of twenty-five instructors from five different countries (Switzerland, England, South Korea, India and Nepal) and fourteen institutions (UNIGE, RTS, UNIFR, UZH, ETHZ, Meteodat GmbH, WGMS, Imperial College London, Agroscope, République et Canton de Genève, Yonsei University, IHCAP, ICIMOD, SDC, FOEN) highlights the diversity of both theoretical and practical viewpoints related to these issues.\n\nBy the end of this course, you will be able :\n\n- to define the general concept of climate change in mountain regions\n- to understand the concepts associated with climate change such as adaptation and water governance strategies\n- to consider the impacts of climate change on water resources in mountain regions\n- to identify the impacts of climate change on hydropower, agriculture, aquatic ecosystems and health\n- to enumerate risks that can occur in mountain areas and lead to disruptions in water availability and use.\n\nYour acquired knowledge will be evaluated through multiple-choice quizzes at the end of each unit of the course.\n\nThis MOOC on “Climate Change and Water in Mountain Regions : A Global Concern” was initiated and financed by the University of Geneva, through its Institute for Environmental Sciences.\n\nWe look forward to you joining us !","tutor":"Martin Beniston and Markus Stoffel","provider":"Coursera","language":"English","skills":["climate change","water"],"subject":"Climate Change","studentsInterested":"37","courseLink":"https://www.coursera.org/learn/climate-changes-mountains-water","classCentralLink":"https://www.class-central.com/course/coursera-climate-change-and-water-in-mountains-a-global-concern-10522"},{"title":"Dynamical Modeling Methods for Systems Biology","about":"An introduction to dynamical modeling techniques used in contemporary Systems Biology research.\n\nWe take a case-based approach to teach contemporary mathematical modeling\ntechniques. The course is appropriate for advanced undergraduates and beginning graduate students. Lectures provide biological background and describe the development of both classical mathematical models and more recent representations of biological processes. The course will be useful for students who plan to use experimental techniques as their approach in the laboratory and employ computational modeling as a tool to draw deeper understanding of experiments. The course should also be valuable as an introductory overview for students planning to conduct original research in modeling biological systems.\n\nThis course focuses on dynamical modeling techniques used in Systems Biology research. These techniques are based on biological mechanisms, and simulations with these models generate predictions that can subsequently be tested experimentally. These testable predictions frequently provide novel insight into biological processes. The approaches taught here can be grouped into the following categories: 1) ordinary differential equation-based models, 2) partial differential equation-based models, and 3) stochastic models.","tutor":"Eric Sobie","provider":"Coursera","language":"English","skills":["usa","north america"],"subject":"Biology","studentsInterested":"386","courseLink":"https://www.coursera.org/learn/dynamical-modeling","classCentralLink":"https://www.class-central.com/course/coursera-dynamical-modeling-methods-for-systems-biology-493"},{"title":"Introduction to Chemistry: Reactions and Ratios","about":"This is an introductory course for students with limited background in chemistry; basic concepts involved in chemical reactions, stoichiometry, the periodic table, periodic trends, nomenclature, and chemical problem solving will be emphasized with the goal of preparing students for further study in chemistry as needed for many science, health, and policy professions..","tutor":"Dorian Canelas","provider":"Coursera","language":"English","skills":["chemistry","usa","north america"],"subject":"Chemistry","studentsInterested":"1.6k","courseLink":"https://www.coursera.org/learn/intro-chemistry","classCentralLink":"https://www.class-central.com/course/coursera-introduction-to-chemistry-reactions-and-ratios-2375"},{"title":"电磁学上——恒定电场","about":"电磁学是普通物理系列中最重要的基础课之一，是高等学校每一个理工科学生必修课程，本课程包括静电场、恒磁场、电磁感应、电磁介质、电路、麦克斯韦电磁场理论、电磁波等内容，首次系统地向学生介绍“场”的概念和处理“场”的方法，对学生今后学习和工作有深远的影响。本课程作为中国大学先修课（AP课程）向有志于学习物理及相关专业的学有余力的优秀中学生开放，培养学科兴趣，提高科学素养，打下扎实的物理基础。\n2014年9月以来《电磁学》已经两度上线开课，教学内容是按周上载，共有十三周课程。考虑到很多大学生和中学生不一定有条件按照我们原来按周上载课件的节奏学习，有的同学反映开始拉下了进度，后面就跟不上了，练习也是有时限的，过了时限就没法记录练习的成绩了。因此我们团队决定将原来上线的《电磁学》课程拆分成两个学习进程在on demand上线，在on demand上，我们将所有课程内容全部上载，没有教学时限，由学生自行安排学习时间和进度，自己完成课后练习，以便随时为需要的学生提供学习的资料和练习。练习题可以多次尝试，只是必须做对每个模块练习题的80%，才可以通过。又考虑到《电磁学》内容比较多，因此将原来十三周的教学内容分成两个学习阶段。《电磁学上》包含的内容是《大学物理通用教程》电磁学的前三章即静电场、导体和电介质以及直流电。这三部分内容属于恒定电场范畴，这些内容应该是深入学习电磁学的基础，在这部分课程结尾，设置了一个结业考试，相当于大学课程的期中考试。第二个学习进程《电磁学下》包含的内容是《大学物理通用教程》电磁学的后五章即恒磁场、磁介质，电磁感应、交流电和电磁场电磁波。建议大家学习了第一进程，通过了结业考试以后再进入第二学习进程《电磁学下》的学习。\n本课程的课程是按照知识点设置模块，《电磁学上》包含5个模块，《电磁学下》包含6个模块。每个模块又包含几节课，每个模块结束有一个小测，同学们可以自我测试，没有时间限制，大家可以根据自己的需要和时间安排来自主学习，以免一步跟不上，步步跟不上，这对于学习我们这种理论性比较强的课是有利的，已经明白的可以跳过去，不清楚的可以重点学习。\n《电磁学上》包含以下五个模块\n模块一 库仑定律和电场强度\n模块二 高斯定理和环路定理\n模块三 导体与静电平衡\n模块四 电介质与电场能量\n模块五 直流电\n欢迎大家选课！","tutor":"王稼军 WangJiaJun","provider":"Coursera","language":"Chinese","skills":["china","asia"],"subject":"Physics","studentsInterested":"4","courseLink":"https://www.coursera.org/learn/dianci","classCentralLink":"https://www.class-central.com/course/coursera---2356"},{"title":"Las estaciones del año y el clima","about":"¿Sabes por qué hay animales que migran cada año? ¿Cómo saben los campesinos cuándo sembrar y cuándo cosechar?\n¿Sabes qué gobierna el ciclo anual de frío y calor y de lluvias y secas?\n\nLas estaciones del año son el fenómeno climático más perceptible por el ser humano y se manifiestan de diferente forma en distintas regiones; por ejemplo cuando es invierno en la mitad del mundo, es verano en la otra mitad. Entender el mecanismo de las estaciones es el primer paso para entender el clima, que afecta a casi todas las actividades humanas.\n\nEn este curso estudiaremos los procesos que provocan las estaciones del año, las repercusiones que tienen éstas para las actividades humanas y su relación con los fundamentos del sistema climático terrestre. A través de simulaciones visuales haremos comprensibles conceptos y procesos físicos y te propondremos experimentos. Si estas considerando estudiar ciencias de la Tierra o si quieres comprender mejor cómo funciona el clima, este curso es para ti.\n\n¡Acompáñanos! Y conoce más sobre nuestro hogar el planeta Tierra.","tutor":"Alejandro Aguilar Sierra and Rene Garduño López","provider":"Coursera","language":"Spanish","skills":["climate","seaons","mexico","north america"],"subject":"Environmental Science","studentsInterested":"37","courseLink":"https://www.coursera.org/learn/estaciones-clima","classCentralLink":"https://www.class-central.com/course/coursera-las-estaciones-del-ano-y-el-clima-4600"},{"title":"Global Warming II: Create Your Own Models in Python","about":"This class provides a series of Python programming exercises intended to explore the use of numerical modeling in the Earth system and climate sciences. The scientific background for these models is presented in a companion class, Global Warming I: The Science and Modeling of Climate Change. This class assumes that you are new to Python programming (and this is indeed a great way to learn Python!), but that you will be able to pick up an elementary knowledge of Python syntax from another class or from on-line tutorials.","tutor":"David Archer","provider":"Coursera","language":"English","skills":["python","usa","north america"],"subject":"Climate Change","studentsInterested":"68","courseLink":"https://www.coursera.org/learn/global-warming-model","classCentralLink":"https://www.class-central.com/course/coursera-global-warming-ii-create-your-own-models-in-python-5704"},{"title":"General Chemistry: Concept Development and Application","about":"This course will cover the topics of a full year, two semester General Chemistry course. We will use a free on-line textbook, Concept Development Studies in Chemistry, available via Rice’s Connexions project.\n\nThe fundamental concepts in the course will be introduced via the Concept Development Approach developed at Rice University. In this approach, we will develop the concepts you need to know from experimental observations and scientific reasoning rather than simply telling you the concepts and then asking you to simply memorize or apply them.\n\nSo why use this approach?\n\nOne reason is that most of us are inductive learners, meaning that we like to make specific observations and then generalize from there. Many of the most significant concepts in Chemistry are counter-intuitive. When we see where those concepts come from, we can more readily accept them, explain them, and apply them.\n\nA second reason is that scientific reasoning in general and Chemistry reasoning in particular are inductive processes. This Concept Development approach illustrates those reasoning processes.\n\nA third reason is that this is simply more interesting! The structure and reactions of matter are fascinating puzzles to be solved by observation and reasoning. It is more fun intellectually when we can solve those puzzles together, rather than simply have the answers to the riddles revealed at the outset.\n\nRecommended Background:\nThe class can be taken by someone with no prior experience in chemistry. However, some prior familiarity with the basics of chemistry is desirable as we will cover some elements only briefly. For example, a prior high school chemistry class would be helpful.\n\nSuggested Readings:\nReadings will be assigned from the on-line textbook “Concept Development Studies in Chemistry”, available via Rice’s Connexions project. In addition, we will suggest readings from any of the standard textbooks in General Chemistry. A particularly good free on-line resource is Dickerson, Gray, and Haight, \"Chemical Principles, 3rd Edition\". Links to these two texts will be available in the Introduction module.","tutor":"John Hutchinson","provider":"Coursera","language":"English","skills":["chemistry","usa","north america"],"subject":"Chemistry","studentsInterested":"237","courseLink":"https://www.coursera.org/learn/general-chemistry","classCentralLink":"https://www.class-central.com/course/coursera-general-chemistry-concept-development-and-application-3885"},{"title":"Our Earth\u0027s Future","about":"Our Earth’s Future is about the science of climate change and how to talk about it. You will learn from scientists in the fields of climatology, oceanography, Earth science, and anthropology who study how climate change is affecting people, populations, and ways of life. Explore the multiple lines of evidence for the human-induced climate change that is happening today, and consider what that means for the future of our planet. At the end of this course you will be able to understand key scientific principles, identify and address misconceptions, and contribute confidently to conversations about climate change.","tutor":"Debra Tillinger","provider":"Coursera","language":"English","skills":["climate change","usa","north america"],"subject":"Climate Change","studentsInterested":"146","courseLink":"https://www.coursera.org/learn/earth-climate-change","classCentralLink":"https://www.class-central.com/course/coursera-our-earth-s-future-4193"},{"title":"Advanced Neurobiology I","about":"Hello everyone! Welcome to advanced neurobiology!\n\nNeuroscience is a wonderful branch of science on how our brain perceives the external world, how our brain thinks, how our brain responds to the outside of the world, and how during disease or aging the neuronal connections deteriorate. We’re trying to understand the molecular, cellular nature and the circuitry arrangement of how nervous system works.\n\nThrough this course, you\u0027ll have a comprehensive understanding of basic neuroanatomy, electral signal transduction, movement and several diseases in the nervous system.\n\nThis advanced neurobiology course is composed of 2 parts (Advanced neurobiology I and Advanced neurobiology II, and the latter will be online later). They are related to each other on the content but separate on scoring and certification, so you can choose either or both. It’s recommended that you take them sequentially and it’s great if you’ve already acquired a basic understanding of biology.\n\nThank you for joining us!","tutor":"Yan Zhang and Yulong Li","provider":"Coursera","language":"English","skills":["neuroscience","china","asia","nervous system","neurobiology"],"subject":"Biology","studentsInterested":"155","courseLink":"https://www.coursera.org/learn/advanced-neurobiology1","classCentralLink":"https://www.class-central.com/course/coursera-advanced-neurobiology-i-6029"},{"title":"Técnicas Microscópicas de Caracterización","about":"El recorrido por el apasionante mundo de la microscopía nos permite ver a una escala muy alejada de mundo macroscópico al que estamos acostumbrados. Las diferentes técnicas microscópicas nos ayudan a entender el reino atómico y la estructura de los organismos vivos, así como también de los diversos materiales. Es una herramienta imprescindible para desarrollar nuevas funcionalidades en el campo de la nanociencia y la nanotecnología con aplicaciones biomédicas, en computación y telecomunicaciones, y en energías renovables, entre otras muchas.\n\nAl completar el curso los estudiantes tendrán una visión detallada de los elementos básicos del que están formados los microscopios que utilizamos en las diferentes técnicas, su funcionamiento y operatividad, la preparación de muestras así como los objetivos y resultados de estudio.\n\nEl curso está pensado para profesores de secundaria que quieran tener una aproximación a las técnicas de microscopía así como para estudiantes tanto de secundaria como de primeros cursos universitários. Pero es apto para cualquier persona interesada en el mundo nanométrico y sus aplicaciones.","tutor":"Aránzazu Villuendas, Joan Mendoza, Sònia Estradé, Francesca Peiró, Jordi Díaz and Albert Cornet","provider":"Coursera","language":"Spanish","skills":["spain","europe"],"subject":"Science","studentsInterested":"9","courseLink":"https://www.coursera.org/learn/tecnicas-microscopicas-caracterizacion","classCentralLink":"https://www.class-central.com/course/coursera-tecnicas-microscopicas-de-caracterizacion-6473"},{"title":"Développement durable","about":"L\u0027ambition du cours est de confronter ses participants aux enjeux techniques, économiques, sociaux et environnementaux du XXIe siècle. Ces enjeux sont par nature très fortement couplés et complexes. Ils exigent une approche interdisciplinaire, afin d’adopter un vrai questionnement, au delà des préjugés et des idées reçues.\n\nC’est pourquoi des spécialistes reconnus dans les domaines de l’économie, de la démographie, de l’énergie, du climat, de l’eau et de l’agriculture, et issus des meilleurs institutions et centres de recherche français (CentraleSupélec, INED, Cnam, CEA, AgroParisTech), interviendront avec la volonté de confronter leurs points de vue et de débattre avec vous.\n\nLa démarche générale du cours consistera à examiner les enjeux du développement durable au regard d’études scientifiques rigoureuses et récentes, pour :\n• donner et discuter des chiffres clés (de l’état des lieux aux futurs possibles) ;\n• comprendre la construction de ces chiffres (hypothèses et limites des modèles scientifiques sur lesquels ils reposent) ;\n• et aborder l’ensemble des enjeux dans leurs différentes dimensions (notamment de l’échelle locale à l’échelle mondiale).\n\nLe format du cours :\nHebdomadaire, sur 7 semaines, 1h de vidéo par semaine (sous-titres en français et an anglais) avec quiz et supports de cours, forum (dont FAQ). Effort estimé : 3 heures par semaine pendant 7 semaines (1h30 de travail sur vidéo et 1h30 de lectures). Animation de la communauté d\u0027apprenants : le forum sera animé par l’équipe enseignante.\n\nResponsable du cours :\nPascal Da Costa : Enseignant-Chercheur, Economiste, Professeur chargé de cours à CentraleSupélec campus de Châtenay-Malabry (ex Ecole Centrale Paris).\n\nPlan du cours :\n• Économie, avec Pascal Da Costa (CentraleSupélec).\n• Démographie, avec Gilles Pison (Institut National d’Etudes Démographiques).\n• Énergie et Ressources Minérales, avec Estelle Iacona (CentraleSupélec) et Jean-Pierre Chevalier (Cnam).\n• Climat, avec Valérie Masson-Delmotte (Laboratoire des Sciences du Climat et de l\u0027Environnement).\n• Eau, avec Claire Bordes (CentraleSupélec).\n• Agriculture, avec Marc Dufumier (AgroParisTech).","tutor":"Pascal da Costa","provider":"Coursera","language":"French","skills":["europe","france"],"subject":"Environmental Science","studentsInterested":"20","courseLink":"https://www.coursera.org/learn/developpement-durable","classCentralLink":"https://www.class-central.com/course/coursera-developpement-durable-7147"},{"title":"Introduction to Faecal Sludge Management","about":"Do you want learn how to apply concepts of sustainable faecal sludge management (FSM) on a city-wide scale? This course starts with an overview of what faecal sludge is and an introduces you to the engineering fundamentals and required information for the design and selection of technologies. Sanitation solutions are prone to failure if an integrated planning approach that includes stakeholder involvement and the development of appropriate institutional, management and financial arrangements is not implemented. The course therefore dedicates a complete week to presenting the full picture, in addition to technology, that needs to be considered for sustainable solutions. It concludes with a focus on current research and innovations in technologies, to provide an understanding of the most up-to-date options.\n\nThis course is one of four in the series “Sanitation, Water and Solid Waste for Development\".","tutor":"Dr. Linda Strande","provider":"Coursera","language":"English","skills":["new-moocs-2017"],"subject":"Environmental Science","studentsInterested":"29","courseLink":"https://www.coursera.org/learn/faecalsludge","classCentralLink":"https://www.class-central.com/course/coursera-introduction-to-faecal-sludge-management-8258"},{"title":"Ecology: from cells to Gaia","about":"This course presents the principles of evolution and ecology for citizens and students interested in studying biology and environmental sciences. It discusses major ideas and results. Recent advances have energised these fields with evidence that has implications beyond their boundaries: ideas, mechanisms, and processes that should form part of the toolkit of all biologists and educated citizens.\n\nMajor topics covered by the course include fundamental principles of ecology, how organisms interact with each other and their environment, evolutionary processes, population dynamics, communities, energy flow and ecosystems, human influences on ecosystems, and the integration and scaling of ecological processes through systems ecology.\n\nThis course will also review major ecological concepts, identify the techniques used by ecologists, provide an overview of local and global environmental issues, and examine individual, group and governmental activities important for protecting natural ecosystems. The course has been designed to provide information, to direct the student toward pertinent literature, to identify problems and issues, to utilise research methodology for the study of ecology and evolution, and to consider appropriate solutions and analytical techniques.\n\nNeeded Learner Background: general biology and a good understanding of English.\n\nThis course has the following expectations and results:\n1) covers the theoretical and practical issues involved in ecology and evolution,\n2) conducting surveys and inventories in ecology,\n3) analyzing the information gathered,\n4) and applying their analysis to ecological and conservation problems.","tutor":"Roberto Cazzolla Gatti","provider":"Coursera","language":"English","skills":["new-moocs-2017"],"subject":"Biology","studentsInterested":"41","courseLink":"https://www.coursera.org/learn/ecology","classCentralLink":"https://www.class-central.com/course/coursera-ecology-from-cells-to-gaia-8638"},{"title":"Kinematics: Describing the Motions of Spacecraft","about":"The movement of bodies in space (like spacecraft, satellites, and space stations) must be predicted and controlled with precision in order to ensure safety and efficacy. Kinematics is a field that develops descriptions and predictions of the motion of these bodies in 3D space. This course in Kinematics covers four major topic areas: an introduction to particle kinematics, a deep dive into rigid body kinematics in two parts (starting with classic descriptions of motion using the directional cosine matrix and Euler angles, and concluding with a review of modern descriptors like quaternions and Classical and Modified Rodrigues parameters). The course ends with a look at static attitude determination, using modern algorithms to predict and execute relative orientations of bodies in space.\n\nAfter this course, you will be able to...\n\n* Differentiate a vector as seen by another rotating frame and derive frame dependent velocity and acceleration vectors\n* Apply the Transport Theorem to solve kinematic particle problems and translate between various sets of attitude descriptions\n* Add and subtract relative attitude descriptions and integrate those descriptions numerically to predict orientations over time\n* Derive the fundamental attitude coordinate properties of rigid bodies and determine attitude from a series of heading measurements","tutor":"Hanspeter Schaub","provider":"Coursera","language":"English","skills":["new-moocs-2017"],"subject":"Physics","studentsInterested":"19","courseLink":"https://www.coursera.org/learn/spacecraft-dynamics-kinematics","classCentralLink":"https://www.class-central.com/course/coursera-kinematics-describing-the-motions-of-spacecraft-8549"},{"title":"Ecosystems of California","about":"This course surveys the diversity, structure and functioning of California’s ecosystems through time and the ways they have influenced and responded to human activities and stewardship. Topics include ecosystem drivers such as climate, soils, and land use history; human and ecological prehistory of the state; comparative marine, freshwater, and terrestrial ecosystem dynamics; and managed ecosystems such as range, fisheries and agriculture in California. The course also emphasizes important skills to understand as a scientist or consumer of scientific information, including data collection, natural history, and writing.","tutor":"Erika Zavaleta","provider":"Coursera","language":"English","skills":["ecosystems","california","new-moocs-2017"],"subject":"Environmental Science","studentsInterested":"34","courseLink":"https://www.coursera.org/learn/california-ecosystems","classCentralLink":"https://www.class-central.com/course/coursera-ecosystems-of-california-9578"},{"title":"Общие вопросы патологии и патологической анатомии (General Issues of Pathology and Pathologic Anatomy)","about":"Уважаемые слушатели!\nКурс \"Общие вопросы патологии и патологической анатомии\" предназначен только для студентов, обучающихся на медицинских специальностях и медицинских специалистов.\nПредупреждение: данный курс содержит материалы, не рекомендованные к просмотру лицам со слабой психикой и беременным женщинам.\n\nКурс базируется на многолетнем опыте научной, диагностической и преподавательской работы автора в традициях известной научной школы.\nИзложение сложного материала проводится на современном уровне, все основные положения иллюстрируются большей частью оригинальными авторскими макро- и микроскопическими изображениями, схемами и рисунками\nЗадачи:\n1. Познакомить слушателей с общепринятыми взглядами на природу болезней человека\n2. Обозначить некоторые биомедицинские проблемы, нуждающиеся в дальнейшем комплексном изучении\n3. На конкретных примерах продемонстрировать структурные изменения, лежащие в основе важнейших болезней человека\n\nПо завершении этого курса учащиеся будут\n\nУметь:\n1. Критически оценивать представления о природе заболеваний человека\n2. Распознавать некоторые макроскопические изменения при основных общепатологических процессах\n3. Распознавать некоторые микроскопические изменения при основных общепатологических процессах\n\nЗнать:\n1. Сущность структурных изменений при общепатологических процессах\n2. Основные методы, необходимые для морфологического анализа общепатологических процессов\n3. Основные источники по истории патологии и современной интерпретации патологических процессов\n\nВладеть:\n1. Общей методологией комплексного анализа патологических процессов\n2. Современной терминологией, касающейся общепатологических процессов","tutor":"Цинзерлинг Всеволод Александрович","provider":"Coursera","language":"Russian","skills":["anatomy","pathology","new-moocs-2017"],"subject":"Biology","studentsInterested":"4","courseLink":"https://www.coursera.org/learn/voprosy-patologii","classCentralLink":"https://www.class-central.com/course/coursera-------general-issues-of-pathology-and-pathologic-anatomy-9592"},{"title":"Кинематика","about":"В курсе рассматриваются: кинематика точки и твёрдого тела (причём с разных точек зрения предлагается рассмотреть проблему ориентации твердого тела), классические задачи динамики механических систем и динамики твердого тела, элементы небесной механики, движение систем переменного состава, теория удара, дифференциальные уравнения аналитической динамики.\n\nВ курсе представлены все традиционные разделы теоретической механики, однако особое внимание уделено рассмотрению наиболее содержательных и ценных для теории и приложений разделов динамики и методов аналитической механики; статика изучается как раздел динамики, а в разделе кинематики подробно вводятся необходимые для раздела динамики понятия и математический аппарат.","tutor":"Притыкин Дмитрий Аркадьевич","provider":"Coursera","language":"Russian","skills":["russia","new-moocs-2017"],"subject":"Physics","studentsInterested":"3","courseLink":"https://www.coursera.org/learn/kinematics","classCentralLink":"https://www.class-central.com/course/coursera--7782"},{"title":"Wood Science: Beyond Building","about":"The central question of this course: “why study wood?” If “why study wood” is the question, one answer would be that it is the only raw material available to us that is truly renewable in human life span terms. Wood is as important to society today as it ever was, despite the development of many man-made substitute materials, changing resource availability, and the changing needs of society. Some items on the list of wood products stay the same (lumber, plywood and veneer for building construction, furniture, shipping pallets \u0026 crates and other containers \u0026 packaging materials, railroad ties, utility poles, chemical feed stocks, etc), but the list also keeps changing to meet new needs and challenges as the resource changes.\n\nIn short, wood is a far more diverse, green, and renewable resource than you might have imagined. Join us to learn about the important role of wood in human history, civilization, and our future.\n\nBy the end of the course, learners will be able to:\n- describe wood as a raw material and its critical importance to the world economy, and the lives of the people that make that economy work.\n- identify the projected trend for wood consumption to continue to grow in the coming years, despite the image of wood as a \"low tech\" material.\n- identify the ways in which wood\u0027s properties can lead to its efficient and sustainable use.\n-identify wood\u0027s positive role in boosting the world economy and ability to lead to unexpected vocations.","tutor":"Lawrence Osborn and Jeffrey Slahor","provider":"Coursera","language":"English","skills":["new-moocs-2017"],"subject":"Environmental Science","studentsInterested":"41","courseLink":"https://www.coursera.org/learn/wood-science","classCentralLink":"https://www.class-central.com/course/coursera-wood-science-beyond-building-8134"},{"title":"Analysing Complexity","about":"The first course of the specialization ANALYZING COMPLEXITY will teach you what unifying patterns lie at the core of all complex problems. It advances your knowledge of your own field by teaching you to look at it in new ways.\n\nANALYZING COMPLEXITY is constructed in the following way: Week I. \"What is Complexity?\" - What is at the core of all complex problems Week II. \"Complex Physical Systems\" - What complex problems all have in common in the inanimate world Week III. \"Complex Adaptive Systems\" - What complex problems all have in common in nature Week IV. \"Complex Cultural Systems\" - What complex problems all have in common in human society Week V. \"Complexity, Fragility, and Breakdown\" - Why complex problems arise Week VI. \"Complexity in the Anthropocene\" - What complex problems face us today","tutor":"David Baker, David Christian and Shawn Ross","provider":"Coursera","language":"English","skills":["new-moocs-2017"],"subject":"Science","studentsInterested":"32","courseLink":"https://www.coursera.org/learn/analysing-complexity","classCentralLink":"https://www.class-central.com/course/coursera-analysing-complexity-8139"},{"title":"Ecosystem Services: a Method for Sustainable Development","about":"Ecosystem services are a way of thinking about – and evaluating – the goods and services provided by nature that contribute to the well-being of humans.\n\nThis MOOC will cover scientific (technical), economic, and socio-political dimensions of the concept through a mix of theory, case-studies, interviews with specialists and a serious-game. By the end of this course, our aim is to enable you to:\n\n• define the concept of ecosystem services, its principles and limitations\n• understand the key services associated with any ressource (e.g., fresh water) through readings and case-studies\n• appreciate the advantages and potential risks of monetising ecosystem services\n• appreciate the social dimensions (power issues, cultural biases) embedded within any method\n• integrate tactical advice on mainstreaming this approach into policy and standard government practices\n• Optional: learn how to map ecosystem services with GIS tools\n\nThe session that runs May 29th- July 10th will be actively monitored by the instructors, and learners will have the opportunity to ask questions.\n\nThis course was developed by instructors from the University of Geneva with the help of numerous researchers and input from the Geneva Water Hub and the Natural Capital Project. The course was financed by the University of Geneva, the Global Programme Water Initiatives of the Swiss Agency for Development and Cooperation (SDC), and the Luc Hoffmann Institute.\n\nThis MOOC is supported by the Geneva Water Hub and the University of Geneva along with the MOOC in « Water Resources Management and Policy » (www.coursera.org/learn/water-management) and the one in « International Water Law » (www.coursera.org/learn/droit-eau).\n\nWe look forward to you joining us!","tutor":"Martin Schlaepfer, Juliet Jane Fall and Anthony Lehmann","provider":"Coursera","language":"English","skills":["europe","switzerland","new-moocs-2017"],"subject":"Environmental Science","studentsInterested":"750","courseLink":"https://www.coursera.org/learn/ecosystem-services","classCentralLink":"https://www.class-central.com/course/coursera-ecosystem-services-a-method-for-sustainable-development-8088"},{"title":"Fundamental Neuroscience for Neuroimaging","about":"Neuroimaging methods are used with increasing frequency in clinical practice and basic research. Designed for students and professionals, this course will introduce the basic principles of neuroimaging methods as applied to human subjects research and introduce the neuroscience concepts and terminology necessary for a basic understanding of neuroimaging applications. Topics include the history of neuroimaging, an introduction to neuroimaging physics and image formation, as well as an overview of different neuroimaging applications, including functional MRI, diffusion tensor imaging, magnetic resonance spectroscopy, perfusion imaging, and positron emission tomography imaging. Each will be reviewed in the context of their specific methods, source of signal, goals, and limitations. The course will also introduce basic neuroscience concepts necessary to understand the implementation of neuroimaging methods, including structural and functional human neuroanatomy, cognitive domains, and experimental design.","tutor":"Arnold Bakker","provider":"Coursera","language":"English","skills":["neuroscience","research","neuroimaging"],"subject":"Biology","studentsInterested":"42","courseLink":"https://www.coursera.org/learn/neuroscience-neuroimaging","classCentralLink":"https://www.class-central.com/course/coursera-fundamental-neuroscience-for-neuroimaging-9719"},{"title":"General Pathophysiology","about":"Dear listeners!\nWarning: this course contains shocking materials and is not recommended for viewing to persons with weak psyche, minors and pregnant women.\n\nThe course describes subject and methods of Pathophysiology, its place within system of biomedical sciences and history. It includes General Nosology (concept of health and disease, general etiology and pathogenesis, pathological processes and states, role of causal factors, conditions, reactivity and somatotype in pathology). It gives systematic of locally and centrally driven typical pathological processes: arterial, venous and combined hyperemiae, stasis, inflammation, immunopathological processes (including allergy and autoimmune disorders) acute phase response, fever, stress, shock, etc. Course deals with functional, metabolic and informational aspects of typical pathologic processes, like disorders of signaling, reception, post – receptor translation, programming and program archiving, conflicts of programs in living systems. It contains the consequent analysis of the injury and defensive responses as regards separate cells, organs and tissues and the whole organism. The lectures based on author’s original three-volumed textbook and workshop in Pathophysiology republished in Russia many times.","tutor":"Churilov Leonid Pavlovich","provider":"Coursera","language":"English","skills":["pathology","pathophysiology"],"subject":"Biology","studentsInterested":"77","courseLink":"https://www.coursera.org/learn/pathophysiology","classCentralLink":"https://www.class-central.com/course/coursera-general-pathophysiology-9783"},{"title":"DNA Decoded","about":"Are you a living creature? Then, congratulations! You’ve got DNA. But how much do you really know about the microscopic molecules that make you unique?\n\nWhy is DNA called the “blueprint of life”?\nWhat is a “DNA fingerprint”?\nHow do scientists clone DNA?\nWhat can DNA teach you about your family history?\nAre Genetically Modified Organisms (GMOs) safe?\nIs it possible to revive dinosaurs by cloning their DNA?\n\nDNA Decoded answers these questions and more. If you’re curious about DNA, join Felicia Vulcu and Caitlin Mullarkey, two biochemists from McMaster University, as they explore the structure of DNA, how scientists cracked the genetic code, and what our DNA can tell us about ourselves. Along the way, you’ll learn about the practical techniques that scientists use to analyze our genetic risks, to manipulate DNA, and to develop new treatments for a range of different diseases. Then, step into our virtual lab to perform your own forensic DNA analysis of samples from a crime scene and solve a murder.","tutor":"Caitlin Mullarkey and Felicia Vulcu","provider":"Coursera","language":"English","skills":["genetics","dna"],"subject":"Biology","studentsInterested":"185","courseLink":"https://www.coursera.org/learn/dna-decoded","classCentralLink":"https://www.class-central.com/course/coursera-dna-decoded-10372"},{"title":"Introduction to Algae","about":"This course was produced by the Algae Technology Educational Consortium and UC San Diego with funding from the Algae Foundation, the National Renewable Energy Lab, and the U.S. Department of Energy.\n\nAlgae are an extremely diverse group of organisms that can be found in almost every ecosystem on the planet, and they play an essential role for life on earth. They are little bio-factories that use the process of photosynthesis to create chemical compounds that we can utilize for food, feed, medicine, and even energy. We’ve brought together some of foremost algae experts from industry and academia to teach you the fundamentals of algae.\n\nThis course will cover what algae are, why they are important, and why we are interested in them for both their environmental benefit, as well as their use for products. You will also explore the vast diversity of algae including the characteristics and applications of some of the main types of algae that are in commercial use today.\n\nLater you will learn about algal ecology and how interactions with environment, including pests and predators, affect algal productivity. And finally you will examine the processes of algae bio-manufacturing including production processes, as well as some of the products, benefits, and challenges that impact our ability to make commercially viable products from algae.","tutor":"Dr. Stephen Mayfield and Ira \"Ike\" Levine","provider":"Coursera","language":"English","skills":["ecology","renewable energy","environmental science"],"subject":"Environmental Science","studentsInterested":"28","courseLink":"https://www.coursera.org/learn/algae","classCentralLink":"https://www.class-central.com/course/coursera-introduction-to-algae-10442"},{"title":"Mind of the Universe: Science in Progress","about":"From William Harvey discovering the circulation of blood to Albert Einstein developing the theory of relativity: almost all scientific research starts from something odd and unexpected that hasn\u0027t been explained yet, and, subsequently, the scientist creatively imagining possible explanations for it, formulating hypotheses.\n\nHowever, the problem with formulating hypotheses is the \"theory-ladenness of observation\": ones expectations and background theories curtail and determine what one observes. The best way to reduce the negative consequences of theory-ladenness of observation as much as possible, is not by adopting the highest methodological standards, but by continuing to think outside the box throughout the problem solving process, by tirelessly, creatively imagining alternative explanations and hypotheses.\n\nIn this learning experience you will be turned upside down by philosopher Tim de Mey, who will challenge you to think outside of your comfort zone. You will be challenged to reflect critically and creatively on what triggers your research, i.e., what is driving the scientist in you. Tim will show you how openness to and interaction with other disciplines generates new ideas, and how important it is that scientists, besides the possibilities of their own discipline, are also aware of its (and there) limitations. Take this challenge and you will construct the perfect out-of-the-box research question that will tease the Mind of the Universe scientists to explore even better answers in their research.\n\nThis online learning experience is a spin-off of The Mind of the Universe documentary series created by the Dutch broadcasting company VPRO and professor Robbert Dijkgraaf, Princeton University. A number of universities in the Netherlands have used the open source material of the documentary series as a starting point to create similar experiences.","tutor":"Tim de Mey","provider":"Coursera","language":"English","skills":["science","research"],"subject":"Science","studentsInterested":"55","courseLink":"https://www.coursera.org/learn/mind-of-the-universe-science-in-progress","classCentralLink":"https://www.class-central.com/course/coursera-mind-of-the-universe-science-in-progress-10719"},{"title":"The Science of Stem Cells","about":"What promise do stem cells hold for the treatment of medical conditions? In this five-part online course you will explore the history and basic biology of stem cells, learn about new research techniques, and find out how stem cells could lead to cures for diseases and to individualized medicine. You will hear from Museum scientists, medical researchers at the frontiers of the field, and a panel of bioethics experts who will address the ethical implications of stem cell research and therapy. Learn what has already been accomplished, what challenges remain, and what medical breakthroughs may lie ahead.","tutor":"Dr. Zehra Dincer","provider":"Coursera","language":"English","skills":["biology","health research","stem cells"],"subject":"Biology","studentsInterested":"63","courseLink":"https://www.coursera.org/learn/stem-cells","classCentralLink":"https://www.class-central.com/course/coursera-the-science-of-stem-cells-10745"},{"title":"Введение в геологию полезных ископаемых","about":"Курс дает знания о формировании месторождений твёрдых полезных ископаемых, о геолого-промышленных типах месторождений.","tutor":"Ирина Клавдиевна Котова and Иван Александрович Алексеев","provider":"Coursera","language":"Russian","skills":["earth science","geology"],"subject":"Science","studentsInterested":"6","courseLink":"https://www.coursera.org/learn/geologiya-poleznykh-iskopayemykh","classCentralLink":"https://www.class-central.com/course/coursera------10752"},{"title":"Introduction to Systems Biology","about":"This course will introduce the student to contemporary Systems Biology focused on mammalian cells, their constituents and their functions. Biology is moving from molecular to modular. As our knowledge of our genome and gene expression deepens and we develop lists of molecules (proteins, lipids, ions) involved in cellular processes, we need to understand how these molecules interact with each other to form modules that act as discrete functional systems. These systems underlie core subcellular processes such as signal transduction, transcription, motility and electrical excitability. In turn these processes come together to exhibit cellular behaviors such as secretion, proliferation and action potentials. What are the properties of such subcellular and cellular systems? What are the mechanisms by which emergent behaviors of systems arise? What types of experiments inform systems-level thinking? Why do we need computation and simulations to understand these systems?\n\nThe course will develop multiple lines of reasoning to answer the questions listed above. Two major reasoning threads are: the design, execution and interpretation of multivariable experiments that produce large data sets; quantitative reasoning, models and simulations. Examples will be discussed to demonstrate “how” cell- level functions arise and “why” mechanistic knowledge allows us to predict cellular behaviors leading to disease states and drug responses.","tutor":"Ravi Iyengar","provider":"Coursera","language":"English","skills":["usa","north america"],"subject":"Biology","studentsInterested":"358","courseLink":"https://www.coursera.org/learn/systems-biology","classCentralLink":"https://www.class-central.com/course/coursera-introduction-to-systems-biology-490"},{"title":"Emergence of Life","about":"How did life emerge on Earth? How have life and Earth co-evolved through geological time? Is life elsewhere in the universe? Take a look through the 4-billion-year history of life on Earth through the lens of the modern Tree of Life!\n\nThis course will evaluate the entire history of life on Earth within the context of our cutting-edge understanding of the Tree of Life. This includes the pioneering work of Professor Carl Woese on the University of Illinois Urbana-Champaign campus which revolutionized our understanding with a new \"Tree of Life.\" Other themes include:\n-Reconnaissance of ancient primordial life before the first cell evolved\n-The entire ~4-billion-year development of single- and multi-celled life through the lens of the Tree of Life\n-The influence of Earth system processes (meteor impacts, volcanoes, ice sheets) on shaping and structuring the Tree of Life\n\nThis synthesis emphasizes the universality of the emergence of life as a prelude for the search for extraterrestrial life.","tutor":"Bruce Fouke","provider":"Coursera","language":"English","skills":["usa","north america"],"subject":"Science","studentsInterested":"2.0k","courseLink":"https://www.coursera.org/learn/emergence-of-life","classCentralLink":"https://www.class-central.com/course/coursera-emergence-of-life-1401"},{"title":"Integrated Analysis in Systems Biology","about":"This course will focus on developing integrative skills through directed reading and analysis of the current primary literature to enable the student to develop the capstone project as the overall final exam for the specialization in systems biology.","tutor":"Susana Neves and Ravi Iyengar","provider":"Coursera","language":"English","skills":["usa","north america"],"subject":"Biology","studentsInterested":"546","courseLink":"https://www.coursera.org/learn/integrated-analysis","classCentralLink":"https://www.class-central.com/course/coursera-integrated-analysis-in-systems-biology-1711"},{"title":"Introduction to Acoustics (Part 2)","about":"Learners might have learned the basic concepts of the acoustics from the ‘Introduction to Acoustics (Part 1).’ Now it is time to apply to the real situation and develop their own acoustical application. Learners will analyze the radiation, scattering, and diffraction phenomenon with the Kirchhoff –Helmholtz Equation. Then learners will design their own reverberation room or ducts that fulfill the condition they have set up.","tutor":"Yang-Hann Kim","provider":"Coursera","language":"English","skills":["asia","south korea"],"subject":"Physics","studentsInterested":"116","courseLink":"https://www.coursera.org/learn/intro-to-acoustics-2","classCentralLink":"https://www.class-central.com/course/coursera-introduction-to-acoustics-part-2-2288"},{"title":"普通物理學 - 電磁學、光學及近代物理","about":"物理學是描述世上質量與能量交互作用的學問，在這門課中我們將為大家介紹近代物理對於世界的認識。我們會從電磁學出發，進展到光學，並進而說明近代物理對人類觀念的突破。","tutor":"朱士維（Shi-Wei Chu）","provider":"Coursera","language":"Chinese","skills":["asia","taiwan"],"subject":"Physics","studentsInterested":"11","courseLink":"https://www.coursera.org/learn/wuli","classCentralLink":"https://www.class-central.com/course/coursera----2714"},{"title":"Engineering Life: Synbio, Bioethics \u0026 Public Policy","about":"Synbio is a diverse field with diverse applications, and the different contexts (e.g., gain-of-function research, biofuels) raise different ethical and governance challenges. The objective of this course is to increase learners’ awareness and understanding of ethical and policy/governance issues that arise in the design, conduct and application of synthetic biology. The course will begin with a short history of recombinant DNA technology and how governance of that science developed and evolved, and progress through a series of areas of application of synbio.\n\nContent will be presented in many forms, including not only reading and lectures, but also recorded and live interviews and discussions with scientists, ethicists and policy makers. Learners will have the opportunity to think, write and talk about the issues and challenges in their own work and in real-life case examples. A final project will engage students in the development of governance models for synbio.","tutor":"Debra Mathews","provider":"Coursera","language":"English","skills":["usa","north america","new-moocs-2017"],"subject":"Science","studentsInterested":"16","courseLink":"https://www.coursera.org/learn/synbioethics","classCentralLink":"https://www.class-central.com/course/coursera-engineering-life-synbio-bioethics-public-policy-3248"},{"title":"Fundamentals of Fluid-Solid Interactions","about":"What is fluid-solid interactions ? It is what happens when the motions of a fluid and of a solid are somehow coupled. This happens all the time, around you when leaves flutter in the wind, inside you when your heart beats, above you when wings of a plane vibrate, under the sea... The idea behind this MOOC is to give you the basic tools to be able to predict and eventually mitigate things called flutter, galloping, sloshing, vortex-induced vibrations, added mass, to cite a few.\n\nWe are going to consider any possible domains of applications such as civil engineering, aerospace engineering, nuclear engineering , ocean engineering, biomechanics and even food processing !\n\nThis is why we called the course “Fundamentals of Fluid Solid Interactions ”. There are so many phenomena and so many models that we need to work together on the basic mechanisms .\n\nIf you want to see how fluid-solid interactions work, and be able to use that knowledge, join us !\n\nA first session of the course was run in early 2016, with learners from over 100 countries. It is now available with subtitles, in English and now in Chinese.\n\nSee the video at http://goo.gl/YKSMnD","tutor":"Emmanuel de Langre, Xavier Amandolese and Olivier Doaré","provider":"Coursera","language":"English","skills":["fluid-solid interactions","canada","north america"],"subject":"Physics","studentsInterested":"50","courseLink":"https://www.coursera.org/learn/fluid-solid-interaction","classCentralLink":"https://www.class-central.com/course/coursera-fundamentals-of-fluid-solid-interactions-4880"},{"title":"Planification et Design de Systèmes et Technologies d’Assainissement","about":"Désirez-vous apprendre à mettre en œuvre des solutions d’assainissement abordables et adaptées à différents contextes ? Voulez-vous connaître les derniers développement dans le domaine de la planification de l’assainissement urbain ? Êtes-vous intéressés par des exemples de systèmes d’assainissement urbain qui fonctionnent dans les pays à faible et moyen revenu ? Si oui, alors ce cours est pour vous !\n\nLe cours débute par une introduction à la planification intégrée de l’assainissement et adresse aussi bien la planification à l’échelle de la ville que la planification dans des contextes spécifiques tels que les quartiers informels. Après un survol des différentes approches de planification de l’assainissement, vous aurez l’occasion de passer en revue les différents systèmes et technologies possibles, la terminologie et concepts clé, et comprendre pourquoi il est crucial de réfléchir en termes de « système intégré » pour la planification de l’assainissement urbain. Le cours couvre toute la chaîne de l’assainissement et fournit de l’information détaillée sur les systèmes d’assainissement adaptés aux contextes à faibles et moyen revenus (par exemple, des systèmes basés sur les fosses sèches, des systèmes décentralisés avec différents réseaux d’égout, le transport des eaux noires).\n\nEawag-Sandec et EPFL offrent ce cours conjointement avec des experts en assainissement de la Banque Mondiale et de l’OMS.\n\nSERIE DE MOOC « EAU, ASSAINISSEMENT ET DÉCHETS SOLIDES DANS LES CONTEXTES DU DÉVELOPPEMENT »\nCe cours est l’un des quatre cours de la série « Eau, Assainissement et Déchets Solides dans les Contextes du Développement ».\n\nVERSION ANGLAISE DE CE COURS\nCe cours est offert simultanément en français et en anglais. Le nom du cours en anglais est « Planning \u0026 Design of Sanitation Systems and Technologies ».","tutor":"Christoph Lüthi","provider":"Coursera","language":"French","skills":["europe","switzerland"],"subject":"Environmental Science","studentsInterested":"8","courseLink":"https://www.coursera.org/learn/sanitation-fr","classCentralLink":"https://www.class-central.com/course/coursera-planification-et-design-de-systemes-et-technologies-d-assainissement-6886"},{"title":"Discover Best Practice Farming for a Sustainable 2050","about":"The Discover Best Practice Farming for a Sustainable 2050 Course is based on a clear vision: imagine best practice farming for 2050, start to implement these strategies now, all the while making sure it will still be profitable. At UWA we\u0027re doing just that with the Future Farm 2050 Project, set on a mixed-enterprise farm in Western Australia and we want you to learn how it can be done in your part of the world.\nAlthough this course is based on agriculture, it\u0027s not only about farming. It is a multi-disciplinary course that addresses a wide range of issues confronting the industry, including rural communities, rural infrastructure and conservation of biodiversity in agriculture.\nBy completing this course you will understand that feeding and clothing the planet requires a multi-disciplinary approach\nand upon completion you will be able to explain best practices of sustainable farming and apply them in new contexts.","tutor":"Graeme Martin","provider":"Coursera","language":"English","skills":["sustainability","agriculture","biodiversity","farming","new-moocs-2017"],"subject":"Environmental Science","studentsInterested":"134","courseLink":"https://www.coursera.org/learn/best-practice-farming-sustainable-2050","classCentralLink":"https://www.class-central.com/course/coursera-discover-best-practice-farming-for-a-sustainable-2050-9575"}]