[{"title":"Gamification","about":"Gamification is the application of game elements and digital game design techniques to non-game problems, such as business and social impact challenges. This course will teach you the mechanisms of gamification, why it has such tremendous potential, and how to use it effectively. For additional information on the concepts described in the course, you can purchase Professor Werbach\u0027s book For the Win: How Game Thinking Can Revolutionize Your Business in print or ebook format in several languages.","tutor":"Kevin Werbach","provider":"Coursera","language":"English","skills":["usa","north america"],"subject":"Design \u0026 Creativity","studentsInterested":"6.2k","courseLink":"https://www.coursera.org/learn/gamification","classCentralLink":"https://www.class-central.com/course/coursera-gamification-343"},{"title":"Introduction to Programming for Musicians and Digital Artists","about":"The course, lecture, and examples build on each other to teach the fundamentals of programming in general (logic, loops, functions, objects, classes) and also deals with advanced topics including multi-threading, events and signals. Throughout the course, students create meaningful and rewarding expressive digital “instruments” that make sound and music in direct response to program logic. The ChucK language provides precise high-level control over time, audio computation, and user interface elements (track pad, joysticks, etc.). ChucK is used (unknowingly in most cases, via SMule Apps) by millions of users throughout the world, and is the backbone of dozens of academic programs and laptop orchestras. Learning to program using ChucK, through the musical examples provided in this course, will prepare students to program in C++, Java, and other languages. There will be special guest lectures from creators of the ChucK language, Dr. Ge Wang (Stanford University) and Dr. Perry R. Cook (Princeton University).","tutor":"Ajay Kapur","provider":"Kadenze","language":"English","skills":["programming","digital music","digital media","usa","north america"],"subject":"Digital Media","studentsInterested":"8.8k","courseLink":"https://www.kadenze.com/courses/introduction-to-programming-for-musicians-and-digital-artists","classCentralLink":"https://www.class-central.com/course/kadenze-introduction-to-programming-for-musicians-and-digital-artists-3749"},{"title":"Sound Production in Ableton Live for Musicians and Artists","about":"This course provides hands-on experience in producing, mixing, and sound design with a digital audio workstation. Students will learn the fundamentals (physics) of sound and digital audio, proper gain staging, where and how distortion enters recordings and mixes, how to set levels and panning, effective sub group mixing, and an introduction to signal processing such as equalization, compression, delay, and reverb. In addition to core audio and mixing concepts, students will learn various production techniques, such as sequencing, arranging, automation, using virtual instruments (e.g. synths, samplers, and drum machine plugins), working with MIDI, plugin formats such as VST/Audio-Units, and mapping digital USB controllers for the studio and live performance.\nThe material covered in this course will range from the foundations of producing music and sound design, to more advanced topics such as Ableton \"racks\" (Audio Effect Racks, MIDI Effect Racks, Instrument Racks, and Drum Racks), multi-band effects processing, advanced modulation, warping, time-stretching, and mangling audio, as well as taking advantage of Live\u0027s audio analysis tools for extracting grooves, melody, harmony, and drums from recorded sound.","tutor":"Jordan Hochenbaum","provider":"Kadenze","language":"English","skills":["digital music production","usa","north america"],"subject":"Digital Media","studentsInterested":"2.3k","courseLink":"https://www.kadenze.com/courses/sound-production-in-ableton-live-for-musicians-and-artists","classCentralLink":"https://www.class-central.com/course/kadenze-sound-production-in-ableton-live-for-musicians-and-artists-3765"},{"title":"Songwriting: Writing the Lyrics","about":"There’s a songwriter lurking somewhere inside you, peeking around corners, wondering if it’s safe to come out. Now it is. This course is an invitation to let your inner songwriter step into the sunlight. All it takes is a simple “yes” and you’ll be climbing that windy hill, marveling at the view.\n\nIf you haven’t written any or many songs, this course will show you an efficient, effective process for tailoring songs to express your ideas and emotions. If you have, you’ll look at your process differently, taking control of aspects of the process you may have not noticed.\n\nThe course will start by examining the tools available to you, all revolving around the essential concept of prosody. You’ll learn to use your tools to enhance your message—to work compositionally at the same time you’re developing your ideas.\n\nYou’ll be working both lyrically and musically, though musically it’s not necessary that you either read music or play an instrument. If you play, great, and you’ll be encouraged to play and record your musical responses to the assignments. If you don’t play, the course offers you a number of musical loops to work with. All you’ll have to do is sing your melodies over the loops.\n\nAssignments will ask you to post something for peer review—sometimes lyric lines or sections, sometimes melodies, sometimes both. None of it has to be polished. The course is about writing, not performing.\n\nMost important, you’ll have a lot of fun.","tutor":"Pat Pattison","provider":"Coursera","language":"English","skills":["usa","north america"],"subject":"Music","studentsInterested":"6.8k","courseLink":"https://www.coursera.org/learn/songwriting-lyrics","classCentralLink":"https://www.class-central.com/course/coursera-songwriting-writing-the-lyrics-523"},{"title":"Fundamentals of Graphic Design","about":"Graphic Design is all around us! Words and pictures—the building blocks of graphic design—are the elements that carry the majority of the content in both the digital world and the printed world. As graphic design becomes more visible and prevalent in our lives, graphic design as a practice becomes more important in our culture.\n\nThrough visual examples, this course will teach you the fundamental principles of graphic design: imagemaking, typography, composition, working with color and shape... foundational skills that are common in all areas of graphic design practice. I don\u0027t just want you to watch a video of someone talking about design, I want you to MAKE design! If you want to be a designer you have to be a maker and a communicator, so this course will offer you lots of opportunities to get your hands dirty with exercises and with more practical projects.\n\nAt the end of this course you will have learned how to explore and investigate visual representation through a range of image-making techniques; understand basic principles of working with shape, color and pattern; been exposed to the language and skills of typography; and understand and have applied the principles of composition and visual contrast. If you complete the course, along with its optional (but highly recommended) briefs, you will have a core set of graphic design skills that you can apply to your own projects, or to more deeply investigate a specialized area of graphic design.\n\nTo succeed in this course you will need access to a computer. You can complete this course without one but it will be tougher. Access to, and a beginner\u0027s level knowledge of Adobe Creative Suite programs, such as Illustrator, Photoshop and InDesign will help you, especially if you want to complete the optional briefs.","tutor":"Michael Worthington","provider":"Coursera","language":"English","skills":["graphic design","typography","usa","north america"],"subject":"Design \u0026 Creativity","studentsInterested":"2.4k","courseLink":"https://www.coursera.org/learn/fundamentals-of-graphic-design","classCentralLink":"https://www.class-central.com/course/coursera-fundamentals-of-graphic-design-4792"},{"title":"Developing Your Musicianship","about":"Learn the basic concepts and approaches needed to understand, create, and perform contemporary music.\n\nIf you have a passion for music and are curious about how it works, or if you are a musician who learned to play by ear without formal study, this course will provide you with an engaging introduction to key concepts and approaches needed to understand, create, and perform contemporary music. Taught by Berklee College of Music professor George W. Russell, Jr., the course includes six lessons that delve into harmony and ear training—two areas of intensive focus for every entering Berklee student.\n\nThe course will teach you the major scale and minor pentatonic scale, and how they are constructed. You will learn what intervals are, how to sing them, and how to find them in music. The course explores tonal centers and how to find the key a song is in, in addition to common time signatures such as 4/4 and 3/4. You will learn how to build chords—major and minor triads, and major and dominant seventh chords—and how to build a common chord progression—the I IV V. You will also learn how to recognize the blues and AABA song forms, and write a basic chord sheet to express your song ideas.\n\nIn addition to the video lectures, each lesson features Berklee student performances and interviews. The students share their musical journey and offer advice for those wanting to study music. The course culminates with an assignment that asks you to compose and perform a riff blues tune using the minor pentatonic scale. Above all, the course is designed to share the joy of creating music and sharing it with others.\n\nSamy Elgazzar, a graduate of Berklee College of Music and a successful composer, will be your Teaching Assistant (TA) for the course.","tutor":"George Russell","provider":"Coursera","language":"English","skills":["usa","north america"],"subject":"Music","studentsInterested":"3.3k","courseLink":"https://www.coursera.org/learn/develop-your-musicianship","classCentralLink":"https://www.class-central.com/course/coursera-developing-your-musicianship-1726"},{"title":"Design: Creation of Artifacts in Society","about":"This is a course aimed at making you a better designer. The course marries theory and practice, as both are valuable in improving design performance. Lectures and readings will lay out the fundamental concepts that underpin design as a human activity. Weekly design challenges test your ability to apply those ideas to solve real problems. The course is deliberately broad - spanning all domains of design, including architecture, graphics, services, apparel, engineered goods, and products. The emphasis of the course is the basic design process: define, explore, select, and refine. You, the student, bring to the course your particular interests and expertise related to, for instance, engineering, furniture, fashion, architecture, or products. In prior sessions of the course about half of the participants were novices and about half had prior professional design expertise. Both groups seem to benefit substantially from the course. All project work is evaluated by your peers -- and indeed, you will also be a peer reviewer. This format allows you to see an interesting collection of projects while getting useful feedback on your own project.","tutor":"Karl T. Ulrich","provider":"Coursera","language":"English","skills":["usa","north america"],"subject":"Design \u0026 Creativity","studentsInterested":"4.7k","courseLink":"https://www.coursera.org/learn/design","classCentralLink":"https://www.class-central.com/course/coursera-design-creation-of-artifacts-in-society-371"},{"title":"Introduction to Classical Music","about":"Using a simple and enjoyable teaching style, this course introduces the novice listener to the wonders of classical music, from Bach fugues to Mozart symphonies to Puccini operas.","tutor":"Craig Wright","provider":"Coursera","language":"English","skills":["usa","north america"],"subject":"Music","studentsInterested":"7.2k","courseLink":"https://www.coursera.org/learn/introclassicalmusic","classCentralLink":"https://www.class-central.com/course/coursera-introduction-to-classical-music-2987"},{"title":"The Music of the Beatles","about":"The Music of the Beatles will track the musical development of the band, starting from the earliest days in Liverpool and Hamburg, moving through the excitement of Beatlemania, the rush of psychedelia, and the maturity of Abbey Road. While the focus will be on the music, we will also consider how recording techniques, the music business, the music of other artists, and the culture of the 1960s affected John, Paul, George, and Ringo as they created the Beatles repertory.\n\nThere is probably no band or artist that has had more written about their music than the Beatles. There are many good books on the band\u0027s biography, several insider accounts offering glimpses behind the scenes, books that interpret the meaning of the songs, and even books that catalog dates and people regarding the band. This course will try to synthesize much of that information into an account of the Beatles\u0027 development as musicians and songwriters.","tutor":"John Covach","provider":"Coursera","language":"English","skills":["usa","north america"],"subject":"Music","studentsInterested":"4.2k","courseLink":"https://www.coursera.org/learn/the-beatles","classCentralLink":"https://www.class-central.com/course/coursera-the-music-of-the-beatles-1135"},{"title":"History of Rock, Part One","about":"This course, part 1 of a 2-course sequence, examines the history of rock, primarily as it unfolded in the United States, from the days before rock (pre-1955) to the end of the 1960s. This course covers the music of Elvis Presley, Chuck Berry, Phil Spector, Bob Dylan, the Beatles, the Rolling Stones, Jimi Hendrix, Cream, and many more artists, with an emphasis both on cultural context and on the music itself. We will also explore how developments in the music business and in technology helped shape the ways in which styles developed.\n\nRock emerged in the mid 1950s as a blending of mainstream pop, rhythm and blues, and country and western--styles that previously had remained relatively separate. This new style became the music of the emerging youth culture and was often associated with teen rebellion. We will follow the story of how this rowdy first wave of rock and roll (1955-59) was tamed in the early 60s but came roaring back with the Beatles and the Rolling Stones and then went psychedelic by the end of the decade.","tutor":"John Covach","provider":"Coursera","language":"English","skills":["history of music","usa","north america"],"subject":"Music","studentsInterested":"4.8k","courseLink":"https://www.coursera.org/learn/history-of-rock","classCentralLink":"https://www.class-central.com/course/coursera-history-of-rock-part-one-690"},{"title":"Fundamentals of Music Theory","about":"This course will introduce students to the theory of music, providing them with the skills needed to read and write Western music notation, as well as to understand, analyse, and listen informedly. It will cover material such as pitches and scales, intervals, clefs, rhythm, form, meter, phrases and cadences, and basic harmony.\n\nThis course covers the fundamentals of Western music theory, from the absolute basics to some more advanced concepts and, as such, is the perfect course for beginners and more experienced musicians alike.\n\nFollow us on twitter\n@musictheorymooc\n#edmusictheory","tutor":"Michael Edwards, Zack Moir and Richard Worth","provider":"Coursera","language":"English","skills":["europe","scotland"],"subject":"Music","studentsInterested":"4.9k","courseLink":"https://www.coursera.org/learn/edinburgh-music-theory","classCentralLink":"https://www.class-central.com/course/coursera-fundamentals-of-music-theory-1358"},{"title":"Guitar for Beginners 1","about":"Grasp the essentials needed to begin playing acoustic or electric guitar. You\u0027ll learn an easy approach to get you playing quickly, through a combination of exploring the instrument, performance technique, and basic music theory.\n\nFor students who have long thought about picking up the acoustic or electric guitar, this course will provide an easy-access foundation that will get you playing. When first learning guitar, it is important to have the material presented in stages, in an enjoyable way that allows you to grasp the basics of the instrument and music. The course begins simply with the parts of the guitar, the names of the strings, tuning, and technique—whether finger-style or pick. It then explores the basics of music theory with such topics as scales, triads, power chords, and fingering and shapes.\n\nAt the end of this course, students will understand the structure, parts, and accessories of the instrument, in addition to an understanding of its basic maintenance. Electric guitar players will learn the operation of their instrument along with basic options for amplification, effect pedals, and sounds. Students will also learn to develop correct technique and apply theory concepts to their playing. They will have the foundational knowledge necessary to pursue most intermediate guitar courses.","tutor":"Thaddeus Hogarth","provider":"Coursera","language":"English","skills":["usa","north america"],"subject":"Music","studentsInterested":"4.6k","courseLink":"https://www.coursera.org/learn/guitar","classCentralLink":"https://www.class-central.com/course/coursera-guitar-for-beginners-1-522"},{"title":"Programming Max: Structuring Interactive Software for Digital Arts","about":"Max is a powerful platform that accommodates and connects a wide variety of tools for sound, graphics, music and interactivity using a flexible patching and programming environment. Max allows most computer users to write a simple, meaningful program within a few minutes, even with limited programming knowledge. But to do something more substantial it\u0027s necessary to approach Max as an actual programming language, by taking advantage of its various mechanisms for abstracting program elements into scalable, reusable components that can be combined in increasingly powerful ways.\nThis class will not cover every single capability of the language, but instead will focus on key concepts and mechanisms that will allow for tremendous new freedom and possibilities in Max. The class will touch upon:\nsound and movie playback\nsound synthesis\nsound and video effects processing\nalgorithmic composition\ncross-modal mappings (e.g., video affecting audio and vice versa)\ninteractive control (e.g., from QWERTY keyboard, mouse, USB devices, Open Sound Control)\nMax programming, like most interesting topics, has deep aspects and shallow aspects. This course will largely focus on the deep aspects: principles, concepts, techniques, and theory. If you understand these underlying aspects, your capacity to create in Max will deepen exponentially.\nAt the same time, this is not just a theory class. You will also create your own projects using Max. This course will teach the minimum you need to start working on assignments, but mostly I will teach you how to learn or look up the shallow knowledge on your own using Max’s built-in documentation, the Internet, and the Kadenze course forum, as well as how to program your own tests that answer specific questions or reveal potential bugs. Working in this way, you will also develop essential skills and habits that will develop confidence and self-sufficiency, and serve you in the future.","tutor":"Matt Wright","provider":"Kadenze","language":"English","skills":["digital video","max","usa","north america"],"subject":"Digital Media","studentsInterested":"3.1k","courseLink":"https://www.kadenze.com/courses/programming-max-structuring-interactive-software-for-digital-arts-i","classCentralLink":"https://www.class-central.com/course/kadenze-programming-max-structuring-interactive-software-for-digital-arts-6411"},{"title":"Introduction to Game Design","about":"Welcome! This course is an introduction to the primary concepts of gaming, and an exploration of how these basic concepts affect the way gamers interact with our games. In this course you will understand what defines a “game” and the mechanics and rules behind different types of games. Through four linked assignments you\u0027ll learn ways to create and describe a game concept, and specifically what makes a compelling game. This course focuses on the conceptual underpinnings of games, and all assignments can be completed with a pencil and paper – no previous programming knowledge is required.","tutor":"Fran Krause","provider":"Coursera","language":"English","skills":["game design","usa","north america"],"subject":"Digital Media","studentsInterested":"3.3k","courseLink":"https://www.coursera.org/learn/game-design","classCentralLink":"https://www.class-central.com/course/coursera-introduction-to-game-design-4220"},{"title":"Roman Architecture","about":"Roman Architecture is a course for people who love to travel and want to discover the power of architecture to shape politics, society, and culture.","tutor":"Diana Kleiner","provider":"Coursera","language":"English","skills":["usa","north america"],"subject":"Visual Arts","studentsInterested":"1.6k","courseLink":"https://www.coursera.org/learn/roman-architecture","classCentralLink":"https://www.class-central.com/course/coursera-roman-architecture-910"},{"title":"Film, Images \u0026 Historical Interpretation in the 20th Century: The Camera Never Lies","about":"This course is a short taster on the topic of the use of Images, Film, and their use in historical interpretation in the 20th century. It is primarily provided for those who have a general interest in history that draws on photojournalism as primary evidence, and films based on historical events.\n\n\nOnce you have completed this course we hope you will be equipped to:\n\nAppreciate the significance of photographs as historical evidence in the twentieth century.\nUnderstand the limitations of the medium, and how we can attribute meaning to these individual records of \u0027one moment in time\u0027 while taking into account the circumstances in which any particular image was taken.\nUnderstand how individuals and institutions have looked to manipulate images to their own ends – through alteration and/or censorship – and what that meant to contemporary interpretation, as well as subsequent historical interpretation.\nPut individual images into a wider context, and in particular with reference to history written, or portrayed, beyond academia: public history.\n\n\nDo be aware that part of the contents of this course regard images and depiction of war. Real wars and real images.","tutor":"Emmett Sullivan of Royal Holloway","provider":"Coursera","language":"English","skills":["photojournalism","historical films","europe","england"],"subject":"Film \u0026 Theatre","studentsInterested":"522","courseLink":"https://www.coursera.org/learn/film-images","classCentralLink":"https://www.class-central.com/course/coursera-film-images-historical-interpretation-in-the-20th-century-the-camera-never-lies-542"},{"title":"Exploring Beethoven’s Piano Sonatas","about":"Our relationship to Beethoven is a deep and paradoxical one. For many musicians, he represents a kind of holy grail: His music has an intensity, rigor, and profundity which keep us in its thrall, and it is perhaps unequalled in the interpretive, technical, and even spiritual challenges it poses to performers. At the same time, Beethoven’s music is casually familiar to millions of people who do not attend concerts or consider themselves musically inclined. Two hundred years after his death, he is everywhere in the culture, yet still represents its summit.\n\nThis course takes an inside-out look at the 32 piano sonatas from the point of view of a performer. Each lecture will focus on one sonata and an aspect of Beethoven’s music exemplified by it. (These might include: the relationship between Beethoven the pianist and Beethoven the composer; the critical role improvisation plays in his highly structured music; his mixing of extremely refined music with rougher elements; and the often surprising ways in which the events of his life influenced his compositional process and the character of the music he was writing.) The course will feature some analysis and historical background, but its perspective is that of a player, not a musicologist. Its main aim is to explore and demystify the work of the performer, even while embracing the eternal mystery of Beethoven’s music itself.\n\nThis season\u0027s Curtis courses are sponsored by Linda Richardson in loving memory of her husband, Dr. Paul Richardson.\n\nThe Dolfinger-McMahon Foundation supports Curtis\u0027s lifelong learning initiatives.","tutor":"Jonathan Biss","provider":"Coursera","language":"English","skills":["usa","north america"],"subject":"Music","studentsInterested":"2.2k","courseLink":"https://www.coursera.org/learn/beethoven-piano-sonatas","classCentralLink":"https://www.class-central.com/course/coursera-exploring-beethoven-s-piano-sonatas-730"},{"title":"Introduction to Graphic Illustration","about":"In today’s diverse consumer market, illustration exists through many forms of expression breaking with traditional roles of the illustrator. Through a series of projects, students will explore the translation, production and distribution of their visual ideas. Through the integration of design principles and drawing skills, students gain an opportunity to discover new possibilities for illustrated visual expression in the market.\nA student should have basic drawing skills, basic digital tool skills (Adobe Illustrator and Adobe Photoshop) and understanding in fundamental design theory, in order to take this class.","tutor":"Junichi Tsuneoka","provider":"Kadenze","language":"English","skills":["digital art","graphic illustration"],"subject":"Digital Media","studentsInterested":"4.9k","courseLink":"https://www.kadenze.com/courses/introduction-to-graphic-illustration","classCentralLink":"https://www.class-central.com/course/kadenze-introduction-to-graphic-illustration-3773"},{"title":"Comics: Art in Relationship","about":"Comics are one of the most popular and exciting ways to tell a story. This course offers a look at the fundamental building blocks of the comic book medium. Exploring panel to panel transitions, text to image relationships, and the intricacies of page layouts, students will examine new and innovative ways to bring their stories to life.\nThis course is designed for both beginning and advanced visual artists. Whether students have tried their hand at comics before or are simply interested in investigating how comics work, this course will provide insights to help storytellers make the most of every page.","tutor":"Matt Silady","provider":"Kadenze","language":"English","skills":["comic books","graphic novels"],"subject":"Visual Arts","studentsInterested":"2.4k","courseLink":"https://www.kadenze.com/courses/comics-art-in-relationship","classCentralLink":"https://www.class-central.com/course/kadenze-comics-art-in-relationship-3775"},{"title":"Introduction to Typography","about":"Typography is the art of manipulating the visual form of language to enrich and control its meaning. It’s an essential area of skill and knowledge for graphic designers. Typography predates modern graphic design by around 500 years; it is rich in rules, conventions, and esoteric terminology—but it remains an exciting space for invention and expression.\n\nIn this rigorous introductory course, we will study, name, and measure the characteristics of letterforms. We’ll consider the pragmatic concerns involved in selecting and combining type. We’ll peek into the rich historical, cultural, and aesthetic histories of familiar typefaces. We’ll discuss time-tested conventions and best practices in setting type, as governed by principles of hierarchy and spatial organization. And we’ll explore the expressive, meaning-making potential of type.\n\nInformative lectures will be complemented by a series of three peer-assessed assignments, culminating in an opportunity to design a full-scale typographic poster.\n\nPlease note that this is not a software course; a basic working knowledge of Adobe InDesign or other page layout software will be assumed. You will need access to a computer and page layout software, such as InDesign, to complete the assignments.","tutor":"Anther Kiley","provider":"Coursera","language":"English","skills":["graphic design","typography","usa","north america"],"subject":"Design \u0026 Creativity","studentsInterested":"2.2k","courseLink":"https://www.coursera.org/learn/typography","classCentralLink":"https://www.class-central.com/course/coursera-introduction-to-typography-5444"},{"title":"A Global History of Architecture","about":"How do we understand architecture? One way of answering this question is by looking through the lens of history, beginning with First Societies and extending to the 16th century. This course in architectural history is not intended as a linear narrative, but rather aims to provide a more global view, by focusing on different architectural \"moments.\"\nHow did the introduction of iron in the ninth century BCE impact regional politics and the development of architecture? How did new religious formations, such as Buddhism and Hinduism, produce new architectural understandings? What were the architectural consequences of the changing political landscape in northern Italy in the 14th century? How did rock-cut architecture move across space and time from West Asia to India to Africa? How did the emergence of corn impact the rise of religious and temple construction in Mexico?\nEach lecture analyzes a particular architectural transformation arising from a dynamic cultural situation. Material covered in lectures will be supplemented by readings from the textbook A Global History of Architecture.\nJoin us on a journey around the globe and learn how architecture has developed and interacted with the world’s culture, religion, and history.","tutor":"Mark Jarzombek and Vikramāditya “Vikram” Prakāsh","provider":"edX","language":"English","skills":["mitx"],"subject":"Visual Arts","studentsInterested":"4.8k","courseLink":"https://www.edx.org/course/global-history-architecture-mitx-4-605x-0","classCentralLink":"https://www.class-central.com/course/edx-a-global-history-of-architecture-928"},{"title":"Intro to the Design of Everyday Things","about":"Everyone designs. Design occurs anytime you deliberately change an environment to make things better. When you decide what seat to take in an auditorium you’re designing your experience. When you rearrange the furniture in a room or draft an email, you’re designing.\nThis course provides a summary of key concepts from the first two chapters of The Design of Everyday Things (Revised and Expanded Edition, November 2013) by Don Norman. It’s intended to be enjoyable and informative for anyone curious about design: everyday people, technical people, designers, and non-designers alike.\n\n\nWhy Take This Course?\nThis course will provide you with the knowledge needed to start recognizing the role of design in today’s world, and to start making better design decisions in your own life. In addition to learning basic design concepts such as affordances and signifiers, you will also gain practice in observing and applying design principles.","tutor":"Don Norman and Kristian Simsarian","provider":"Udacity","language":"English","skills":[],"subject":"Design \u0026 Creativity","studentsInterested":"1.1k","courseLink":"https://www.udacity.com/course/intro-to-the-design-of-everyday-things--design101","classCentralLink":"https://www.class-central.com/course/udacity-intro-to-the-design-of-everyday-things-1044"},{"title":"Graphic Design History: An Introduction","about":"Where did graphic design come from, and where will it go next? This fast-paced introduction to graphic design history will change your understanding of everything from fonts and letterforms to posters and brands. Discover how printers revolutionized society when they created open access to information. Explore the visual systems that inform graphic design practice—from handwritten alphabets to online publications. Learn how avant-garde artists, architects, poets, and painters shook the world by reinventing mass media. Pursue the dream of a unified civilization held together by neutral typefaces, international pictograms, and global brands—and see how subcultures rebelled against cultural uniformity by forging their own visual identities. Thinking about history will open your eyes to new ideas and diverse practices. The course is taught by Brockett Horne and Ellen Lupton, renowned authors and leading faculty at Maryland Institute College of Art (MICA). In a series of dynamic conversations, they will introduce you to fascinating people and processes that changed the way we communicate. Test your knowledge with short quizzes, and stretch your own design practice by responding to inspiring creative prompts.","tutor":"Brockett Horne and Ellen Lupton","provider":"Kadenze","language":"English","skills":["history","graphic design"],"subject":"Design \u0026 Creativity","studentsInterested":"2.1k","courseLink":"https://www.kadenze.com/courses/graphic-design-history-an-introduction","classCentralLink":"https://www.class-central.com/course/kadenze-graphic-design-history-an-introduction-5892"},{"title":"Serious Gaming","about":"Have you ever wondered how playing games can help us to train people, deal with societal challenges or raise awareness of contemporary social issues?\n\nIn this MOOC you will learn the ins and outs of games that are designed with exactly those purposes in mind: serious games. We will define serious games and discuss the different types that have been developed. We will explain why people like to play them and what impact they may have. State of the art theories from game studies, philosophy and media psychology will be used to help you understand how serious games work and how they appeal to players. The potential impact of gaming is addressed in detail by discussing persuasive games, which aim at changing the player\u0027s attitude. Throughout the MOOC, theoretical insights will be illustrated with playful animations and case studies of serious games that are developed by world-class companies in the city of Rotterdam.\n\nThis MOOC is particularly interesting for you when you are a student considering to study digital media such as serious games, a professional interested in the opportunities these games may create for your organization, or a game developer who wants to know more about the impact serious games can have.\n\nAre you ready to broaden your vision on serious games? Join this course and be inspired!","tutor":"Jeroen Jansz and Mijke Slot","provider":"Coursera","language":"English","skills":["europe","social issues","video games","serious games","netherlands"],"subject":"Digital Media","studentsInterested":"1.7k","courseLink":"https://www.coursera.org/learn/serious-gaming","classCentralLink":"https://www.class-central.com/course/coursera-serious-gaming-6185"},{"title":"The Technology of Music Production","about":"Learn about the music production process—including recording, editing, and mixing—and the tools available to you to create contemporary music on your computer.\n\nWith the recent introduction of high-quality-low-cost software and hardware, the tools of music production are now available to the masses. Albums are made in bedrooms as well as studios. On the surface this is liberating. Anyone can make an album for the low cost of a couple pieces of gear and a software package. But, if you dig deeper, you will find that it is not so easy. Producing music requires knowledge, dedication, and creativity.\n\nKnowledge is where this course comes in. No matter what kind of music you are making, there is a large set of tools that you will need to use. Each lesson of this course will demonstrate a different set of music production tools, loosely following along the music production process of recording, editing, and mixing.\n\nWe will start with some background on the nature of sound and how we perceive it. We will then examine the components necessary to record audio into a computer, so that you understand the devices that sound must travel through in a music production process.\n\nOnce recorded, sound must be organized along a timeline, a process known as editing. It allows us to give the impression of perfect performances and create many of the sounds we hear in contemporary music. The contemporary editing tool is the Digital Audio Workstation (DAW), a piece of software that stores and organizes all the assets of a musical project. We will focus on the editing tools that are essential in contemporary music production and that all DAWs provide.\n\nAfter editing, sounds must be combined or mixed together, so we look to the mixing board—a very creative place if you know how to use it. We will explore the basic functionality of both hardware and software mixing boards, including volume, pan, mute, solo, busses, inserts, sends, and submixes. The mixing process, however, includes more tools than the mixing board provides on its own. Sound must also be processed, modified from its recorded state to fit the context of the music. We will look at compression, equalization, and delay, and examine the many audio effects that are offshoots of these devices and how they are used in a musical context.\n\nIn the end, the music production process relies on your creativity. Creativity is a product of the mind and will stay there, unexpressed, until the right tools are used in the right way to share it with the world. If you have an idea in your head, it will take numerous steps, each with an important tool, to reach your audience. You bring the dedication and creativity, and this course will bring you the knowledge to make that happen.","tutor":"Loudon Stearns","provider":"Coursera","language":"English","skills":["digital music production","daw","digital audio workstation","usa","north america"],"subject":"Music","studentsInterested":"257","courseLink":"https://www.coursera.org/learn/technology-of-music-production","classCentralLink":"https://www.class-central.com/course/coursera-the-technology-of-music-production-6351"},{"title":"Дизайн-методология: управление вдохновением (Design-methodology. Inspiration management)","about":"Понимание дизайна как осмысленного творчества ставит сложные практические вопросы. Как контролировать креативный процесс и при этом не препятствовать его свободному течению? Можно ли активировать креативную энергию? Есть ли алгоритм создания нового – ранее несуществовавшего? Ответы на них дает авторская методология семиотического дискурсивного моделирования дизайн-продукта (СДМ), которая представляет способ тонкой настройки сознания. Этот курс о том, как дизайнер должен думать и как исполнять свой замысел. В теоретическом блоке основное внимание уделено таким особенностям дизайнерского мышления, как симультанность, нелинейность, способность к «телепортациям» в будущее. В практическом – детально рассмотрены методологические процедуры и действия с указанием на типичные ошибки («ловушки»). Когда научные понятия оказываются бессильны, на помощь приходит поэтический язык. Изложение методологии СДМ сопровождается анализом конкретных примеров, в том числе из дизайнерской практики автора.","tutor":"Лола Галина Николаевна and Александрова Татьяна Игоревна","provider":"Coursera","language":"Russian","skills":["sdm","design methodology","new-moocs-2017"],"subject":"Design \u0026 Creativity","studentsInterested":"26","courseLink":"https://www.coursera.org/learn/dizayn-metodologiya","classCentralLink":"https://www.class-central.com/course/coursera-----design-methodology-inspiration-management-9343"},{"title":"Navigating the Music Business","about":"This course shares practical tips and strategies to help you take your first step into launching your career as a musical artist. We’ll cover everything from developing your unique identity as an artist and how to lead a band all the way to planning and recording your first independent record with the help of crowdfunding.\n\nThe course curriculum is modeled from the real-world experience of Leah Waldo (also known as the emerging country artist, Elisa Smith) and features interviews with industry executives, artists, producers, and engineers — all designed to help you navigate the music industry.","tutor":"Leah Waldo","provider":"Coursera","language":"English","skills":["music industry","independent artists","new-moocs-2017"],"subject":"Music","studentsInterested":"182","courseLink":"https://www.coursera.org/learn/navigate-music-industry-independent-artist","classCentralLink":"https://www.class-central.com/course/coursera-navigating-the-music-business-9576"},{"title":"Digital Skills: User Experience","about":"Discover the basics of user experience\nUser experience, known as UX, makes a huge difference to whether a digital product, or project, succeeds. On this course, you will learn what UX is and why it’s so important. You’ll learn the foundations of UX design and what distinguishes good from bad UX. You will also explore the UX design process; user research, designing your experience, using your goals and ideas to draw wireframes and then building usable prototypes.\nFinally, we will look at the different techniques you can use to test and develop your designs, so that they’re ready to release to the market.\nThis course is for those seeking to develop their entrepreneurial skills, preparing to enter the workplace or looking to change careers. No previous experience or qualifications required.\nInterested in growing your digital skills more widely? Discover more Digital Skills courses from Accenture.","tutor":"Celia Romaniuk","provider":"FutureLearn","language":"English","skills":["design","user experience"],"subject":"Design \u0026 Creativity","studentsInterested":"30","courseLink":"https://www.futurelearn.com/courses/digital-skills-user-experience","classCentralLink":"https://www.class-central.com/course/futurelearn-digital-skills-user-experience-9780"},{"title":"Theatre and Globalization","about":"Learn how theatre and globalization have affected each other over the past century, and how to conduct your own research on global theatre histories.","tutor":"Christopher Balme","provider":"Coursera","language":"English","skills":["europe","germany"],"subject":"Film \u0026 Theatre","studentsInterested":"194","courseLink":"https://www.coursera.org/learn/global-theatre","classCentralLink":"https://www.class-central.com/course/coursera-theatre-and-globalization-2918"},{"title":"Innovar","about":"La innovación ha cobrado una importancia significativa en las corporaciones de hoy, y con frecuencia es vista como un motor importante de crecimiento y éxito en una organización. En este curso introductorio, usted aprenderá sobre el significado, la importancia, el proceso e impacto de la innovación. Aunque la palabra innovación se describe más comúnmente como el proceso de convertir las ideas en productos o servicios que aportan valor al público, la palabra innovación tiene múltiples definiciones, y hablaremos sobre lo que significa en los mundos de negocios, diseño e ingeniería.\n\nAprenderemos sobre un nuevo modelo de innovación llamado Innovación Estratégica Integral, que se puede usar por los individuos y las organizaciones interesadas en generar pensamientos fuera de lo establecido para transformar la forma de pensar de tema de costumbre al pensamiento creativo. Cubriremos en detalle todos los pasos del proceso de innovación. Comenzando con identificar a los problemas que necesitan soluciones innovadoras, investigar y analizar, generar conceptos, seleccionar soluciones prometedoras e implementarlas, hablaremos de una variedad de herramientas que se pueden usar durante cada paso del proceso.\n\nLos aprendices dejarán el curso con un entendimiento profundo de lo que es la innovación y cómo pueden utilizar las herramientas y técnicas de innovación en su propio trabajo.","tutor":"Prasad Boradkar","provider":"Coursera","language":"Spanish","skills":["innovation","strategic innovation","usa","north america"],"subject":"Design \u0026 Creativity","studentsInterested":"22","courseLink":"https://www.coursera.org/learn/innovacion-diseno","classCentralLink":"https://www.class-central.com/course/coursera-innovar-4818"},{"title":"Music and Social Action","about":"What is a musician’s response to the condition of the world? Do musicians have an obligation and an opportunity to serve the needs of the world with their musicianship?\n\nAt a time of crisis for the classical music profession, with a changing commercial landscape, a shrinking audience base, and a contraction in the number of professional orchestras, how does a young musician construct a career today? Are we looking at a dying art form or a moment of reinvigoration?\n\nIn this course we will develop a response to these questions, and we will explore the notion that the classical musician, the artist, is an important public figure with a critical role to play in society.\n\nThe course will include inquiry into a set of ideas in philosophy of aesthetics; a discussion about freedom, civil society, and ways that art can play a role in readying people for democracy; discussion on philosophy of education as it relates to the question of positive social change; and an exploration of musical and artistic initiatives that have been particularly focused on a positive social impact.\n\nGuiding questions for this course inquiry will include:\n\n- How can classical music effect social change?\n- How has music made positive change in communities around the globe?\n- What can the field of classical music learn from other movements for social change?\n- How have educators and philosophers thought about the arts and their connection to daily contemporary life?\n\nEach class will explore one critical question through lectures, discussions, interviews, or documentaries.","tutor":"Sebastian Ruth","provider":"Coursera","language":"English","skills":["classical music","musician","social action","usa","north america"],"subject":"Music","studentsInterested":"537","courseLink":"https://www.coursera.org/learn/music-and-social-action","classCentralLink":"https://www.class-central.com/course/coursera-music-and-social-action-5842"},{"title":"Introduction to User Experience Design","about":"The focus of this course is to introduce the learner to User Experience (UX) Design\n\nUser Experience design is design that is user centered. The goal is to design artifacts that allow the users to meet their needs in the most effective efficient and satisfying manner. The course introduces the novice to a cycle of discovery and evaluation and a set of techniques that meet the user\u0027s needs.\n\nThis course is geared toward the novice. It is for learners that have heard about \"user experience\" or \"user interface\" design but don\u0027t really know much about these disciplines.\n\nThe course mantra is that “Design is a systematic and data driven process.” Design is systematic because it is based on a set of techniques and also on a cycle of discovery.\n\nIn this course the learner is introduced to the four step user interface design cycle. Along the way learners are exposed to a set of techniques to gather information about a) what the user needs b)how to design and model interfaces based on these and then how to evaluate the design to ascertain that the user\u0027s goals are met. These techniques are tools that are used in a standardized manner and give us the data we use in our design.\n\nThis means that anyone (regardless of their current training) that is willing to learn these techniques and follow the proposed cycle can be a UX designer!","tutor":"Dr. Rosa I. Arriaga","provider":"Coursera","language":"English","skills":["ux","user experience","usa","north america"],"subject":"Design \u0026 Creativity","studentsInterested":"218","courseLink":"https://www.coursera.org/learn/user-experience-design","classCentralLink":"https://www.class-central.com/course/coursera-introduction-to-user-experience-design-6535"},{"title":"Art \u0026 Ideas: Teaching with Themes","about":"This course is designed to help build critical skills that support theme-based teaching practices and build confidence in incorporating modern and contemporary art into interdisciplinary lesson plans. By addressing themes and questions that arise in relation to modern and contemporary art, the course will help you to think creatively about links to your curriculum and the ways that you can tap into students’ knowledge and life experience.\n\nIn this course, you will explore four themes that educators at The Museum of Modern Art use frequently in their teaching: Places \u0026 Spaces, Art \u0026 Identity, Transforming Everyday Objects, and Art \u0026 Society. Through videos, slideshows, and a variety of resources, readings, and activities, you will explore the content and context of works of art in MoMA’s collection.\n\nLearners will…\n- Explore works of modern and contemporary art through a variety of themes that relate to classroom content and student experience.\n- Hear directly from artists about their ideas and processes.\n- Learn about the ways that a thematic approach supports interdisciplinary teaching and learning.\n- Gain exposure to a range of digital resources available for teaching with themes and incorporating content around works of art into your classroom.","tutor":"Lisa Mazzola","provider":"Coursera","language":"English","skills":["usa","north america"],"subject":"Art \u0026 Design","studentsInterested":"214","courseLink":"https://www.coursera.org/learn/ideas","classCentralLink":"https://www.class-central.com/course/coursera-art-ideas-teaching-with-themes-6996"},{"title":"Exploring Beethoven’s Piano Sonatas Part 2","about":"Welcome to Part 2 of Exploring Beethoven\u0027s Piano Sonatas!\n\nI\u0027m delighted to launch another set of new lectures of this course as Part 2. As before, this class is meant for people of all levels of experience with Beethoven\u0027s music (including no experience at all!). Remember that you are able to watch the lectures as many times as you like, at whatever pace is comfortable for you.\nAs I’ve done with the first set of Beethoven lectures, I look forward to meeting with students—online and in person, in various cities. The dates and locations will be posted in the Announcements and Events section, as part of the course content. So please remember to check back there for details.\n\nIn these four new lectures, we will explore the following sonatas:\n• Sonata Op. 2, No. 3\n• Sonata Op. 13 (“Pathetique”)\n• Sonata Op. 53 (“Waldstein”)\n• Sonata Op. 90\n\n\nThe Dolfinger-McMahon Foundation supports Curtis’s lifelong learning initiatives.","tutor":"Jonathan Biss","provider":"Coursera","language":"English","skills":["usa","north america","new-moocs-2017"],"subject":"Music","studentsInterested":"481","courseLink":"https://www.coursera.org/learn/exploring-beethoven-piano-sonatas-2","classCentralLink":"https://www.class-central.com/course/coursera-exploring-beethoven-s-piano-sonatas-part-2-7773"},{"title":"Making Meaning: An Introduction to Designing Objects, Part II","about":"Part 2 of Making Meaning: An Introduction to Designing Objects focuses on how design can be progressive, through exploring radical ideas, futuristic aesthetics and by embracing social responsibility. It also looks at the realities of design practice through the eyes of experts in the field. The course begins by showing designers that have done work that is new, and breaks with the conventions of the field. It continues with an examination of how objects capture a sense of “now” by referencing contemporary social, cultural and technological advances. Reflecting on design’s uncomfortable relationship to ethics, the course reveals key ethical dilemmas designers face and helps parse approaches to them. It concludes by examining the working contexts of today’s object designers, how client relationships are formed and maintained and how independent practice can provide a counterpoint to working within corporate structures.","tutor":"Tim Parsons","provider":"Kadenze","language":"English","skills":["design","object design"],"subject":"Art \u0026 Design","studentsInterested":"40","courseLink":"https://www.kadenze.com/courses/making-meaning-an-introduction-to-designing-objects-part-ii","classCentralLink":"https://www.class-central.com/course/kadenze-making-meaning-an-introduction-to-designing-objects-part-ii-10464"},{"title":"Produção final do músico moderno","about":"A indústria musical está passando por enormes mudanças e, por causa disso, os músicos precisam cada vez mais de habilidades em várias e diferentes áreas para ter sucesso. O objetivo da Especialização do Músico Moderno é oferecer aos alunos noções básicas sobre teoria e produção musical e composição e disponibilizar as ferramentas necessárias para escrever e produzir canções originais.\n\nSeguida da conclusão dos três cursos anteriores da Especialização do Músico Moderno, a experiência da produção final é sua chance de usar seu talento e conhecimento acumulado para criar e enviar uma canção acabada, totalmente produzida. Conforme você avançar no módulo, você desenvolverá uma canção e uma ideia para o produto acabado. Depois disso, você planejará e executará a produção, que inclui a gravação, a edição, a mixagem e a publicação do produto acabado. Durante todo o trajeto, você terá um retorno do processo de revisão de pares, permitindo que você faça ajustes e refine sua canção acabada.","tutor":"Pat Pattison, Loudon Stearns and George W. Russell, Jr.","provider":"Coursera","language":"Portuguese","skills":["music production","mixing","new-moocs-2017"],"subject":"Music","studentsInterested":"3","courseLink":"https://www.coursera.org/learn/producao-musico-moderno","classCentralLink":"https://www.class-central.com/course/coursera-producao-final-do-musico-moderno-9584"},{"title":"UX / UI: Fundamentos para o design de interface","about":"Aprenda com uma das maiores startups do Brasil, a Taqtile sobre com criar a melhor experiência para o seu usuário, formas de gerar ideias, princípios básicos de design e como desenvolver interfaces de aplicativos e sites, esse curso introdutório é composto de aulas teóricas com exemplos práticos de aplicação de cada assunto abordado.\n\nNeste curso serão abordados os seguintes temas:\nComo conhecer o seu usuário\nUsabilidade e Prototipação rápida\nArquitetura de informação e wireframe\nPrincípios de design\nAcessibilidade e multi plataforma\nElementos de interface do usuário\nLinguagem da empresa, lidando com o cliente e copyright\nMonitoração, Mensuração e Teste\n\nAo final desse curso, esperamos que você esteja familiarizado com os principais conceitos, ferramentas e metodologias de criação de interfaces e experiência de usuário.\n\nNão deixe de ver as perguntas frequentes antes de se inscrever\n\nConheça os nossos outros cursos:\n- Criação de Startups: Como desenvolver negócios inovadores\nhttps://www.coursera.org/learn/criacao-startups\n- Consolidando empresas: Estrutura jurídica e financeira\nhttps://www.coursera.org/learn/consolidando-empresas\n- Marketing Digital\nhttps://www.coursera.org/learn/estrategia-marketing-digital\n- Inove na gestão de equipes e negócios: o crescimento da empresa\nhttps://www.coursera.org/learn/gestao-equipes-negocios\n- Marketing e vendas B2B: fechando novos negócios\nhttps://www.coursera.org/learn/marketing-vendas-b2b","tutor":"Artur Vilas Boas and André Leme Fleury","provider":"Coursera","language":"Portuguese","skills":["design","ux","ui","prototyping","interfaces"],"subject":"Design \u0026 Creativity","studentsInterested":"47","courseLink":"https://www.coursera.org/learn/ux-ui-design-de-interface","classCentralLink":"https://www.class-central.com/course/coursera-ux-ui-fundamentos-para-o-design-de-interface-10705"},{"title":"Cameras, Exposure, and Photography","about":"Welcome to Course One of Photography Basics and Beyond: From Smartphone to DSLR! In these first 4 Modules you will gain the knowledge and the confidence that will help you make good choices as you consider qualities of the camera you own, and the qualities of the other types of digital cameras you might be considering. You will learn about the basic functions that most digital cameras have in common. You will also go beyond the \"technical\" matters and learn about how you can make exciting pictures by emphasizing the aspects of Frame and Vantage Point to interpret old subjects in new ways. Discovering accessories that photographers find useful, and the types of camera bags from mini to carry-on sized, is also in store for you. You will also make your first photographs and, if you are a subscriber to the specialization, upload pictures to the web gallery and start interacting with your fellow learners in our \"Gallery.\" Let\u0027s get started with Module One!","tutor":"Mark Valentine Sullivan and Peter Glendinning","provider":"Coursera","language":"English","skills":["photography","dslr","smartphone photography","usa","north america"],"subject":"Visual Arts","studentsInterested":"1.5k","courseLink":"https://www.coursera.org/learn/exposure-photography","classCentralLink":"https://www.class-central.com/course/coursera-cameras-exposure-and-photography-5463"},{"title":"Making Meaning: An Introduction to Designing Objects, Part I","about":"Part 1 of Making Meaning: An Introduction to Designing Objects provides an overview of the theories and practices object designers are engaged in today, and how designers use signs, style and utility to generate substance. It also examines the design process in detail, revealing models to help us make sense of its complexity. Starting by illustrating the breadth of the field, the course goes on to explore the power relations and semiotic structures which lie behind object making. It covers how we use objects to express our identity and position ourselves within subcultures, and it analyzes the process of design as it unfolds in the designer’s mind, on paper, through model making, and via other generative “thinking tools”. Incorporating interviews with contemporary professionals the course offers rare insight into the way designers work, the thinking behind their projects, and the methods that lead to successful object-making.","tutor":"Tim Parsons","provider":"Kadenze","language":"English","skills":["object design","new-moocs-2017"],"subject":"Design \u0026 Creativity","studentsInterested":"485","courseLink":"https://www.kadenze.com/courses/making-meaning-an-introduction-to-designing-objects-part-i","classCentralLink":"https://www.class-central.com/course/kadenze-making-meaning-an-introduction-to-designing-objects-part-i-4996"},{"title":"Photography Capstone Project","about":"The Capstone Project is your opportunity to take advantage of the knowledge you have gained through our journey in learning about photography, to develop a meaningful project of 10 well formed photographs based in your passion for artistic expression, or a subject for documentary exploration, insightful portraiture, imaging for work-related subjects, or some other aspect of photography. We are confident that it will be a project that you will be excited to share with fellow Learners, and with Professors Peter Glendinning and Mark Sullivan too! A unique feature of this Course is the individual review and responsive input you will receive directly from Peter or Mark, who will be viewing your pictures and making evaluations of all projects at the end of the Capstone. You should plan on spending more time on this Course per week than any other in this Specialization, and much of it will be in making photographs.\n\nDuring the entire period of development, you and your fellow learners will be supporting each other as you work independently, by sharing your work-in-progress from the initial Project Plan to the final Portfolio. At each stage, all Learners will share comments and suggestions with each other, helping each other to gauge progress and to learn about different approaches to photography and content. By expressing your own ideas and expectations about quality in response to the work of others, you will be forming your own criteria of excellence as well.\n\nAlong the way there will be multiple opportunities for sharing pictures and ideas through carefully designed Peer Review. This sharing of photographs and comments with peers, and reflecting on their comments about your photos, will be an exciting learning experience that will help you grow in understanding your own photography and that of others. Your contribution of comments to fellow Learners will not only help them understand their photographs better, but it will give you an opportunity to use the vocabulary of terms that are related to techniques, design principles, and content approaches that you have learned through your success in each of the previous Modules.\n\nA unique aspect of this Specialization is that everyone who completes the requirements will receive, in addition to their Certificate of Specialization from Michigan State University, access to substantial discounts on equipment, accessories, and membership benefits through Industry Partners from among the premier manufacturers of photography equipment and related items: Fracture, Gary Fong, Gyst, Lensbaby, LensPen, Lume Cube Lighting, Photo District News, PhotoVideoEdu, Think Tank Cases/Bags. In addition, The \u0027top-10\u0027 peer-reviewed Capstone projects each year will be awarded the opportunity for individual reviews, with personal responses, by world renowned photographers who have been honored with the title of Canson-Infinity® Paper Ambassadors.","tutor":"Peter Glendinning","provider":"Coursera","language":"English","skills":["photography","capstone","usa","north america"],"subject":"Visual Arts","studentsInterested":"36","courseLink":"https://www.coursera.org/learn/photography-project","classCentralLink":"https://www.class-central.com/course/coursera-photography-capstone-project-5595"},{"title":"Music Production Capstone","about":"After successfully completing the three prior courses of the Music Production Specialization, this capstone experience is your chance to use your talent and accumulated knowledge to create and submit a finished, fully produced song. As you go through milestones, you will work on your own or with other musicians to develop a song and vision for the finished product. You will then plan and execute its production, including recording, editing, mixing, and posting the finished product. All along the way, you will receive feedback from the peer review process, allowing you to tweak and refine your finished song.","tutor":"Stephen Webber, Chrissy Tignor-Fisher and Loudon Stearns","provider":"Coursera","language":"English","skills":["capstone","music production","usa","north america"],"subject":"Music","studentsInterested":"22","courseLink":"https://www.coursera.org/learn/music-production-capstone","classCentralLink":"https://www.class-central.com/course/coursera-music-production-capstone-6353"},{"title":"Photography Techniques: Light, Content, and Sharing","about":"Welcome to Course FOUR! In Modules 1-4 you will cover the final elements of the Specialization necessary to round out this introduction to the fundamentals of Photography, and prepare you for creating your own exciting project in the Capstone! You have come a long way since the beginning of this journey from Smartphone Basics to DSLR and Beyond. Just think of all the information you have absorbed and put to use in your assignments and quizzes, and the confidence you have gained that you CAN control the camera to make pictures you are proud to share.\n\nHere in Course Four you will start by gaining knowledge related to content in photography, from fact to fiction, documentary to purely expressive. Next you will learn principles, tips, and techniques for using the essential element of Light in Ambient/Natural settings.\n\nThe flash/strobe unit, whether it is built-in to your camera or an add-on \"hotshoe\" model, will finally be something you, not the camera, controls! You will prove to yourself that those former mysteries of Controlled Continuous and Strobe lighting will no longer be mysterious, as you apply your knowledge to creation of assignment photographs in various situations. Sharing those pictures in Peer Review will give you the opportunity to learn from your fellow photographers\u0027 solutions to lighting challenges, and to gain insight into your own work and creative approaches too.\n\nThere is an important word to share about Peer Review assignments for this course. As photographers who have accomplished the quiz and photography requirements of Courses One through Three, you have the knowledge and capability to create quality photographs at a much higher rate of success, and in a much shorter time, than when you began. You have also proven that you are a dedicated Learner, someone who has a passion for photography and is willing to put forth the extra effort necessary to accomplish your goals. This Course is the last before the Capstone Course, in which you will be tasked with creating a project over a 2-month period of dedicated photography. The Peer Review photography assignments have been structured with both your advanced capabilities and dedication in mind...in other words, they will require both! Be prepared to allocate more time than you have in previous Courses for the assignments, because they will take more time and because you will really enjoy them!\n\nCourse Four ends with an overview of methods for finalizing your pictures in print form, including simple but effective matting techniques, and in web page designs as well. The pleasures and perils of sharing in social media sites are also yours to discover. Protecting your copyrights by understanding that concept and the ways that you can assert them, being careful about blogs and other outlets, and recognizing you are part of a community that respects the individual\u0027s creative effort, well that is important knowledge to have in preparation for the Capstone too! Let\u0027s get started with Module One!","tutor":"Peter Glendinning and Mark Valentine Sullivan","provider":"Coursera","language":"English","skills":["usa","north america"],"subject":"Visual Arts","studentsInterested":"404","courseLink":"https://www.coursera.org/learn/photography-techniques","classCentralLink":"https://www.class-central.com/course/coursera-photography-techniques-light-content-and-sharing-6478"},{"title":"Transmedia Storytelling: Narrative worlds, emerging technologies, and global audiences","about":"Transmedia storytelling is the practice of designing, sharing, and participating in a cohesive story experience across multiple traditional and digital delivery platforms - for entertainment, advertising and marketing, or social change.\n\nHave you ever read a book, seen a movie, watched a television show, or played a game that centred around different aspects of a larger story or universe? You may be familiar with popular examples of such universes like Star Wars, Marvel, and The Walking Dead (to name a few).\n\nHow do the professionals develop such expansive narratives? How do they ensure that each element stays true to the original story? How do they innovatively use different technologies to share the stories, grow audiences and create an active and involved community of fans?\n\nMore and more, we are also engaging with elements or franchises of larger and more complex stories across a much more diverse range of platforms like interactive web experiences, social media communities, mobile devices, theme parks, and even augmented and virtual reality. A major challenge that current and future storytellers face is being able to engage different audiences in a story that is seamlessly told across all of these different platforms.\n\n\nWHAT WILL I LEARN?\nThis course will help you to design a strategy for developing and telling your own transmedia story. You will learn about what it takes to:\n• Shape your ideas into compelling and well structured narratives and complex story worlds\n• Identify, understand, and engage different audiences in your stories\n• Create cohesive user experiences across different platforms\n• Evaluate existing and emerging technologies to share your story with the world, and help your audience participate in the larger storyworld you create\n\nThe course provides you with a unique, authentic, and industry relevant learning opportunity. You will have access to current theory, industry examples and advice and undertake learning activities that will equip you with the tools you need to start developing your own ideas.\n\n\nWHO WILL MY INSTRUCTORS BE?\nYou will learn effective transmedia design strategies from leading UNSW Australia Art \u0026 Design academics. You will also examine case studies that demonstrate how amazing ideas, technology and audience contributions can be brought together to create dynamic storyworlds. You\u0027ll see examples of major, successful transmedia storytelling projects involving movies, digital entertainment, gaming, virtual reality and more. In collaboration with our industry partner X Media Lab, the course will give you inside access to the personal stories, insight and advice of the following innovative transmedia storytelling professionals from Hollywood USA, Canada and Australia.\n\n• Susan Bonds, 42 Entertainment, Los Angeles, USA\n• Flint Dille, Screenwriter, Game Designer and Novelist, Los Angeles, USA\n• Cindi Drennan, Illuminart, Australia\n• Tom Ellard, UNSW Art \u0026 Design, Sydney, Australia\n• Catherine Fargher, Dr Egg Digital, Sydney, Australia\n• Hal Hefner, 3AM Creative, USA\n• Brian Seth Hurst, StoryTech, Los Angeles, USA\n• Henry Jenkins, School for Communication and Journalism, University of Southern California, USA\n• Mikey Leung, Digital Storytellers, Sydney, Australia\n• Alex Lieu, 42 Entertainment, Los Angeles, USA\n• Geoffrey Long, Annenberg Innovation Lab, University of Southern California, USA\n• John McGhee, UNSW Art \u0026 Design, Sydney, Australia\n• Joseph Narai, Transmedia Entertainment, Sydney, Australia\n• Jeff Nicholas, The Uprising Creative, Los Angeles, USA\n• Sergio Paez, Graphic Artist working in animation, TV, video games, and film. Co Founder, StoryboardArt, California, USA\n• Steve Peters, No Mimes Media, Los Angeles, USA\n• Stuart Samuels, Stuart Samuels Productions, Toronto, Canada\n• Charles Santoso, Concept Artist, Sydney, Australia\n• Seth Shapiro, New Amsterdam Media, Los Angeles, USA\n• Scott Snibbe, Eyegroove, San Francisco, USA\n• Tracey Taylor, The Pulse, Sydney, Australia\n• Robert Tercek, Public Speaker, Digital Media Strategist, and Executive Leader for Creative Ventures and Business Innovation, • University of Southern California, USA\n• Kevin Williams, Founder \u0026 Director of KWP Ltd and DNA Association, UK\n• Brent Young, Super 78, Los Angeles, USA\n• Maya Zuckerman, Transmedia SF, San Francisco, USA\n\nCOURSE CONTENT DEVELOPMENT\nKarin Watson, Iman Irannejad, and Dr. Simon McIntyre.","tutor":"Geoge Khut, Jeffrey Koh, Emma Robertson, Simon McIntyre and Ollie Bown","provider":"Coursera","language":"English","skills":["australia"],"subject":"Art \u0026 Design","studentsInterested":"156","courseLink":"https://www.coursera.org/learn/transmedia-storytelling","classCentralLink":"https://www.class-central.com/course/coursera-transmedia-storytelling-narrative-worlds-emerging-technologies-and-global-audiences-7173"},{"title":"The Cycle: Management of Successful Arts and Cultural Organizations","about":"What makes a successful arts and cultural organization? Led by DeVos Institute Chairman Michael M. Kaiser and President Brett Egan, this course will introduce you to a management theory called the Cycle which supports thriving arts and cultural organizations. Learning from our work with managers from over 80 countries around the world, the DeVos Institute developed the Cycle as a simple, but powerful tool to assist managers in their effort to respond to an increasingly complex environment and propel their institutions to excellence.\n\nThe Cycle explains how great art and strong marketing can create a family of supporters, who in turn help the organization produce the revenue required to support even more great art the next year. The Institute has seen the Cycle work in performing and presenting organizations, as well as museums, arts schools, and other nonprofit endeavors like service organizations, historical societies, public libraries, university programs, advocacy organizations, botanical gardens, and zoos.\n\nBy taking this course, you will learn:\n\n• the importance of bold, exciting, and mission-driven programming in an organization;\n• how long-term artistic planning can help an organization produce this work;\n• how an organization can aggressively market that programming and the institution behind it to develop a family of supporters - including ticket buyers, board members, donors, trustees and volunteers;\n• how an organization can cultivate and steward this family to build a healthy base of earned and contributed income; and\n• how an organization can reinvest that income into increasingly ambitious programming year after year.\n\nAll course material is available upon enrollment for self-paced learners. New scheduled sessions begin each month.\n\nFor more information about the DeVos Institute\u0027s work, visit www.DeVosInstitute.umd.edu.","tutor":"Michael M. Kaiser and Brett Egan","provider":"Coursera","language":"English","skills":["usa","north america"],"subject":"Art \u0026 Design","studentsInterested":"55","courseLink":"https://www.coursera.org/learn/the-cycle","classCentralLink":"https://www.class-central.com/course/coursera-the-cycle-management-of-successful-arts-and-cultural-organizations-7748"},{"title":"Usos Didácticos del Cine: Introducción al Análisis","about":"¡Hola! Bienvenido al curso MOOC \"Usos Didácticos del Cine: Introducción al Análisis\". A lo largo de este curso, te presentaremos varias formas de usar películas en tus clases para mejorar el rendimiento de tus estudiantes. Además, podrás acceder a una variedad de herramientas y marcos conceptuales referentes a la teoría del cine válidos para poder usar con más conocimientos cualquier obra cinematográfica en el aula.\n\nComencemos con una pregunta: ¿Cómo puede hacer que una película haga que el proceso de enseñanza y aprendizaje sea más efectivo e interesante? Si te has registrado en este curso, probablemente quieras saberlo. Existen numerosas maneras de responder a esta pregunta y las cubriremos durante las próximas semanas. Esperamos que este curso te brinde formas emocionantes de incorporar la película a tu práctica profesional como docente, así como mostrarte otras dimensiones del arte cinematográfico de las que quizás no hayas sido consciente, con formas sencillas de explorarlas y explotarlas en tus lecciones.\n\nNuestros objetivos generales de aprendizaje para las siguientes semanas son:\n\n• Distinguirás algunos elementos básicos del análisis, la forma y el lenguaje cinematográfico a través de explicaciones y ejemplos para utilizarlos en una clase que emplee el cine como recurso didáctico.\n\n• Reconocerás las formas en que el cine de ficción o documental puede apoyar la enseñanza y el aprendizaje para la posterior selección de material audiovisual que contribuya en dichos procesos.\n\n• Diseñarás materiales de aprendizaje efectivos y atractivos con cine mediante la elaboración de un plan de trabajo que permita tener un modelo a partir de las características que poseas de tu grupo.\n\nHemos estructurado el curso en cinco módulos a lo largo de cinco semanas para presentar los principales elementos del arte cinematográfico con relación a la educación.","tutor":"Mario Barro Hernández","provider":"Coursera","language":"Spanish","skills":["cinema","analysis","cinematography"],"subject":"Film \u0026 Theatre","studentsInterested":"7","courseLink":"https://www.coursera.org/learn/usos-didacticos-del-cine","classCentralLink":"https://www.class-central.com/course/coursera-usos-didacticos-del-cine-introduccion-al-analisis-9996"},{"title":"Jazz Improvisation","about":"Learn the basic concepts of improvisation from Gary Burton, one of the most renowned improvisers in the jazz world, including the mental, melodic, and harmonic processes that contribute to the instinctive skills that an improviser puts to use when taking a solo.\n\nWhile many people are fans of jazz and understand that musicians are often “making up” the notes they are playing during a performance, most people—often including musicians, themselves, who are beginning to learn improvising—aren’t clear about what exact processes take place to enable this to happen. The purpose of this course is to introduce the basic concepts of modern improvisation and how to go about mastering the different musical and mental skills involved.\n\nCourse author Gary Burton codifies a sought-after approach to improvisation that has been at the core of Berklee College of Music\u0027s curriculum for decades. Students who complete this course will know what to practice and how to practice the various aspects of improvising, in addition to understanding how the improviser spontaneously communicates to the listeners through their musical creations.","tutor":"Gary Burton","provider":"Coursera","language":"English","skills":["usa","north america"],"subject":"Music","studentsInterested":"2.8k","courseLink":"https://www.coursera.org/learn/jazz-improvisation","classCentralLink":"https://www.class-central.com/course/coursera-jazz-improvisation-521"},{"title":"Scandinavian Film and Television","about":"In many ways Scandinavian film and television is a global cultural brand, connected with and exporting some of the cultural and social values connected to a liberal and progressive welfare society. This course deals with the social, institutional and cultural background of film and television in Scandinavia and in a broader European and global context.","tutor":"Ib Bondebjerg","provider":"Coursera","language":"English","skills":["denmark","north america"],"subject":"Film \u0026 Theatre","studentsInterested":"579","courseLink":"https://www.coursera.org/learn/scandinavian-movies-tv","classCentralLink":"https://www.class-central.com/course/coursera-scandinavian-film-and-television-665"},{"title":"Fundamentals of Post-Production","about":"If the negative comes alive in the darkroom, then a film comes alive in the edit bay. There is a lot an editor must know to keep organized and hold onto the director’s creative vision. In addition, a videographer with knowledge of how the footage will be cut and assembled will be a much stronger shooter. In this class you will jump into the art of editing your work, exploring the tools, workflows and practice of editing.","tutor":"Instructor To Be Announced","provider":"Kadenze","language":"English","skills":["usa","north america"],"subject":"Visual Arts","studentsInterested":"67","courseLink":"https://www.kadenze.com/courses/fundamentals-of-post-production","classCentralLink":"https://www.class-central.com/course/kadenze-fundamentals-of-post-production-7597"},{"title":"Camera Control","about":"Welcome to Course Two of Photography Basics and Beyond: From Smartphone to DSLR! Now that you have a broad understanding of the various types of cameras, the importance of setting up Menus and Functions to gain control in your photography, and the difference between Auto and Program exposure modes, you are ready to move into even greater Camera Control!\n\nIn these 4 Modules we will concentrate on gaining the knowledge necessary to make use of Exposure Modes, Light Metering, Effects of various ISO settings, Lens options, using Shutter Speeds to convey aspects of Time in both documentary and creative ways, and exploring the controlled focus effects that Depth of Field Principles make possible. You will also continue to make new photographs and, if you are a subscriber to the specialization, continue interacting with your fellow learners as you share photographs for Peer Review. You will also confirm your knowledge through completion of quizzes and written responses. Let\u0027s get started with Module One!","tutor":"Mark Valentine Sullivan and Peter Glendinning","provider":"Coursera","language":"English","skills":["photography","dslr","smartphone photography","usa","north america"],"subject":"Visual Arts","studentsInterested":"722","courseLink":"https://www.coursera.org/learn/camera-control","classCentralLink":"https://www.class-central.com/course/coursera-camera-control-5539"},{"title":"编剧：像导演一样编剧","about":"电影编剧不同于文学创作，它意味着要以影像化、动作化的方式赋予故事生命，在这个意义上，编剧不仅是导演，而且还是那个灵动的新世界的创造者。这个世界中的每一个人物命运，每一个起承转合，都表达着创作者对于人性的判断和立场。本课程将通过丰富的案例和针对性的练习，阐述电影编剧的基本步骤、基础知识和内在规律。","tutor":"梁永安, 龚金平 and 许 肖潇","provider":"Coursera","language":"Chinese","skills":["china","asia","screenwriting","micro-film"],"subject":"Film \u0026 Theatre","studentsInterested":"8","courseLink":"https://www.coursera.org/learn/bian-ju","classCentralLink":"https://www.class-central.com/course/coursera---5560"},{"title":"User Research and Design","about":"In this course you will learn and practice techniques of user research and early UI design exploration. First, you will learn and practice several techniques for user research, including in-person research and survey and log-analysis techniques. Then, you will learn to analyze and deliver user research in forms that support UI design, including personas, use cases, tasks, and scenarios. Finally, you will learn and practice ideation techniques that start from user research and broadly generate potential design ideas.","tutor":"Brent Hecht, Haiyi Zhu, Joseph A Konstan, Loren Terveen and Lana Yarosh","provider":"Coursera","language":"English","skills":["usa","north america"],"subject":"Design \u0026 Creativity","studentsInterested":"1.4k","courseLink":"https://www.coursera.org/learn/design-research","classCentralLink":"https://www.class-central.com/course/coursera-user-research-and-design-6924"},{"title":"Getting Started With Music Theory","about":"This course is a brief introduction to the elements of music theory for those with little or no music theory experience. We will explore pitch, rhythm, meter, notation, scales, keys, key signatures, meter signatures, triads, seventh chords, and basic harmony. If you listen to music or play music by ear, and you want to know more about how music is organized and notated, this course is for you.\n\nBy the end of the course, you should know all major and minor keys, how to read and write in treble and bass clef using standard meters and rhythmic values, and how to notate and harmonize a simple melody. This course can serve as a stand-alone basic music theory course, or it can be a springboard to more advanced theory and composition courses.\n\nYour instructor is Bruce Taggart, Associate Professor of Music Theory at Michigan State University, in the College of Music, where he has taught undergraduate and graduate music theory since 1996.","tutor":"Bruce Taggart","provider":"Coursera","language":"English","skills":["usa","north america","new-moocs-2017"],"subject":"Music","studentsInterested":"202","courseLink":"https://www.coursera.org/learn/music-theory","classCentralLink":"https://www.class-central.com/course/coursera-getting-started-with-music-theory-8026"},{"title":"Healing with the Arts","about":"Through art projects—including visual arts, dance, writing, and music—along with spiritual practices and guided imagery, Healing With the Arts gives you the tools to heal what you need to heal in your life: physical, mental, emotional, and spiritual.","tutor":"Mary Rockwood Lane, PhD, RN, FAAN and Michael Samuels, MD","provider":"Coursera","language":"English","skills":["usa","north america","new-moocs-2017"],"subject":"Art \u0026 Design","studentsInterested":"166","courseLink":"https://www.coursera.org/learn/healing-with-the-arts","classCentralLink":"https://www.class-central.com/course/coursera-healing-with-the-arts-8103"},{"title":"Improvisación de jazz","about":"Aprenda los conceptos básicos de la improvisación con Gary Burton, uno de los improvisadores más reconocidos en el mundo del jazz, incluidos los procesos mentales, melódicos y armónicos que contribuyen a las habilidades instintivas que aplica un improvisador cuando realiza un solo.\n\nSi bien a muchas personas les gusta el jazz y entienden que los músicos a veces \"inventan\" las notas que tocan durante una presentación, la mayoría -incluidos los mismos músicos que están aprendiendo a improvisar- no saben con claridad qué procesos específicos se llevan a cabo para que esto suceda. El propósito de este curso es introducir los conceptos básicos de la improvisación moderna y cómo dominar las distintas habilidades musicales y mentales que intervienen.\n\nEl autor del curso Gary Burton codifica un buscado abordaje de la improvisación que constituye el centro del plan de estudios de Berklee College of Music desde hace décadas. Los estudiantes que realicen el curso sabrán qué practicar y cómo practicar los diversos aspectos de la improvisación, además de entender de qué manera el improvisador se comunica espontáneamente con los oyentes a través de sus creaciones musicales.","tutor":"Gary Burton","provider":"Coursera","language":"Spanish","skills":["jazz","improvisation","new-moocs-2017"],"subject":"Music","studentsInterested":"14","courseLink":"https://www.coursera.org/learn/improvisacion-de-jazz","classCentralLink":"https://www.class-central.com/course/coursera-improvisacion-de-jazz-9579"},{"title":"3D CAD Fundamental","about":"There have many three-dimensional shape of the object in your brain that are wanted to share, but do not know how to express? How to \"sketch\" the three-dimensional image in your mind? 3D modeling technology can help us construct the most intuitive and understandable three-dimensional model. The use of floor plan interpret the three-dimensional object process－the most direct and effective expression of our ideas. We have designed many paradigms so that people can quickly understand the logic of using 3D CAD software Sketchup and drawing skills, from introduction to advanced, and introduce SketchUp 3D modeling technologies. After completing \"3D CAD Fundamental\", it is no longer difficult to draw ideas that are beyond imagination with 3D modeling technology! The goal of this course is to construct a three-dimensional model, with the computer as the main teaching material, to enrich the fun paradigm and the complete drawing process. Step-by-step teach you how to use Sketchup\u0027s 3D modeling software technology. With the completion of \"3D CAD Fundamental\", you will be able to realize the 3D objects that exist in the imagination through 3D modeling!","tutor":"康仕仲 (Shih-Chung Jessy Kang)","provider":"Coursera","language":"English","skills":["design","cad","3d models"],"subject":"Digital Media","studentsInterested":"31","courseLink":"https://www.coursera.org/learn/3d-cad-fundamental","classCentralLink":"https://www.class-central.com/course/coursera-3d-cad-fundamental-9997"},{"title":"Fundamentals of Digital Image and Video Processing","about":"In this class you will learn the basic principles and tools used to process images and videos, and how to apply them in solving practical problems of commercial and scientific interests.\n\nDigital images and videos are everywhere these days – in thousands of scientific (e.g., astronomical, bio-medical), consumer, industrial, and artistic applications. Moreover they come in a wide range of the electromagnetic spectrum - from visible light and infrared to gamma rays and beyond. The ability to process image and video signals is therefore an incredibly important skill to master for engineering/science students, software developers, and practicing scientists. Digital image and video processing continues to enable the multimedia technology revolution we are experiencing today. Some important examples of image and video processing include the removal of degradations images suffer during acquisition (e.g., removing blur from a picture of a fast moving car), and the compression and transmission of images and videos (if you watch videos online, or share photos via a social media website, you use this everyday!), for economical storage and efficient transmission.\n\nThis course will cover the fundamentals of image and video processing. We will provide a mathematical framework to describe and analyze images and videos as two- and three-dimensional signals in the spatial, spatio-temporal, and frequency domains. In this class not only will you learn the theory behind fundamental processing tasks including image/video enhancement, recovery, and compression - but you will also learn how to perform these key processing tasks in practice using state-of-the-art techniques and tools. We will introduce and use a wide variety of such tools – from optimization toolboxes to statistical techniques. Emphasis on the special role sparsity plays in modern image and video processing will also be given. In all cases, example images and videos pertaining to specific application domains will be utilized.","tutor":"Aggelos Katsaggelos","provider":"Coursera","language":"English","skills":["usa","north america"],"subject":"Digital Media","studentsInterested":"2.8k","courseLink":"https://www.coursera.org/learn/digital","classCentralLink":"https://www.class-central.com/course/coursera-fundamentals-of-digital-image-and-video-processing-724"},{"title":"User Experience: Research \u0026 Prototyping","about":"What makes for a great user experience? How can you consistently design experiences that work well, are easy to use and people want to use? This course will teach you the core process of experience design and how to effectively evaluate your work with the people for whom you are designing. You\u0027ll learn fundamental methods of design research that will enable you to effectively understand people, the sequences of their actions, and the context in which they work. Through the assignments, you’ll learn practical techniques for making sense of what you see and transform your observations into meaningful actionable insights and unique opportunity areas for design. You’ll also explore how to generate ideas in response to the opportunities identified and learn methods for making your ideas tangible. By answering specific questions and refining your concepts, you’ll move closer to making your ideas real. We’ll use cases from a variety of industries including health, education, transportation, finance, and beyond to illustrate how these methods work across different domains.\n\nGood luck and we hope you enjoy the course!","tutor":"Scott Klemmer and Elizabeth Gerber","provider":"Coursera","language":"English","skills":["usa","north america"],"subject":"Design \u0026 Creativity","studentsInterested":"298","courseLink":"https://www.coursera.org/learn/user-research","classCentralLink":"https://www.class-central.com/course/coursera-user-experience-research-prototyping-2788"},{"title":"Principles of Game Design","about":"You have a great idea for a game. Turning that idea into a reality isn\u0027t just about knowing the tools. In this course you will practice moving from game concept through design documentation, prototyping and testing. Numerous elements go into the overall process of game design. These range from topics such as idea generation, story, character, and game world development, game mechanics and level design, and user experience design. You will explore the process for designing meaningful experiences for your players. At the end of the course learners will have produced a game\u0027s high concept document, one page blueprint, a physical prototype, pitch and supporting design documentation to move from an idea in your head to a fleshed out design, ready for implementation.","tutor":"Brian Winn and Casey O\u0027Donnell","provider":"Coursera","language":"English","skills":["game design","usa","north america"],"subject":"Digital Media","studentsInterested":"306","courseLink":"https://www.coursera.org/learn/gamedesign","classCentralLink":"https://www.class-central.com/course/coursera-principles-of-game-design-4210"},{"title":"The Art of Cinematic Storytelling: First Steps","about":"This course is an introduction to the methods of cinematic storytelling, with an emphasis on visual grammar and techniques. Students will learn story structure, and how to develop written or spoken ideas into a clear dramatic narrative arc, and how to edit and juxtapose images to create a clear and emotionally engaging result. They will also learn how collaboration and the ability to show work in progress, giving and getting notes from peers, make everybody’s work better.","tutor":"Craig Good","provider":"Kadenze","language":"English","skills":["storytelling","cinematic storytelling","new-moocs-2017"],"subject":"Film \u0026 Theatre","studentsInterested":"501","courseLink":"https://www.kadenze.com/courses/the-art-of-cinematic-storytelling-first-steps-i","classCentralLink":"https://www.class-central.com/course/kadenze-the-art-of-cinematic-storytelling-first-steps-6800"},{"title":"Prototyping and Design","about":"In this course you will learn how to design and prototype user interfaces to address the users and tasks identified in user research. Through a series of lectures and exercises, you will learn and practice paper- and other low-fidelity prototyping techniques; you will learn and apply principles from graphic design, including design patterns; you will learn to write a design rationale; and you will learn how to design for specific populations and situations, including principles and practices of accessible design.","tutor":"Brent Hecht, Haiyi Zhu, Joseph A Konstan, Loren Terveen and Lana Yarosh","provider":"Coursera","language":"English","skills":["usa","north america"],"subject":"Design \u0026 Creativity","studentsInterested":"133","courseLink":"https://www.coursera.org/learn/prototyping-design","classCentralLink":"https://www.class-central.com/course/coursera-prototyping-and-design-6932"},{"title":"The Blues: Understanding and Performing an American Art Form","about":"The blues is an American art form and the most important musical form in jazz. Although there are other formal paradigms of the blues, such as 8-bar or 16-bar, this course focuses on different incarnations of the 12-bar blues. There are considerable differences between Early Jazz blues, Swing blues, Bebop blues, Modal blues, and Post Bop blues. Each type has its unique harmonic syntax, melodic vocabulary and, associated with them, improvisational techniques. While other aspects of jazz performance practice have been constantly changing from one stylistic convention to another, the blues has never lost its identity and expressive power, and continues to exert a powerful influence on the harmonic and melodic syntax of jazz.\n\nThis seven-week course explores important aspects of the blues, blues improvisation, basic keyboard textures, jazz harmonic and melodic syntax. Topics include: (1) Blues Progressions; (2) Blues and Other Scales; (3) Improvisational Tools, and others. This course will also cover valuable theoretical concepts enabling the student to master the art of jazz improvisation. Each topic will be introduced from a practical perspective with the clearly stated goal: to improve one’s improvisational skills. Jazz improvisation is rooted in spontaneity, creativity, self-expression and, at the same time, self-control and order. A unique pedagogical approach based on a one-to-one musical interaction conducted with different instrumentalists will help to reinforce many of the concepts introduced in this course and realize its stated objectives.","tutor":"Dariusz Terefenko","provider":"Coursera","language":"English","skills":["jazz","blues","improvisation","usa","north america"],"subject":"Music","studentsInterested":"1.0k","courseLink":"https://www.coursera.org/learn/the-blues","classCentralLink":"https://www.class-central.com/course/coursera-the-blues-understanding-and-performing-an-american-art-form-6026"},{"title":"The Art of Music Production","about":"Explore the art of record production and how to make recordings that other people will love listening to. This course will teach you how to make emotionally moving recordings on almost any recording equipment, including your phone or laptop. The emphasis is on mastering tangible artistic concepts; the gear you use is up to you. You will learn to develop the most important tool in the recording studio: your ears. You will learn to enhance every aspect of your own productions, both sonically and musically, by employing deeper listening skills.\n\nAssignments will include posting your own recordings for peer review, and reviewing your classmates’ work by employing specific tools and strategies. If you use a digital audio workstation to record and mix, that’s great, but as long as you can record into your computer and post an MP3, you can complete the assignments.\n\nAs you learn about the art of record production in this 4-week course, you will also learn about yourself and who you are as an artist and producer. It is not necessary that you read music or play an instrument to take this course.","tutor":"Stephen Webber","provider":"Coursera","language":"English","skills":["music production","usa","north america"],"subject":"Music","studentsInterested":"300","courseLink":"https://www.coursera.org/learn/producing-music","classCentralLink":"https://www.class-central.com/course/coursera-the-art-of-music-production-6350"},{"title":"Musicianship: Chord Charts, Diatonic Chords, and Minor Keys","about":"After a tremendous response from learners on Coursera, Berklee Online has created a Developing Your Musicianship specialization, and this course is the second course in the series. If you have a basic knowledge of music theory or if you have completed Developing Your Musicianship I, this course will continue to help you understand key musical concepts, enabling you to create and perform contemporary music. Taught by Berklee College of Music professor George W. Russell, Jr., the course includes four lessons that delve into the next level of harmony and ear training.\n\nThe course will introduce you to new key signatures, including minor tonalities, and how they are constructed. You will train your ear to hear minor intervals and 7th chords. You will learn how to build 7th chords, and how to build common chord progressions. You will also learn the major pentatonic scale and how to construct melodies using this scale.\n\nThe course culminates with an assignment that asks you to compose and perform an 8-measure composition using popular chord progressions and the Major pentatonic scale. Just like Developing Your Musicianship I, the course is designed to impart the joy of creating music and sharing it with others.","tutor":"George Russell","provider":"Coursera","language":"English","skills":["usa","north america"],"subject":"Music","studentsInterested":"247","courseLink":"https://www.coursera.org/learn/musicianship-chords","classCentralLink":"https://www.class-central.com/course/coursera-musicianship-chord-charts-diatonic-chords-and-minor-keys-7050"},{"title":"Fundamentals of Video Production","about":"This course will teach students the tools and resources necessary to prepare their next film shoot, covering everything from storyboarding to location scouting to the most essential gear used in both the pre-production and production stages.","tutor":"Instructor To Be Announced","provider":"Kadenze","language":"English","skills":["usa","north america"],"subject":"Visual Arts","studentsInterested":"101","courseLink":"https://www.kadenze.com/courses/fundamentals-of-video-production","classCentralLink":"https://www.class-central.com/course/kadenze-fundamentals-of-video-production-7620"},{"title":"Getting Started with Agile and Design Thinking","about":"Discover how to create useful digital products using agile and design thinking.\nDespite everyone’s good intentions, hard work and solid ideas, too many projects end up creating unneeded, unusable, and unsellable products. But, it doesn’t have to be this way. Agile and design thinking offer a different and effective approach to product development, one that results in valuable solutions to meaningful problems.\nIn this course, you’ll learn how to determine what’s valuable to a user early in the process, to frontload value, by focusing your team on testable narratives about the user and creating a strong shared perspective.\nThis course is for people interested in developing digital products, who are using agile methods and have some experience working in the digital space.\nFor people interested in receiving professional development units (PDUs), as a Project Management Institute (PMI®) Registered Education Provider, the University of Virginia Darden School of Business has been approved by PMI to issue 25 PDUs for this course.","tutor":"Alex Cowan","provider":"FutureLearn","language":"English","skills":["design thinking","digital product","agile","new-moocs-2017"],"subject":"Design \u0026 Creativity","studentsInterested":"264","courseLink":"https://www.futurelearn.com/courses/agile-meets-design-thinking","classCentralLink":"https://www.class-central.com/course/futurelearn-getting-started-with-agile-and-design-thinking-9330"},{"title":"North Indian Classical Music III: Performance Practice","about":"A Hindustani Classical Music performance acquires that mystical element mainly due to its improvisational nature. However, the form and structure of a performance is quite well-defined, and followed by all irrespective of the style.\nThis course begins with explaining the structure of the two basic forms most prevalent today, the Khayal for Vocal performance, and the Alaap, Jod, Jhala and Gat for some instruments.\nLater on, the course delves into how a composition is used as a platform to develop and expand on the Raga. Ample demonstration explains how various musical material is created for the purpose, ranging from the slow melodic designs, Alaap, to fast embellishments, the Taan, which become the primary improvisational tools. Lastly, the course also goes on to explain the accompaniment on the harmonium or the sarangi, and the role of the tanpura.\nIn addition to quizzes and assessment exercises, this course uses guided listening sessions to explain the performances, and also contains listening and practice lessons to help students experience more Ragas.\nThis course was developed in collaboration with Ragasphere and practical performance assignments are powered by MusicCritic.","tutor":"Nitin Amin","provider":"Kadenze","language":"English","skills":["classical music","indian","north indian"],"subject":"Music","studentsInterested":"8","courseLink":"https://www.kadenze.com/courses/north-indian-classical-music-iii-performance-practice","classCentralLink":"https://www.class-central.com/course/kadenze-north-indian-classical-music-iii-performance-practice-9993"},{"title":"TCM Presents: MAD ABOUT MUSICALS!","about":"Turner Classic Movies (TCM) and Ball State University invite movie lovers and online learners from around the world to join us for this free, flexible online course, TCM Presents: MAD ABOUT MUSICALS! (#TCMusicals).","tutor":"Vanessa Theme Ament","provider":"Canvas Network","language":"English","skills":["film","hollywood"],"subject":"Film \u0026 Theatre","studentsInterested":"73","courseLink":"https://http://www.canvas.net/browse/bsu/tcm4/courses/mad-about-musicals","classCentralLink":"https://www.class-central.com/course/canvas-network-tcm-presents-mad-about-musicals-10808"},{"title":"Physical Theatre: Exploring the Slap","about":"##\nThis course introduces you to world-renowned Russian director Meyerhold’s technique of biomechanics. It invites you to study and experience first-hand his revolutionary biomechanical étude, ‘The Slap’.\nThrough a mixture of video, animation, discussion forums and practical exercises you will begin to understand Meyerhold’s Russian actor training technique – a two-minute repeatable exercise used to develop balance, awareness and expression. You will be invited to explore your own response to this unique approach to training and will share these responses with your fellow learners.\nThis course is part of the Going to University collection which has been specifically designed for schools and colleges. The course can be used as a teachers’ classroom enrichment resource or can be studied independently by students.","tutor":"Jonathan Pitches","provider":"FutureLearn","language":"English","skills":["europe","uk","meyerhold","biomechanics","the slap"],"subject":"Film \u0026 Theatre","studentsInterested":"150","courseLink":"https://www.futurelearn.com/courses/physical-theatre-exploring-the-slap","classCentralLink":"https://www.class-central.com/course/futurelearn-physical-theatre-exploring-the-slap-6096"},{"title":"Musicianship: Tensions, Harmonic Function, and Modal Interchange","about":"After a tremendous response from learners on Coursera, Berklee Online has created a Developing Your Musicianship specialization, and this course is the third course in the series. If you have a general understanding of music theory or if you have completed Developing Your Musicianship I and II, this course will continue to help you understand musical concepts, enabling you to create and perform contemporary music. Taught by Berklee College of Music professor George W. Russell, Jr., the course includes four lessons that delve into an intermediate level of harmony and ear training.\n\nThe course will introduce you to new key signatures, and explore how they are constructed. You will continue to train your ear, learning to differentiate between the various intervals and chords that were explored in Developing Your Musicianship I and II. You will learn how to borrow chords from parallel tonalities (modal interchange), and how to write more common chord progressions.\n\nThe course culminates with an assignment that asks you to compose and perform a composition using popular chord progressions. As with Developing Your Musicianship I and II, this course is designed to share the joy of creating music.","tutor":"George Russell","provider":"Coursera","language":"English","skills":["usa","north america"],"subject":"Music","studentsInterested":"171","courseLink":"https://www.coursera.org/learn/musicianship-harmony","classCentralLink":"https://www.class-central.com/course/coursera-musicianship-tensions-harmonic-function-and-modal-interchange-7051"},{"title":"Evaluating User Interfaces","about":"In this course you will learn and practice several techniques for user interface evaluation. First we start with techniques that can be applied alone or in a design team, including action analysis, walkthroughs, and heuristic evaluation. Then we move on to user testing, including learning from a series of usability tests carried out in a real usability lab, and techniques to carry out your own tests even without a lab. Finally, we wrap up the discussion of evaluation--and of UI Design in the specialization as a whole--by looking at the question of how to set and measure usability goals, and in turn, when a design is usable enough to release it.","tutor":"Brent Hecht, Haiyi Zhu, Joseph A Konstan, Loren Terveen and Lana Yarosh","provider":"Coursera","language":"English","skills":["usa","north america","new-moocs-2017"],"subject":"Design \u0026 Creativity","studentsInterested":"70","courseLink":"https://www.coursera.org/learn/ui-testing","classCentralLink":"https://www.class-central.com/course/coursera-evaluating-user-interfaces-6926"},{"title":"ART of the MOOC: Activism and Social Movements","about":"This course is for activists, artists, and thinkers who wish to better understand and participate in social change. We will focus on the prolific and exciting overlap between socially engaged art and cultural practices generated by recent social movements around the world. Rather than assess the political efficacy of activities like mourning, listening, organizing, dancing, or partying, the lectures examine such cultural activities next to, and within, contemporary art practice.\n\nIncluded in the course are guest presentations by key artists, activists, and scholars, like: Rebecca Gomperts, Chido Govera, Gulf Labor, Hans Haacke, Sharon Hayes, Jolene Rickard, Gregory Sholette, Joshua Wong, and many more. Designed by artist and Duke professor, Pedro Lasch and co-taught by Creative Time artistic director, Nato Thompson, the course challenges learners to treat the MOOC itself as a social and artistic form. This happens mostly through the practical components, local project productions, global exchanges, and critical feedback.\n\nWhile no prior art making or activist experience is required, projects also offer challenging options for advanced learners.\n\nFor other course offerings or language versions in this series, just search \u0027ART of the MOOC\u0027 inside the Coursera course catalogue.","tutor":"Nato Thompson and Pedro Lasch","provider":"Coursera","language":"English","skills":["usa","north america"],"subject":"Art \u0026 Design","studentsInterested":"101","courseLink":"https://www.coursera.org/learn/activism-social-movements","classCentralLink":"https://www.class-central.com/course/coursera-art-of-the-mooc-activism-and-social-movements-7195"},{"title":"Cultural and creative industries","about":"Main objective of this course is to trace the development of the Cultural and Creative Industries as an idea and as concept and to identify the key points of changes within it in relations with contemporary digital connected world. Another important task of this course is to provide the deep understanding of the difference between cultural and symbolic meaning products (such as films, recorded music, book and periodicals, online media content etc) and other kind of goods.\n\nThis course will help you to:\n- Identify main peculiarities of cultural and symbolic goods in their difference with other branches of economy in terms of production chain, risks, relationship between different stages of production.\n- Be able to analyze cultural products and symbolic goods from the organizational, economic, business model point of view.\n- Be able to invent new business models and analyze cultural products in terms of their productions risk.\n- Be able to analyze cultural policies and creative industries/clusters policies.\n\nMain prerequisite to this course is to be able to produce analytical texts in humanities. Normally the course addresses all students of master level interested in peculiarities of media and cultural economy and management. This course is strongly not recommended for those who:\n- Analyse any market or industry only in microeconomic terms (supply and demand, level of competitions etc). This course is not about market but about peculiarities of symbolic goods;\n- Try to interpret culture only in terms of marketing and management (i.e. culture is considered like a simple good to be sold to the consumer). This course considers it more broadly like a human agency to produce meanings of everyday life. That’s why cultural goods are different and can not be interpreted exclusively in terms of consuming and need more or less state support;\n- Try to interpret culture like pure “art” and consequently are absolutely not preoccupied by organizational aspect of its working.\n\nThis course uses a large number of concepts coming from different fields of science: political economy of communications, cultural studies, sociology etc. Some aspects of the course are commented by known scholars in this field such as David Hesmondhalgh (University of Leeds), Phillipe Bouquillion (University Paris 13 Nord), Bernard Miege (Grenoble Alpes University).","tutor":"Ilia Kiria","provider":"Coursera","language":"English","skills":["culture","creativity"],"subject":"Design \u0026 Creativity","studentsInterested":"36","courseLink":"https://www.coursera.org/learn/cultural-creative-industries","classCentralLink":"https://www.class-central.com/course/coursera-cultural-and-creative-industries-10331"},{"title":"Cracking the Creativity Code: Discovering Ideas","about":"Skill at discovering new ideas, and delivering them, may be one of the most important practical job skills, in today’s and tomorrow’s job market. Creativity is an acquired skill, one that improves with practice. This course aims to empower individuals who believe they have lost their innate creativity, because they, their employers or teachers prefer the three R\u0027s: replication, repetition and rote, to innovation. We show how to re-ignite rusty creative powers.\n\nDuring this course, you will learn proven tools, frameworks and concepts useful for discovery– generating an endless stream of new ideas implementing at least some of those ideas with skill and persistence, based on books and articles written by the instructors.\n\nIn the first part of the course, you will learn a proven structured method for generating and implementing world-changing ideas known as ‘Zoom in, Zoom out, Zoom in’ that makes creativity more accessible to everyone. In the following weeks, you will learn practical proven tools useful for delivering ideas by employing the basic principles of business and management. You will practice the method, use it to tackle challenging real-world needs and produce a 2-3 minutes video presenting your idea.\n\nCourse Learning Outcomes\n\nOn successfully completing this four-week course, you will be able to:\n- Manage a process to generate an unending stream of creative ideas\n- Lead a process of innovation and implement ideas through all phases from discovery to delivery.\n- Apply creativity to a wide range of strategic management issues.\n- Solve problems with a high degree of innovation, creative thinking and risk taking.\n- Use and apply proven structured method for generating and implementing world-changing ideas known as ‘Zoom in, Zoom out, Zoom in’.\n- Develop and implement an innovation in your own practice.\n- Identify new and unfamiliar challenges and reflect on these challenges from a creative point of view, action they require and service they provide.\n- Demonstrate creative problem solving skills for defining, structuring and solving real world operations management problems.","tutor":"Shlomo Maital","provider":"Coursera","language":"English","skills":["creative thinking","asia","israel"],"subject":"Design \u0026 Creativity","studentsInterested":"467","courseLink":"https://www.coursera.org/learn/startup-entrepreneurship-discovering-ideas","classCentralLink":"https://www.class-central.com/course/coursera-cracking-the-creativity-code-discovering-ideas-3497"},{"title":"Explore Animation","about":"##\nWhether you’re a budding animator or a fan of animation who wants to understand more about what happens behind-the-scenes, this free online course from the internationally acclaimed National Film and Television School (NFTS) will have something for you.\nOver four weeks, our team of award-winning animators will take you through their approach to telling stories and demystify their own animation technique.\nEach week, our contributors will use examples from their own work, as well as the animated films that have influenced and inspired them, to enable you to explore different forms of animation:\n1 - Stop motion or stop frame animation.\n2 - 2D or cel animation.\n3 - Big-scale animation in the real world.\n4 - CGI or 3D computer animation.\nThe NFTS has teamed up with Creative Skillset to offer this course. Explore Animation features a number of award-winning short films made by recent graduates of the NFTS, and opportunities for you to try out small-scale animation techniques.\nThis course doesn’t require any existing, specialist animation skills or equipment.\nThere will be opportunities to try out animation techniques using everyday tools and free applications, if you want to enhance your learning experience.","tutor":"Pete Fraser and Jon Wardle","provider":"FutureLearn","language":"English","skills":["europe","animation","2d games","cgi","uk"],"subject":"Digital Media","studentsInterested":"217","courseLink":"https://www.futurelearn.com/courses/explore-animation","classCentralLink":"https://www.class-central.com/course/futurelearn-explore-animation-4849"},{"title":"Introduction to Imagemaking","about":"During this course, we’ll be making exploratory images to expand your visual vocabulary. We\u0027ll create pieces that are expressive, meditative, or \u0027design-y\u0027 to instigate, evoke, experiment, record, explain, or to try out a media. The first two weeks are experimental and exploratory; we won’t be concerned with meaning or communication (although, to be honest, every image does exist in a context, and therefore communicates—or can convey—meaning, connotation, associations, and expressiveness).\n\nIn the second two weeks, we’ll invite the images to deliberately and intentionally carry meaning and communication through relational moves like juxtaposition, composition, and context. Everyone has a natural, intuitive way of putting things together. We’ll look at developing and expanding the range of approaches for putting things together, composing page spreads with your images. Since nothing exists without context, we look at how to intentionally drive the image’s connotations, meanings and associations generated through elements of composition and “visual contrasts.” through style, juxtaposition, closure and figures of speech.\n\nUltimately, we will take the images that you create and make a book from them.","tutor":"Gail Swanlund","provider":"Coursera","language":"English","skills":["image design","usa","north america"],"subject":"Design \u0026 Creativity","studentsInterested":"344","courseLink":"https://www.coursera.org/learn/image-making","classCentralLink":"https://www.class-central.com/course/coursera-introduction-to-imagemaking-5455"},{"title":"Pro Tools Basics","about":"Producing music is an incredibly creative process, and knowing the tools of the trade is essential in order to transmit the musical ideas in your head into the DAW in a creative and uninhibited way. Whether you have used a computer to create music before, or you have been curious about production for years, this 4-week course will give you an introductory look into the world of Avid Pro Tools and Pro Tools First.","tutor":"Chrissy Tignor-Fisher","provider":"Coursera","language":"English","skills":["digital music production","pro tools","usa","north america"],"subject":"Digital Media","studentsInterested":"120","courseLink":"https://www.coursera.org/learn/protools","classCentralLink":"https://www.class-central.com/course/coursera-pro-tools-basics-5436"},{"title":"Principles of Photo Composition and Digital Image Post-Production","about":"Welcome to Course THREE! In the first two Modules you will gain a more professional-level understanding of the Design Elements that artists have used throughout history to create successful compositions. Arranging the Elements in ways that lead viewers through their compositions is an essential craft for photographers no matter whether their subject matter is pure documentary or vividly exotic personal expression. In Modules 3 \u0026 4 we survey the essential elements of post-photography image management, using Adobe(tm) LIGHTROOM(tm). Image adjustment software designed for Smartphone photographers rounds out the Course. Since even photographers whose mainstay is a high-end DSLR also must admit to Smartphone use occasionally, and photographers who only use a Smartphone will usually admit that they want to step over to a \"regular\" camera at some point, there is something for everyone here! Let\u0027s get started with Module One!","tutor":"Mark Valentine Sullivan and Peter Glendinning","provider":"Coursera","language":"English","skills":["design","adobe lightroom","digital photography","usa","north america"],"subject":"Visual Arts","studentsInterested":"558","courseLink":"https://www.coursera.org/learn/photo-composition","classCentralLink":"https://www.class-central.com/course/coursera-principles-of-photo-composition-and-digital-image-post-production-5532"},{"title":"Graphic Design","about":"Visual communication is as critical to professional success as written or oral communication. Graphic design skills will help you ensure that your visual business assets convey a clear and compelling message - and learning the essentials of good design is surprisingly easy.\n\nThis course introduces you to a straightforward design process that emphasizes planning, clarity, and focus. You’ll learn to use contrast, repetition, proximity, and tension to create design that is both credible and visually appealing, and you’ll emulate best practices as you work with examples from a wide range of media. When you complete the course, you’ll have the skills you need to design clear and compelling presentation slides, professional reports, business websites, and more.\n\nAll of the course assignments can be completed with basic presentation software such as Microsoft PowerPoint or Apple Keynote. You’ll have opportunities to work with and explore more sophisticated tools, such as Adobe Photoshop, Illustrator, and InDesign, as well.","tutor":"David Underwood","provider":"Coursera","language":"English","skills":["visual communication","graphic design","usa","north america"],"subject":"Art \u0026 Design","studentsInterested":"956","courseLink":"https://www.coursera.org/learn/presentation-design","classCentralLink":"https://www.class-central.com/course/coursera-graphic-design-6597"},{"title":"Introduction to UI Design","about":"In this course, you will gain an understanding of the critical importance of user interface design. You will also learn industry-standard methods for how to approach the design of a user interface and key theories and frameworks that underlie the design of most interfaces you use today.\n\nThrough a series of case studies on commercial systems - many of which you likely use on a regular basis - we will illustrate the benefits of good design. We will also demonstrate how the costs of bad design can often be severe (in user experience, money, and even human lives).\n\nYou will then gain a high-level understanding of the user-interface design process. You will be introduced to common design scenarios - e.g. improving on existing designs and starting a new design from scratch - and the general design processes that tend to be used for each scenario.\n\nFinally, we will begin introducing the large body of existing knowledge on design by providing overviews of core user interface design theories and concepts. This key foundational information will help you avoid “reinventing the wheel” when you are designing your interfaces in this specialization.","tutor":"Brent Hecht, Haiyi Zhu, Joseph A Konstan, Loren Terveen and Lana Yarosh","provider":"Coursera","language":"English","skills":["usa","north america"],"subject":"Design \u0026 Creativity","studentsInterested":"2.2k","courseLink":"https://www.coursera.org/learn/ui-design","classCentralLink":"https://www.class-central.com/course/coursera-introduction-to-ui-design-6890"},{"title":"¿Cómo (nos) cambia la Tecnología?","about":"La tecnología forma parte de nuestro día a día, es algo tan naturalizado, que muchas veces no somos conscientes de como esto llega a nuestras manos, cuantas personas lo tuvieron antes que nosotros y cuál es el impacto. (Social, Económico, Ambiental y especialmente Cultural) que tiene sobre nuestras vidas.\n\nEste curso tiene como objetivo principal la reflexión del desarrollo tecnológico y su impacto. Con aportes de las ciencias exactas, la literatura y el cine de Ciencia Ficción (SciFi), exploraremos el poder de la Tecnología en la vida diaria, el trabajo, como en la civilización, (re)estableciendo relaciones (re)definiendo el rol que cumplen los artefactos en la vida diaria. Este curso analiza todos los tópicos desde la mirada de los Estudios de Ciencia y Tecnología CTS o STS, en inglés)\n\nLas competencias a desarrollar se centran en la consciencia tecnológica, el razonamiento analítico y crítico y la resolución de problemas y el descubrimiento inductivo de los fenómenos que la tecnología abarca, tanto en la vida profesional como personal del estudiante","tutor":"Martín Pérez","provider":"Coursera","language":"Spanish","skills":["chile","south america"],"subject":"Design \u0026 Creativity","studentsInterested":"14","courseLink":"https://www.coursera.org/learn/comonoscambialatecnologia","classCentralLink":"https://www.class-central.com/course/coursera-como-nos-cambia-la-tecnologia-7110"},{"title":"Making Architecture","about":"Making architecture offers a unique insight into the mind and work of an Architect, starting with the basics of the profession and culminating with the production of a scaled site model. The course should act as ideal preparation for those interested in undertaking an undergraduate degree in Architecture, although its flexible, intriguing and enjoyable content makes it accessible for all those looking to increase their knowledge in the field.\n\nDelivered primarily by Professors from the IE School of Architecture and design in Segovia (Spain), the course begins by examining the mind-set of an Architect - asking how they think and what they do to train their creative minds, moving on to using inspiration from the environment to stimulate design ideas. Finally, the course concludes by looking at some of the more technical aspects of Architecture - such as composition, form, space and hierarchy - and stressing the importance of creating a story that helps define your design.\n\nThis fascinating content is delivered principally from the stunning design studio at the IE school of Architecture and features external videos from a few beautiful locations in the city of Segovia. Finally, it includes interviews from Pritzker Prize executive director - and Dean of the school of Architecture and design at IE - Martha Thorne, with a number of award winning practising architects such as Sarah Wigglesworth and Cristoph Ingenhoven.","tutor":"Nenad Katic, Manuel Perez Romero and David Jeffrey Goodman","provider":"Coursera","language":"English","skills":["spain","europe"],"subject":"Art \u0026 Design","studentsInterested":"154","courseLink":"https://www.coursera.org/learn/making-architecture","classCentralLink":"https://www.class-central.com/course/coursera-making-architecture-7153"},{"title":"ART of the MOOC: Arte Público y Pedagogía","about":"Los alumnos de este curso aprenderán a hacer sus propias obras de arte social y público si así lo desean, o podrán simplemente estudiar la teoría e historia reciente del medio. Diseñado por el artista y profesor de Duke, Pedro Lasch, e impartido con el director artístico de Creative Time, Nato Thompson, este curso presenta el arte y la cultura pública en sus formas contemporáneas radicalmente re-inventadas. Las conferencias enlazan acontecimientos claves de las últimas décadas en este campo con temas más amplios como la política espacial, estructuras sociales cotidianas y la educación experimental.\n\nTambién se incluyen presentaciones de importantes invitados especiales como: Tania Bruguera, Claire Doherty, Tom Finkelpearl, Hans Haacke, Shannon Jackson, Suzanne Lacy, Rick Lowe, y muchos más. Como implica el título del curso, “Arte del MOOC,” el proyecto invita a la comunidad entera de alumnos y participantes a tratar el MOOC en sí mismo como un medio de arte público. Esto sucede sobre todo a través de los componentes prácticos del curso, proyectos producidos localmente, intercambios globales, y los comentarios críticos.\n\nNo se requiere experiencia previa con el arte o el activismo, aunque los proyectos también incluyen buenas opciones para alumnos avanzados.\n\nPara otros cursos en esta serie o versiones en otros idiomas , solo busca \u0027ART of the MOOC\u0027 en el catálogo de Coursera","tutor":"Pedro Lasch and Nato Thompson","provider":"Coursera","language":"Spanish","skills":["usa","north america"],"subject":"Art \u0026 Design","studentsInterested":"13","courseLink":"https://www.coursera.org/learn/arte-publico-pedagogia","classCentralLink":"https://www.class-central.com/course/coursera-art-of-the-mooc-arte-publico-y-pedagogia-7196"},{"title":"The Art of Vocal Production","about":"This course addresses recorded vocal performances and the technologies used to highlight and support them in modern record production and mixes. Most of us know that vocals serve as the focal point of modern recordings but many do not know the tools used or when the tools are used best in modern record production.\n\nThe course begins with simple vocal placement in a mix, where you will also learn the fundamentals of compression and equalization. You’ll further study delays and reverbs before moving to advanced concepts in audio editing, synthetic processing, automatic \u0026 graphic pitch correction, time compression, time expansion, flex and elastic audio.\n\nThrough analysis and/or hands on projects that the students will post for peer review, the student will gain an understanding of the many choices available to modern record producers as they record and mix with a modern tool set. You’ll see, in action, the Vocoder, Auto-Tune, Melodyne, Elastic Audio, Flex Time, VocAlign, tempo based editing and a host of other file modification protocols that are readily available on most Digital Audio Workstations. This course gives students a thorough look at the expanded choices that have risen in the art of vocal production as a result of these modern tools.\n\nThe goal of the course is to help interested novices understand the recordings they are listening to, performers find an expanded language for their recorded voices and for vocal producers to be able to create musically artistic visualizations using singers as their paintbrushes.","tutor":"Prince Charles Alexander","provider":"Coursera","language":"English","skills":["usa","north america"],"subject":"Music","studentsInterested":"182","courseLink":"https://www.coursera.org/learn/vocal-production","classCentralLink":"https://www.class-central.com/course/coursera-the-art-of-vocal-production-7797"},{"title":"A tecnologia da produção musical","about":"Aprenda sobre o processo de produção musical (inclusive sobre gravação, edição e mixagem) e conheça as ferramentas disponíveis para criação de música contemporânea no computador.\n\nDevido à recente disponibilidade de softwares e hardwares de alta qualidade e baixo custo, agora as ferramentas de produção musical estão ao alcance de todos. Os álbuns deixaram de ser criados apenas em estúdios, agora também são criados em quartos. À primeira vista, isso é libertador. Qualquer pessoa pode criar um álbum por um custo bem baixo, basta comprar alguns equipamentos e um pacote de software. Mas, se você for mais a fundo, verá que não é tão fácil assim. É preciso conhecimento, dedicação e criatividade para produzir música.\n\nFornecer conhecimento é o propósito deste curso. Não importa o tipo de música que você está produzindo, há um grande conjunto de ferramentas que você precisará usar. Cada lição deste curso demonstrará um conjunto diferente de ferramentas de produção musical, seguindo vagamente o processo da produção musical de gravar, editar e mixar.\n\nVamos começar com algumas noções sobre a natureza do som e como o percebemos. Em seguida, vamos analisar os componentes necessários para gravar áudio em um computador, para que você compreenda os dispositivos pelos quais o som precisa se deslocar em um processo de produção musical.\n\nDepois de gravado, o som precisa ser organizado em uma linha de tempo, um processo conhecido como edição. A edição nos permite dar a impressão de execuções perfeitas e criar muitos dos sons que ouvimos na música contemporânea. A ferramenta de edição contemporânea é a estação de trabalho de áudio digital (DAW, Digital Audio Workstation), um software que armazena e organiza todos os recursos de um projeto musical. Vamos focar as ferramentas de edição que são essenciais na produção de música contemporânea e que são fornecidas por todas as DAWs.\n\nApós a edição, os sons devem ser combinados ou mixados, por isso vamos analisar a mesa de mixagem, que pode ser um local muito criativo se você souber usá-la. Vamos explorar as funcionalidades básicas das mesas de mixagem em hardware e software, inclusive volume, panning, mudo, solo, barramentos, inserções, envios e submixagens. O processo de mixagem, no entanto, engloba mais ferramentas do que a mesa de mixagem fornece. O som também deve ser processado, ou seja, modificado de modo a fazer com que seu estado gravado se enquadre no contexto da música. Vamos analisar a compressão, a equalização e o retardo, além de examinar os muitos efeitos de áudio que são extensões desses dispositivos e como eles são usados em um contexto musical.\n\nNo fim das contas, o processo de produção musical depende da sua criatividade. A criatividade é um produto da mente, e ela permanece armazenada ali, sem ser expressada, até que as ferramentas certas são usadas da maneira certa para compartilhá-la com o mundo. Se você tem uma ideia em mente, precisará passar por inúmeras etapas, cada uma com uma ferramenta importante, para chegar ao seu público. Traga a dedicação e criatividade para este curso, que ele fornecerá o conhecimento para fazer acontecer.","tutor":"Loudon Stearns","provider":"Coursera","language":"English","skills":["digital music production","music production","new-moocs-2017"],"subject":"Music","studentsInterested":"6","courseLink":"https://www.coursera.org/learn/tecnologia-producao-musical","classCentralLink":"https://www.class-central.com/course/coursera-a-tecnologia-da-producao-musical-9642"},{"title":"Introducción a la producción de música","about":"Aprende sobre el proceso de producción de música -incluyendo la grabación, la edición y la mezcla- y sobre las herramientas disponibles para crear música contemporánea en tu computadora.\n\n\n\nEsta obra fue financiada con una donación del Banco Inter-Americano de Desarrollo con recursos del Fondo Coreano para la Reducción de la Pobreza.\n\nLas opiniones expresadas en esta obra son exclusivamente de los autores y no necesariamente reflejan el punto de vista del Banco Interamericano de Desarrollo, de su Directorio Ejecutivo ni de los países que representa.\n\nEl Banco Interamericano de Desarrollo no garantiza la veracidad de la data incorporada en esta obra.\n\n\n\nPuedes cambiar el idioma en Coursera de inglés al español utilizando la página de ajustes de tu cuenta. Para cambiar los ajustes en tu cuenta de Coursera sigue los siguientes pasos:\n\n1. Ve a coursera.org\n2. En la esquina derecha superior haz click en el pequeño triángulo invertido que está a lado de tu nombre y foto.\n3. Haz click en ‘Settings’.\n4. Selecciona el recuadro debajo de ‘Language’ (idioma), selecciona español y salva los cambios realizados.\n\nCoursera ofrece ayuda financiera a los estudiantes que no pueden pagar los cursos y necesiten de una beca. Los estudiantes con ayuda financiera podrán tener acceso a todo el contenido del curso y completar todo el trabajo requerido para adquirir el Certificado de Coursera. La ayuda financiera solo aplica al curso en el que se aprobó la solicitud de ayuda financiera. Para aplicar haz click en la opción “Learn More and Apply” (aprende mas y aplica) debajo del menú a la izquierda.","tutor":"Loudon Stearns","provider":"Coursera","language":"Spanish","skills":["music production","musical instruments","usa","north america"],"subject":"Music","studentsInterested":"37","courseLink":"https://www.coursera.org/learn/produccion-musical","classCentralLink":"https://www.class-central.com/course/coursera-introduccion-a-la-produccion-de-musica-4624"},{"title":"Composición de canciones","about":"Aprende un proceso eficiente y efectivo para escribir canciones que expresen tus ideas y emociones, incluyendo una gama de herramientas que giren alrededor del concepto de prosodia; la adecuación de letra y música para apoyar tu mensaje subyacente.\n\n\n\nEsta obra fue financiada con una donación del Banco Inter-Americano de Desarrollo con recursos del Fondo Coreano para la Reducción de la Pobreza.\n\nLas opiniones expresadas en esta obra son exclusivamente de los autores y no necesariamente reflejan el punto de vista del Banco Interamericano de Desarrollo, de su Directorio Ejecutivo ni de los países que representa.\n\nEl Banco Interamericano de Desarrollo no garantiza la veracidad de la data incorporada en esta obra.\n\n\n\nPuedes cambiar el idioma en Coursera de inglés al español utilizando la página de ajustes de tu cuenta. Para cambiar los ajustes en tu cuenta de Coursera sigue los siguientes pasos:\n\n1. Ve a coursera.org\n2. En la esquina derecha superior haz click en el pequeño triángulo invertido que está a lado de tu nombre y foto.\n3. Haz click en ‘Settings’.\n4. Selecciona el recuadro debajo de ‘Language’ (idioma), selecciona español y salva los cambios realizados.\n\nCoursera ofrece ayuda financiera a los estudiantes que no pueden pagar los cursos y necesiten de una beca. Los estudiantes con ayuda financiera podrán tener acceso a todo el contenido del curso y completar todo el trabajo requerido para adquirir el Certificado de Coursera. La ayuda financiera solo aplica al curso en el que se aprobó la solicitud de ayuda financiera. Para aplicar haz click en la opción “Learn More and Apply” (aprende mas y aplica) debajo del menú a la izquierda.","tutor":"Pat Pattison","provider":"Coursera","language":"Spanish","skills":["songwriting","usa","north america"],"subject":"Music","studentsInterested":"61","courseLink":"https://www.coursera.org/learn/composicion-canciones","classCentralLink":"https://www.class-central.com/course/coursera-composicion-de-canciones-4871"},{"title":"Ideas from the History of Graphic Design","about":"This condensed survey course focuses on four key periods or themes from the history of design. Together we’ll trace the emergence of design as a recognized practice, why things look the way they do, and how designers approached specific design problems in their work.\n\nEach week, a short quiz will test your knowledge of concepts, and a short reflective assignment will give you the opportunity to analyze the questions designers ask themselves today.\n\nThis is an essential course for emerging designers entering the field, or for students interested in learning more about visual culture and analysis. No previous experience is required.","tutor":"Louise Sandhaus and Lorraine Wild","provider":"Coursera","language":"English","skills":["design","history","graphic design","usa","north america"],"subject":"Art \u0026 Design","studentsInterested":"1.1k","courseLink":"https://www.coursera.org/learn/graphic-design-history","classCentralLink":"https://www.class-central.com/course/coursera-ideas-from-the-history-of-graphic-design-6497"},{"title":"Introducción a la Producción Audiovisual","about":"En este curso revisaremos el lenguaje y herramientas básicas, así como las diferentes etapas del proceso de producción, para crear un proyecto audiovisual.","tutor":"Anais Pereda , Julio César Pérez Navarro and vicente hinojosa alarcon","provider":"Coursera","language":"Spanish","skills":["audio visual","production","new-moocs-2017"],"subject":"Digital Media","studentsInterested":"31","courseLink":"https://www.coursera.org/learn/intro-produccion-audiovisual","classCentralLink":"https://www.class-central.com/course/coursera-introduccion-a-la-produccion-audiovisual-9357"},{"title":"Introdução à Guitarra","about":"Compreenda os fundamentos necessários para começar a tocar guitarra elétrica ou acústica (violão). Você aprenderá uma abordagem fácil para tocar rapidamente, por meio de uma combinação de exploração do instrumento, técnicas de execução e teoria musical básica.\n\nPara estudantes que desejam tocar guitarra acústica ou elétrica há muito tempo, este curso proporcionará acesso fácil aos fundamentos que tornarão isso possível. Ao começar a aprender a tocar guitarra acústica ou elétrica, é importante ter o material apresentado em etapas, de um modo agradável que permita que você compreenda os fundamentos do instrumento e da música. O curso começa de modo simples, com as partes da guitarra, os nomes das cordas, afinação e técnica — seja utilizando os dedos ou a palheta. Depois, explora os fundamentos da teoria musical, com tópicos como escalas, tríades, power chords, digitação e formatos.\n\nAo final deste curso, os estudantes compreenderão a estrutura, as partes e os acessórios do instrumento, além de aspectos de manutenção básica. Os guitarristas aprenderão a execução do instrumento juntamente com opções básicas de amplificação, pedais de efeito e sons. Os estudantes também aprenderão a desenvolver a técnica correta e a aplicar conceitos teóricos à sua execução. Eles adquirirão o conhecimento fundamental necessário para prosseguir em cursos de guitarra mais intermediários.","tutor":"Thaddeus Hogarth","provider":"Coursera","language":"Portuguese","skills":["guitar","instruction","new-moocs-2017"],"subject":"Music","studentsInterested":"9","courseLink":"https://www.coursera.org/learn/intro-guitarra","classCentralLink":"https://www.class-central.com/course/coursera-introducao-a-guitarra-9415"},{"title":"Write Like Mozart: An Introduction to Classical Music Composition","about":"This course introduces students to strategies for style writing of common practice European art music. The issues of harmonic progression, voice leading, and texture are addressed in addition to relevant compositional concepts like repetition, variation, and elaboration. The course aims to offer a creative space even within the restrictions of stylistic emulation.","tutor":"Peter Edwards","provider":"Coursera","language":"English","skills":["asia","singapore"],"subject":"Music","studentsInterested":"1.4k","courseLink":"https://www.coursera.org/learn/classical-composition","classCentralLink":"https://www.class-central.com/course/coursera-write-like-mozart-an-introduction-to-classical-music-composition-735"},{"title":"Inside Opera: Why Does It Matter?","about":"See opera in a new way\nHow does opera work? How has it changed over 400 years? And most importantly, is opera relevant today?\nGet the answers to these questions and more with this course taking you behind opera’s velvet curtain. If you’ve never been to an opera, or assumed it’s not for you, you’ll learn the basics in a new and exciting way. And if you already enjoy opera and want to learn more, this course will enrich your future experiences, helping you to develop a toolkit of operatic concepts to draw on long after you have finished the course.\nNow is your chance to explore this diverse and spectacular art form.\nThe course is for anyone interested in opera and how it works musically and theatrically, whether or not you’ve experienced opera before.","tutor":"Flora Willson","provider":"FutureLearn","language":"English","skills":["new-moocs-2017"],"subject":"Music","studentsInterested":"198","courseLink":"https://www.futurelearn.com/courses/inside-opera","classCentralLink":"https://www.class-central.com/course/futurelearn-inside-opera-why-does-it-matter-8797"},{"title":"Basics of ICT \u0026 Media Design","about":"Brede introductie in het domein van ICT en Media Design aan de Fontys Hogeschool ICT.","tutor":"Frank Roosen and Sebastiaan Lefèvre","provider":"Canvas Network","language":"Dutch","skills":["digital media","ict"],"subject":"Digital Media","studentsInterested":"18","courseLink":"https://http://www.canvas.net/browse/stichting-fontys-hogescholen-nl/courses/ict-media-design","classCentralLink":"https://www.class-central.com/course/canvas-network-basics-of-ict-media-design-11197"},{"title":"Fundamentals of Rehearsing Music Ensembles","about":"Learn and practice the basic principles of running an effective music ensemble rehearsal. Techniques and strategies are applicable to a variety of ensembles, including bands, orchestras, choirs, and chamber groups.","tutor":"Evan Feldman","provider":"Coursera","language":"English","skills":["usa","north america"],"subject":"Music","studentsInterested":"136","courseLink":"https://www.coursera.org/learn/music-ensembles","classCentralLink":"https://www.class-central.com/course/coursera-fundamentals-of-rehearsing-music-ensembles-731"},{"title":"Design Thinking for Innovation","about":"Today innovation is everyone\u0027s business. Whether you are a manager in a global corporation, an entrepreneur starting up, in a government role, or a teacher in an elementary school, everyone is expected to get lean – to do better with less. And that is why we all need design thinking. At every level in every kind of organization, design thinking provides the tools you need to become an innovative thinker and uncover creative opportunities that are there – you\u0027re just not seeing them yet.\n\nIn this course, we provide an overview of design thinking and work with a model containing four key questions and several tools to help you understand design thinking as a problem solving approach. We also look at several stories from different organizations that used design thinking to uncover compelling solutions.","tutor":"Jeanne M. Liedtka","provider":"Coursera","language":"English","skills":["design thinking","problem solving","usa","north america"],"subject":"Design \u0026 Creativity","studentsInterested":"1.4k","courseLink":"https://www.coursera.org/learn/uva-darden-design-thinking-innovation","classCentralLink":"https://www.class-central.com/course/coursera-design-thinking-for-innovation-4842"},{"title":"ART of the MOOC: Activismo y Movimientos Sociales","about":"Este curso es para activistas, artistas y pensadores que deseen entender mejor el cambio social y participar en él. El contenido del curso enfoca en la coincidencia prolífica y emocionante entre el arte socialmente comprometido y prácticas culturales generadas por recientes movimientos sociales en todo el mundo. Más que evaluar la eficacia política de actividades como el luto, la escucha, la organización, el baile, o la fiesta, las conferencias examinan tales actividades culturales al lado y dentro de la práctica artística contemporánea.\n\nEl curso incluye presentaciones de importantes artistas, activistas y académicos invitados como: Rebecca Gomperts, Chido GoVera, Gulf Labor, Hans Haacke, Sharon Hayes, Jolene Rickard, Gregory Sholette, Joshua Wong, y muchos más. Diseñado por el artista y profesor de Duke, Pedro Lasch, e impartido con el director artístico de Creative Time, Nato Thompson, este curso invita a todos los que participan en él a tratar el MOOC en sí mismo como una forma social y artística. Esto sucede sobre todo a través de los componentes prácticos, proyectos producidos localmente, intercambios mundiales, y el comentario crítico.\n\nNo se requiere experiencia previa con el arte o el activismo, aunque los proyectos también incluyen buenas opciones para alumnos avanzados.\n\nPara otros cursos en esta serie o versiones en otros idiomas , solo busca \u0027ART of the MOOC\u0027 en el catálogo de Coursera","tutor":"Nato Thompson and Pedro Lasch","provider":"Coursera","language":"Spanish","skills":["usa","north america"],"subject":"Art \u0026 Design","studentsInterested":"15","courseLink":"https://www.coursera.org/learn/activismo-movimientos-sociales","classCentralLink":"https://www.class-central.com/course/coursera-art-of-the-mooc-activismo-y-movimientos-sociales-7194"},{"title":"Script Writing: Write a Pilot Episode for a TV or Web Series (Project-Centered Course)","about":"What you’ll achieve:\n\nIn this project-centered course*, you will design a series bible and write a complete pilot episode for your own unique television or web series, be it drama or comedy or something in between. You’ll learn to break down the creative process into components, and you’ll discover a structured process that allows you to produce a polished and pitch-ready script in just a few weeks. Completing this project will increase your confidence in your ideas and abilities, and you’ll feel prepared to pitch your first script and get started on your next.\n\nThis is a course designed to tap into your creativity and is based in \"Active Learning\". Most of the actual learning takes place within your own activities - that is, writing! You will learn by doing.\n\n\"Thank you so much for your direct way of teaching this course. It was encouraging for us all to creatively flow and find our own voice in writing and developing our scripts. This aspect was very important to me.\" Ingrid\n\nThe course curriculum is simple: you’ll write, revise your work, and share feedback with your peers.\n\nI am a proponent of Experiential Learning (active learning). My lectures are short (sometimes just two minutes long) and to the point, designed in a step-by-step process essential to your success as a script writer. I will guide you but I won’t \"show\" you how to write. I firmly believe that the only way to become a writer is to write, write, write.\n\n“David\u0027s lecture style for this course is inspired. The videos are succinct and engaging. When I watch the lectures I feel David’s sincere desire for me to create something truly amazing. He is teaching us how to write a script, and he is providing wisdom and tools that will help us do so in a compelling way - by writing; not by watching him talk at us.” - A R Adamson\n\nWhat you’ll need to get started:\n\nTo begin with, any basic word processor will do. During week two, you can choose to download some free scriptwriting software such as Celtx or Trelby or you may choose to purchase Final Draft, or you can continue to use your word processor and do your own script formatting.\n\nLearner Review: \"I am in love with this course. Having never written a script before, or any substantive fiction since college (15 years ago) I had a small idea in my head that has now exploded into something I really believe in. David\u0027s guidance is spot on, he\u0027s his own compelling story teller, he gives you enough, and then you have to figure it out, make it happen, WRITE! WRITE! WRITE! \"\n\n*About Project-Centered Courses: This is a ‘project-centered course’, which means it is designed specifically to help you complete a personally meaningful real-world project, with your instructor and a community of learners with similar goals providing guidance and suggestions along the way. By actively applying new concepts as you learn, you’ll master the course content more efficiently; you’ll also get a head start on using the skills you gain to make positive changes in your life and career. When you complete the course, you’ll have a finished project that you’ll be proud to use and share.\n\nTime: 1-2 hours of study, 30+ hours of active project work","tutor":"David Wheeler","provider":"Coursera","language":"English","skills":["scriptwriting","television series","usa","north america"],"subject":"Film \u0026 Theatre","studentsInterested":"535","courseLink":"https://www.coursera.org/learn/script-writing","classCentralLink":"https://www.class-central.com/course/coursera-script-writing-write-a-pilot-episode-for-a-tv-or-web-series-project-centered-course-5718"}]