[{"title":"Machine Learning","about":"Machine learning is the science of getting computers to act without being explicitly programmed. In the past decade, machine learning has given us self-driving cars, practical speech recognition, effective web search, and a vastly improved understanding of the human genome. Machine learning is so pervasive today that you probably use it dozens of times a day without knowing it. Many researchers also think it is the best way to make progress towards human-level AI. In this class, you will learn about the most effective machine learning techniques, and gain practice implementing them and getting them to work for yourself. More importantly, you\u0027ll learn about not only the theoretical underpinnings of learning, but also gain the practical know-how needed to quickly and powerfully apply these techniques to new problems. Finally, you\u0027ll learn about some of Silicon Valley\u0027s best practices in innovation as it pertains to machine learning and AI.\n\nThis course provides a broad introduction to machine learning, datamining, and statistical pattern recognition. Topics include: (i) Supervised learning (parametric/non-parametric algorithms, support vector machines, kernels, neural networks). (ii) Unsupervised learning (clustering, dimensionality reduction, recommender systems, deep learning). (iii) Best practices in machine learning (bias/variance theory; innovation process in machine learning and AI). The course will also draw from numerous case studies and applications, so that you\u0027ll also learn how to apply learning algorithms to building smart robots (perception, control), text understanding (web search, anti-spam), computer vision, medical informatics, audio, database mining, and other areas.","tutor":"Andrew Ng","provider":"Coursera","language":"English","skills":["big data","machine learning","usa","north america","machine learning core"],"subject":"Machine Learning","studentsInterested":"28.3k","courseLink":"https://www.coursera.org/learn/machine-learning","classCentralLink":"https://www.class-central.com/course/coursera-machine-learning-835"},{"title":"Introduction to Computer Science and Programming Using Python","about":"This course is the first of a two-course sequence: Introduction to Computer Science and Programming Using Python, and Introduction to Computational Thinking and Data Science. Together, they are designed to help people with no prior exposure to computer science or programming learn to think computationally and write programs to tackle useful problems. Some of the people taking the two courses will use them as a stepping stone to more advanced computer science courses, but for many it will be their first and last computer science courses. This run features updated lecture videos, lecture exercises, and problem sets to use the new version of Python 3.5. Even if you took the course with Python 2.7, you will be able to easily transition to Python 3.5 in future courses, or enroll now to refresh your learning.\nSince these courses may be the only formal computer science courses many of the students take, we have chosen to focus on breadth rather than depth. The goal is to provide students with a brief introduction to many topics so they will have an idea of what is possible when they need to think about how to use computation to accomplish some goal later in their career. That said, they are not \"computation appreciation\" courses. They are challenging and rigorous courses in which the students spend a lot of time and effort learning to bend the computer to their will.","tutor":"Ana Bell, Eric Grimson and John Guttag","provider":"edX","language":"English","skills":["mitx"],"subject":"Computer Science","studentsInterested":"8.8k","courseLink":"https://www.edx.org/course/introduction-computer-science-mitx-6-00-1x-11","classCentralLink":"https://www.class-central.com/course/edx-introduction-to-computer-science-and-programming-using-python-1341"},{"title":"Intro to Computer Science","about":"In this introduction to computer programming course, you’ll learn and practice key computer science concepts by building your own versions of popular web applications. You’ll learn Python, a powerful, easy-to-learn, and widely used programming language, and you’ll explore computer science basics, as you build your own search engine and social network.\n\n\nWhy Take This Course?\nYou’ll learn the programming language Python, and you’ll explore foundational concepts in computer science. Most importantly, you’ll start thinking like a software engineer by solving interesting problems (how to build a web crawler or a social network) using computer programming.\nThis course is a first step into the world of computer science, and whether you want to become a software engineer, or collaborate with software engineers, this course is for you. You’ll be prepared for intermediate-level computer science classes when you’ve mastered the concepts covered in this course.\nBuild a Search Engine\nThroughout this course, you’ll build a search engine by learning about and producing key search engine components including a crawler, an index and a page rank algorithm. As you build these pieces, you’ll be learning about and practicing computer science skills that will ready you for intermediate level computer science courses.","tutor":"Sebastian Thrun and David Evans","provider":"Udacity","language":"English","skills":["python","usa","north america"],"subject":"Computer Science","studentsInterested":"9.9k","courseLink":"https://www.udacity.com/course/intro-to-computer-science--cs101","classCentralLink":"https://www.class-central.com/course/udacity-intro-to-computer-science-320"},{"title":"Functional Programming Principles in Scala","about":"Functional programming is becoming increasingly widespread in industry. This trend is driven by the adoption of Scala as the main programming language for many applications. Scala fuses functional and object-oriented programming in a practical package. It interoperates seamlessly with both Java and Javascript. Scala is the implementation language of many important frameworks, including Apache Spark, Kafka, and Akka. It provides the core infrastructure for sites such as Twitter, Tumblr and also Coursera.\n\nIn this course you will discover the elements of the functional programming style and learn how to apply them usefully in your daily programming tasks. You will also develop a solid foundation for reasoning about functional programs, by touching upon proofs of invariants and the tracing of execution symbolically.\n\nThe course is hands on; most units introduce short programs that serve as illustrations of important concepts and invite you to play with them, modifying and improving them. The course is complemented by a series programming projects as homework assignments.\n\nLearning Outcomes. By the end of this course you will be able to:\n\n- understand the principles of functional programming,\n- write purely functional programs, using recursion,\npattern matching, and higher-order functions,\n- combine functional programming with objects and classes,\n- design immutable data structures,\n- reason about properties of functions,\n- understand generic types for functional programs\n\nRecommended background: You should have at least one year programming experience. Proficiency with Java or C# is ideal, but experience with other languages such as C/C++, Python, Javascript or Ruby is also sufficient. You should have some familiarity using the command line.","tutor":"Martin Odersky","provider":"Coursera","language":"English","skills":["europe","scala","switzerland"],"subject":"Computer Science","studentsInterested":"6.6k","courseLink":"https://www.coursera.org/learn/progfun1","classCentralLink":"https://www.class-central.com/course/coursera-functional-programming-principles-in-scala-422"},{"title":"CS50\u0027s Introduction to Computer Science","about":"This is CS50x, Harvard University\u0027s introduction to the intellectual enterprises of computer science and the art of programming for majors and non-majors alike, with or without prior programming experience. An entry-level course taught by David J. Malan, CS50x teaches students how to think algorithmically and solve problems efficiently. Topics include abstraction, algorithms, data structures, encapsulation, resource management, security, software engineering, and web development. Languages include C, Python, SQL, and JavaScript plus CSS and HTML. Problem sets inspired by real-world domains of biology, cryptography, finance, forensics, and gaming. The on-campus version of CS50x, CS50, is Harvard\u0027s largest course.\nStudents who earn a satisfactory score on 9 problem sets (i.e., programming assignments) and a final project are eligible for a certificate. This is a self-paced course–you may take CS50x on your own schedule.\nHarvardX requires individuals who enroll in its courses on edX to abide by the terms of the edX honor code. HarvardX will take appropriate corrective action in response to violations of the edX honor code, which may include dismissal from the HarvardX course; revocation of any certificates received for the HarvardX course; or other remedies as circumstances warrant. No refunds will be issued in the case of corrective action for such violations. Enrollees who are taking HarvardX courses as part of another program will also be governed by the academic policies of those programs.\nHarvardX pursues the science of learning. By registering as an online learner in an HX course, you will also participate in research about learning. Read our research statement to learn more.","tutor":"David J. Malan","provider":"edX","language":"English","skills":["harvardx"],"subject":"Computer Science","studentsInterested":"16.4k","courseLink":"https://www.edx.org/course/cs50s-introduction-computer-science-harvardx-cs50x","classCentralLink":"https://www.class-central.com/course/edx-cs50-s-introduction-to-computer-science-442"},{"title":"Machine Learning for Musicians and Artists","about":"Have you ever wanted to build a new musical instrument that responded to your gestures by making sound? Or create live visuals to accompany a dancer? Or create an interactive art installation that reacts to the movements or actions of an audience? If so, take this course!\nIn this course, students will learn fundamental machine learning techniques that can be used to make sense of human gesture, musical audio, and other real-time data. The focus will be on learning about algorithms, software tools, and best practices that can be immediately employed in creating new real-time systems in the arts.\nSpecific topics of discussion include:\n• What is machine learning?\n• Common types of machine learning for making sense of human actions and sensor data, with a focus on classification, regression, and segmentation\n• The “machine learning pipeline”: understanding how signals, features, algorithms, and models fit together, and how to select and configure each part of this pipeline to get good analysis results\n• Off-the-shelf tools for machine learning (e.g., Wekinator, Weka, GestureFollower)\n• Feature extraction and analysis techniques that are well-suited for music, dance, gaming, and visual art, especially for human motion analysis and audio analysis","tutor":"Rebecca Fiebrink","provider":"Kadenze","language":"English","skills":["machine learning","europe","digital music production","digital art","uk"],"subject":"Machine Learning","studentsInterested":"4.6k","courseLink":"https://www.kadenze.com/courses/machine-learning-for-musicians-and-artists","classCentralLink":"https://www.class-central.com/course/kadenze-machine-learning-for-musicians-and-artists-3768"},{"title":"Algorithms, Part I","about":"This course covers the essential information that every serious programmer needs to know about algorithms and data structures, with emphasis on applications and scientific performance analysis of Java implementations. Part I covers elementary data structures, sorting, and searching algorithms. Part II focuses on graph- and string-processing algorithms.","tutor":"Robert Sedgewick and Kevin Wayne","provider":"Coursera","language":"English","skills":["algorithms","usa","north america","algorithms core"],"subject":"Algorithms and Data Structures","studentsInterested":"9.4k","courseLink":"https://www.coursera.org/learn/algorithms-part1","classCentralLink":"https://www.class-central.com/course/coursera-algorithms-part-i-339"},{"title":"Cryptography I","about":"Cryptography is an indispensable tool for protecting information in computer systems. In this course you will learn the inner workings of cryptographic systems and how to correctly use them in real-world applications. The course begins with a detailed discussion of how two parties who have a shared secret key can communicate securely when a powerful adversary eavesdrops and tampers with traffic. We will examine many deployed protocols and analyze mistakes in existing systems. The second half of the course discusses public-key techniques that let two parties generate a shared secret key. Throughout the course participants will be exposed to many exciting open problems in the field and work on fun (optional) programming projects. In a second course (Crypto II) we will cover more advanced cryptographic tasks such as zero-knowledge, privacy mechanisms, and other forms of encryption.","tutor":"Dan Boneh","provider":"Coursera","language":"English","skills":["usa","north america"],"subject":"Algorithms and Data Structures","studentsInterested":"10.4k","courseLink":"https://www.coursera.org/learn/crypto","classCentralLink":"https://www.class-central.com/course/coursera-cryptography-i-616"},{"title":"Deep Learning","about":"Machine learning is one of the fastest-growing and most exciting fields out there, and deep learning represents its true bleeding edge. In this course, you’ll develop a clear understanding of the motivation for deep learning, and design intelligent systems that learn from complex and/or large-scale datasets.\nWe’ll show you how to train and optimize basic neural networks, convolutional neural networks, and long short term memory networks. Complete learning systems in TensorFlow will be introduced via projects and assignments. You will learn to solve new classes of problems that were once thought prohibitively challenging, and come to better appreciate the complex nature of human intelligence as you solve these same problems effortlessly using deep learning methods.\nWe have developed this course with Vincent Vanhoucke, Principal Scientist at Google, and technical lead in the Google Brain team.\n**Note: This is an intermediate to advanced level course offered as part of the Machine Learning Engineer Nanodegree program. It assumes you have taken a first course in machine learning, and that you are at least familiar with supervised learning methods.\n\n\nWhy Take This Course?\nDeep learning methods are becoming exponentially more important due to their demonstrated success at tackling complex learning problems. At the same time, increasing access to high-performance computing resources and state-of-the-art open-source libraries are making it more and more feasible for enterprises, small firms, and individuals to use these methods.","tutor":"Arpan Chakraborty and Vincent Vanhoucke","provider":"Udacity","language":"English","skills":["machine learning","deep learning","learning systems","neural networks"],"subject":"Deep Learning","studentsInterested":"541","courseLink":"https://www.udacity.com/course/deep-learning--ud730","classCentralLink":"https://www.class-central.com/course/udacity-deep-learning-5681"},{"title":"How to Use Git and GitHub","about":"Effective use of version control is an important and useful skill for any developer working on long-lived (or even medium-lived) projects, especially if more than one developer is involved. This course, built with input from GitHub, will introduce the basics of using version control by focusing on a particular version control system called Git and a collaboration platform called GitHub.\nThis course is part of the Front End and Full Stack Nanodegrees..\n\n\nWhy Take This Course?\nGit is used by many tech companies, and a public GitHub profile serves as a great portfolio for any developer. But more than that, you’ll establish an efficient programming workflow that allows you to:\nKeep track of multiple versions of a file\nTrack bugs by reverting to previous working versions of a file\nSeamlessly collaborate with other developers on a project\nThe use of tools like Git and GitHub is essential for collaborating with other developers in most professional environments.","tutor":"Sarah Spikes and Caroline Buckey","provider":"Udacity","language":"English","skills":["git","github"],"subject":"DevOps","studentsInterested":"5.8k","courseLink":"https://www.udacity.com/course/how-to-use-git-and-github--ud775","classCentralLink":"https://www.class-central.com/course/udacity-how-to-use-git-and-github-2661"},{"title":"Creative Applications of Deep Learning with TensorFlow","about":"This course introduces you to deep learning: the state-of-the-art approach to building artificial intelligence algorithms. We cover the basic components of deep learning, what it means, how it works, and develop code necessary to build various algorithms such as deep convolutional networks, variational autoencoders, generative adversarial networks, and recurrent neural networks. A major focus of this course will be to not only understand how to build the necessary components of these algorithms, but also how to apply them for exploring creative applications. We\u0027ll see how to train a computer to recognize objects in an image and use this knowledge to drive new and interesting behaviors, from understanding the similarities and differences in large datasets and using them to self-organize, to understanding how to infinitely generate entirely new content or match the aesthetics or contents of another image. Deep learning offers enormous potential for creative applications and in this course we interrogate what\u0027s possible. Through practical applications and guided homework assignments, you\u0027ll be expected to create datasets, develop and train neural networks, explore your own media collections using existing state-of-the-art deep nets, synthesize new content from generative algorithms, and understand deep learning\u0027s potential for creating entirely new aesthetics and new ways of interacting with large amounts of data.","tutor":"Parag Mital","provider":"Kadenze","language":"English","skills":[],"subject":"Deep Learning","studentsInterested":"5.7k","courseLink":"https://www.kadenze.com/courses/creative-applications-of-deep-learning-with-tensorflow","classCentralLink":"https://www.class-central.com/course/kadenze-creative-applications-of-deep-learning-with-tensorflow-6679"},{"title":"Functional Program Design in Scala","about":"In this course you will learn how to apply the functional programming style in the design of larger applications. You\u0027ll get to know important new functional programming concepts, from lazy evaluation to structuring your libraries using monads. We\u0027ll work on larger and more involved examples, from state space exploration to random testing to discrete circuit simulators. You’ll also learn some best practices on how to write good Scala code in the real world.\n\nSeveral parts of this course deal with the question how functional programming interacts with mutable state. We will explore the consequences of combining functions and state. We will also look at purely functional alternatives to mutable state, using infinite data structures or functional reactive programming.\n\nLearning Outcomes. By the end of this course you will be able to:\n\n- recognize and apply design principles of functional programs,\n- design functional libraries and their APIs,\n- competently combine functions and state in one program,\n- understand reasoning techniques for programs that combine\nfunctions and state,\n- write simple functional reactive applications.\n\nRecommended background: You should have at least one year programming experience. Proficiency with Java or C# is ideal, but experience with other languages such as C/C++, Python, Javascript or Ruby is also sufficient. You should have some familiarity using the command line. This course is intended to be taken after Functional Programming Principles in Scala: https://www.coursera.org/learn/progfun1.","tutor":"Martin Odersky, Erik Meijer and Roland Kuhn","provider":"Coursera","language":"English","skills":["europe","scala","switzerland"],"subject":"Programming Languages","studentsInterested":"1.9k","courseLink":"https://www.coursera.org/learn/progfun2","classCentralLink":"https://www.class-central.com/course/coursera-functional-program-design-in-scala-1186"},{"title":"Machine Learning Foundations: A Case Study Approach","about":"Do you have data and wonder what it can tell you? Do you need a deeper understanding of the core ways in which machine learning can improve your business? Do you want to be able to converse with specialists about anything from regression and classification to deep learning and recommender systems?\n\nIn this course, you will get hands-on experience with machine learning from a series of practical case-studies. At the end of the first course you will have studied how to predict house prices based on house-level features, analyze sentiment from user reviews, retrieve documents of interest, recommend products, and search for images. Through hands-on practice with these use cases, you will be able to apply machine learning methods in a wide range of domains.\n\nThis first course treats the machine learning method as a black box. Using this abstraction, you will focus on understanding tasks of interest, matching these tasks to machine learning tools, and assessing the quality of the output. In subsequent courses, you will delve into the components of this black box by examining models and algorithms. Together, these pieces form the machine learning pipeline, which you will use in developing intelligent applications.\n\nLearning Outcomes: By the end of this course, you will be able to:\n-Identify potential applications of machine learning in practice.\n-Describe the core differences in analyses enabled by regression, classification, and clustering.\n-Select the appropriate machine learning task for a potential application.\n-Apply regression, classification, clustering, retrieval, recommender systems, and deep learning.\n-Represent your data as features to serve as input to machine learning models.\n-Assess the model quality in terms of relevant error metrics for each task.\n-Utilize a dataset to fit a model to analyze new data.\n-Build an end-to-end application that uses machine learning at its core.\n-Implement these techniques in Python.","tutor":"Carlos Guestrin and Emily Fox","provider":"Coursera","language":"English","skills":["python","usa","north america"],"subject":"Machine Learning","studentsInterested":"898","courseLink":"https://www.coursera.org/learn/ml-foundations","classCentralLink":"https://www.class-central.com/course/coursera-machine-learning-foundations-a-case-study-approach-4352"},{"title":"Internet History, Technology, and Security","about":"The impact of technology and networks on our lives, culture, and society continues to increase. The very fact that you can take this course from anywhere in the world requires a technological infrastructure that was designed, engineered, and built over the past sixty years. To function in an information-centric world, we need to understand the workings of network technology. This course will open up the Internet and show you how it was created, who created it and how it works. Along the way we will meet many of the innovators who developed the Internet and Web technologies that we use today.\n\n\n\n\n\n\nWhat You Will Learn:\nAfter this course you will not take the Internet and Web for granted. You will be better informed about important technological issues currently facing society. You will realize that the Internet and Web are spaces for innovation and you will get a better understanding of how you might fit into that innovation. If you get excited about the material in this course, it is a great lead-in to taking a course in Web design, Web development, programming, or even network administration. At a minimum, you will be a much wiser network citizen.","tutor":"Charles Severance","provider":"Coursera","language":"English","skills":["usa","north america"],"subject":"Computer Science","studentsInterested":"6.2k","courseLink":"https://www.coursera.org/learn/internet-history","classCentralLink":"https://www.class-central.com/course/coursera-internet-history-technology-and-security-335"},{"title":"Introduction to Linux","about":"Develop a good working knowledge of Linux using both the graphical interface and command line, covering the major Linux distribution families.\nLinux powers 94% of the world’s supercomputers, most of the servers powering the Internet, the majority of financial trades worldwide and a billion Android devices. In short, Linux is everywhere. It appears in many different architectures, from mainframes to server to desktop to mobile and on a staggeringly wide variety of hardware.\nMoreover, 97 percent of hiring managers reported that they will prioritize hiring Linux talent relative to other skills areas in the next six months, and 44 percent of hiring managers saying they’re more likely to hire a candidate with Linux certification.\nThis course explores the various tools and techniques commonly used by Linux system administrators and end users to achieve their day-to-day work in a Linux environment. It is designed for experienced computer users who have limited or no previous exposure to Linux, whether they are working in an individual or Enterprise environment.\nUpon completion of this training you should have a good working knowledge of Linux, from both a graphical and command line perspective, allowing you to easily navigate through any of the major Linux distributions. You will be able to continue your progress as either a user, system administrator or developer using the acquired skill set.\nJoin the 250,000+ students who are already enrolled in this course and start your Linux journey.","tutor":"Jerry Cooperstein PhD","provider":"edX","language":"English","skills":["linuxfoundationx"],"subject":"Information Technology","studentsInterested":"2.1k","courseLink":"https://www.edx.org/course/introduction-linux-linuxfoundationx-lfs101x-1","classCentralLink":"https://www.class-central.com/course/edx-introduction-to-linux-1857"},{"title":"Principles of Computing (Part 1)","about":"This two-part course builds upon the programming skills that you learned in our Introduction to Interactive Programming in Python course. We will augment those skills with both important programming practices and critical mathematical problem solving skills. These skills underlie larger scale computational problem solving and programming. The main focus of the class will be programming weekly mini-projects in Python that build upon the mathematical and programming principles that are taught in the class. To keep the class fun and engaging, many of the projects will involve working with strategy-based games.\n\nIn part 1 of this course, the programming aspect of the class will focus on coding standards and testing. The mathematical portion of the class will focus on probability, combinatorics, and counting with an eye towards practical applications of these concepts in Computer Science.\n\nRecommended Background - Students should be comfortable writing small (100+ line) programs in Python using constructs such as lists, dictionaries and classes and also have a high-school math background that includes algebra and pre-calculus.","tutor":"Scott Rixner, Joe Warren and Luay Nakhleh","provider":"Coursera","language":"English","skills":["python","usa","north america"],"subject":"Algorithms and Data Structures","studentsInterested":"7.7k","courseLink":"https://www.coursera.org/learn/principles-of-computing-1","classCentralLink":"https://www.class-central.com/course/coursera-principles-of-computing-part-1-1724"},{"title":"CS188.1x: Artificial Intelligence","about":"Artificial intelligence is already all around you, from web search to video games. AI methods plan your driving directions, filter your spam, and focus your cameras on faces. AI lets you guide your phone with your voice and read foreign newspapers in English. Beyond today\u0027s applications, AI is at the core of many new technologies that will shape our future. From self-driving cars to household robots, advancements in AI help transform science fiction into real systems.\n\nThe course will introduce the basic ideas and techniques underlying the design of intelligent computer systems. CS188.1x focuses on Behavior from Computation and will cover the following areas:\n\nStatistical and decision–theoretic modeling paradigm. By the end of this course, you will have built autonomous agents that efficiently make decisions in stochastic and in adversarial settings.\nReasoning and Learning. With this additional machinery your agents will be able to draw inferences in uncertain environments and optimize actions for arbitrary reward structures. Your machine learning algorithms will classify handwritten digits and photographs.\nApplications for a wide variety of artificial intelligence problems. The techniques you learn in CS188x will serve as the foundation for further study in any application area you choose to pursue.\nJoin us today to learn more about how AI affects your life, and where it is headed in the future.","tutor":"Dan Klein and Pieter Abbeel","provider":"edX","language":"English","skills":["uc berkeleyx","usa","north america"],"subject":"Artificial Intelligence","studentsInterested":"6.1k","courseLink":"https://www.courses.edx.org/courses/BerkeleyX/CS188.1x-4/1T2015/course/","classCentralLink":"https://www.class-central.com/course/edx-cs188-1x-artificial-intelligence-445"},{"title":"Software Security","about":"This course we will explore the foundations of software security. We will consider important software vulnerabilities and attacks that exploit them -- such as buffer overflows, SQL injection, and session hijacking -- and we will consider defenses that prevent or mitigate these attacks, including advanced testing and program analysis techniques. Importantly, we take a \"build security in\" mentality, considering techniques at each phase of the development cycle that can be used to strengthen the security of software systems. Successful learners in this course typically have completed sophomore/junior-level undergraduate work in a technical field, have some familiarity with programming, ideally in C/C++ and one other \"managed\" program language (like ML or Java), and have prior exposure to algorithms. Students not familiar with these languages but with others can improve their skills through online web tutorials.","tutor":"Michael Hicks","provider":"Coursera","language":"English","skills":["usa","north america","computer security core"],"subject":"Cybersecurity","studentsInterested":"7.0k","courseLink":"https://www.coursera.org/learn/software-security","classCentralLink":"https://www.class-central.com/course/coursera-software-security-1728"},{"title":"Practical Machine Learning","about":"One of the most common tasks performed by data scientists and data analysts are prediction and machine learning. This course will cover the basic components of building and applying prediction functions with an emphasis on practical applications. The course will provide basic grounding in concepts such as training and tests sets, overfitting, and error rates. The course will also introduce a range of model based and algorithmic machine learning methods including regression, classification trees, Naive Bayes, and random forests. The course will cover the complete process of building prediction functions including data collection, feature creation, algorithms, and evaluation.","tutor":"Jeff Leek","provider":"Coursera","language":"English","skills":["usa","north america"],"subject":"Machine Learning","studentsInterested":"827","courseLink":"https://www.coursera.org/learn/practical-machine-learning","classCentralLink":"https://www.class-central.com/course/coursera-practical-machine-learning-1719"},{"title":"Build a Modern Computer from First Principles: From Nand to Tetris (Project-Centered Course)","about":"What you’ll achieve:\nIn this project-centered course* you will build a modern computer system, from the ground up. We’ll divide this fascinating journey into six hands-on projects that will take you from constructing elementary logic gates all the way through creating a fully functioning general purpose computer. In the process, you will learn - in the most direct and constructive way - how computers work, and how they are designed.\n\nWhat you’ll need:\nThis is a self-contained course: all the knowledge necessary to succeed in the course and build the computer system will be given as part of the learning experience. Therefore, we assume no previous computer science or engineering knowledge, and all learners are welcome aboard. You will need no physical materials, since you will build the computer on your own PC, using a software-based hardware simulator, just like real computers are designed by computer engineers in the field. The hardware simulator, as well as other software tools, will be supplied freely after you enroll in the course.\n\nCourse format:\nThe course consists of six modules, each comprising a series of video lectures, and a project. You will need about 2-3 hours to watch each module\u0027s lectures, and about 5-10 hours to complete each one of the six projects. The course can be completed in six weeks, but you are welcome to take it at your own pace. You can watch a TED talk about this course by Googling \"nand2tetris TED talk\".\n\n*About Project-Centered Courses: Project-centered courses are designed to help you complete a personally meaningful real-world project, with your instructor and a community of learners with similar goals providing guidance and suggestions along the way. By actively applying new concepts as you learn, you’ll master the course content more efficiently; you’ll also get a head start on using the skills you gain to make positive changes in your life and career. When you complete the course, you’ll have a finished project that you’ll be proud to use and share.","tutor":"Shimon Schocken and Noam Nisan","provider":"Coursera","language":"English","skills":["asia","israel"],"subject":"Computer Science","studentsInterested":"6.7k","courseLink":"https://www.coursera.org/learn/build-a-computer","classCentralLink":"https://www.class-central.com/course/coursera-build-a-modern-computer-from-first-principles-from-nand-to-tetris-project-centered-course-3234"},{"title":"Neural Networks for Machine Learning","about":"Learn about artificial neural networks and how they\u0027re being used for machine learning, as applied to speech and object recognition, image segmentation, modeling language and human motion, etc. We\u0027ll emphasize both the basic algorithms and the practical tricks needed to get them to work well.\n\nThis course contains the same content presented on Coursera beginning in 2013. It is not a continuation or update of the original course. It has been adapted for the new platform.\n\nPlease be advised that the course is suited for an intermediate level learner - comfortable with calculus and with experience programming (Python).","tutor":"Geoffrey Hinton","provider":"Coursera","language":"English","skills":["machine learning","canada","north america"],"subject":"Machine Learning","studentsInterested":"2.5k","courseLink":"https://www.coursera.org/learn/neural-networks","classCentralLink":"https://www.class-central.com/course/coursera-neural-networks-for-machine-learning-398"},{"title":"Algorithms, Part II","about":"This course covers the essential information that every serious programmer needs to know about algorithms and data structures, with emphasis on applications and scientific performance analysis of Java implementations. Part I covers elementary data structures, sorting, and searching algorithms. Part II focuses on graph- and string-processing algorithms.","tutor":"Robert Sedgewick and Kevin Wayne","provider":"Coursera","language":"English","skills":["computer science","algorithms","usa","north america"],"subject":"Algorithms and Data Structures","studentsInterested":"4.4k","courseLink":"https://www.coursera.org/learn/algorithms-part2","classCentralLink":"https://www.class-central.com/course/coursera-algorithms-part-ii-340"},{"title":"Cloud Computing Concepts, Part 1","about":"Cloud computing systems today, whether open-source or used inside companies, are built using a common set of core techniques, algorithms, and design philosophies – all centered around distributed systems. Learn about such fundamental distributed computing \"concepts\" for cloud computing.\n\nSome of these concepts include: clouds, MapReduce, key-value/NoSQL stores, classical distributed algorithms, widely-used distributed algorithms, scalability, trending areas, and much, much more!\n\nKnow how these systems work from the inside out. Get your hands dirty using these concepts with provided homework exercises. In the programming assignments, implement some of these concepts in template code (programs) provided in the C++ programming language. Prior experience with C++ is required.\n\nThe course also features interviews with leading researchers and managers, from both industry and academia.","tutor":"Indranil Gupta","provider":"Coursera","language":"English","skills":["cloud","distributed systems","usa","north america"],"subject":"DevOps","studentsInterested":"445","courseLink":"https://www.coursera.org/learn/cloud-computing","classCentralLink":"https://www.class-central.com/course/coursera-cloud-computing-concepts-part-1-2717"},{"title":"Introduction to Artificial Intelligence","about":"Artificial Intelligence (AI) is a field that has a long history but is still constantly and actively growing and changing. In this course, you’ll learn the basics of modern AI as well as some of the representative applications of AI. Along the way, we also hope to excite you about the numerous applications and huge possibilities in the field of AI, which continues to expand human capability beyond our imagination.\n\n***Note: Parts of this course are featured in the Machine Learning Engineer Nanodegree and the Data Analyst Nanodegree programs. If you are interested in AI, be sure to check out those programs as well!***\n\nWhy Take This Course?\nArtificial Intelligence (AI) technology is increasingly prevalent in our everyday lives. It has uses in a variety of industries from gaming, journalism/media, to finance, as well as in the state-of-the-art research fields from robotics, medical diagnosis, and quantum science. In this course you’ll learn the basics and applications of AI, including: machine learning, probabilistic reasoning, robotics, computer vision, and natural language processing.","tutor":"Sebastian Thrun and Peter Norvig","provider":"Udacity","language":"English","skills":["artificial intelligence","machine learning","usa","north america"],"subject":"Artificial Intelligence","studentsInterested":"5.4k","courseLink":"https://www.coursera.org/learn/how-to-teach-us","classCentralLink":"https://www.class-central.com/course/udacity-introduction-to-artificial-intelligence-301"},{"title":"Algorithmic Toolbox","about":"The course covers basic algorithmic techniques and ideas for computational problems arising frequently in practical applications: sorting and searching, divide and conquer, greedy algorithms, dynamic programming. We will learn a lot of theory: how to sort data and how it helps for searching; how to break a large problem into pieces and solve them recursively; when it makes sense to proceed greedily; how dynamic programming is used in genomic studies. You will practice solving computational problems, designing new algorithms, and implementing solutions efficiently (so that they run in less than a second).","tutor":"Michael Levin, Daniel M Kane, Alexander S. Kulikov, Pavel Pevzner and Neil Rhodes","provider":"Coursera","language":"English","skills":["russia","sorting algorithms","search algorithms","usa","north america"],"subject":"Algorithms and Data Structures","studentsInterested":"244","courseLink":"https://www.coursera.org/learn/algorithmic-toolbox","classCentralLink":"https://www.class-central.com/course/coursera-algorithmic-toolbox-5471"},{"title":"Machine Learning: Regression","about":"Case Study - Predicting Housing Prices\n\nIn our first case study, predicting house prices, you will create models that predict a continuous value (price) from input features (square footage, number of bedrooms and bathrooms,...). This is just one of the many places where regression can be applied. Other applications range from predicting health outcomes in medicine, stock prices in finance, and power usage in high-performance computing, to analyzing which regulators are important for gene expression.\n\nIn this course, you will explore regularized linear regression models for the task of prediction and feature selection. You will be able to handle very large sets of features and select between models of various complexity. You will also analyze the impact of aspects of your data -- such as outliers -- on your selected models and predictions. To fit these models, you will implement optimization algorithms that scale to large datasets.\n\nLearning Outcomes: By the end of this course, you will be able to:\n-Describe the input and output of a regression model.\n-Compare and contrast bias and variance when modeling data.\n-Estimate model parameters using optimization algorithms.\n-Tune parameters with cross validation.\n-Analyze the performance of the model.\n-Describe the notion of sparsity and how LASSO leads to sparse solutions.\n-Deploy methods to select between models.\n-Exploit the model to form predictions.\n-Build a regression model to predict prices using a housing dataset.\n-Implement these techniques in Python.","tutor":"Carlos Guestrin and Emily Fox","provider":"Coursera","language":"English","skills":["python","usa","north america","machine learning core"],"subject":"Machine Learning","studentsInterested":"4.3k","courseLink":"https://www.coursera.org/learn/ml-regression","classCentralLink":"https://www.class-central.com/course/coursera-machine-learning-regression-4289"},{"title":"Principles of Computing (Part 2)","about":"This two-part course introduces the basic mathematical and programming principles that underlie much of Computer Science. Understanding these principles is crucial to the process of creating efficient and well-structured solutions for computational problems. To get hands-on experience working with these concepts, we will use the Python programming language. The main focus of the class will be weekly mini-projects that build upon the mathematical and programming principles that are taught in the class. To keep the class fun and engaging, many of the projects will involve working with strategy-based games.\n\nIn part 2 of this course, the programming portion of the class will focus on concepts such as recursion, assertions, and invariants. The mathematical portion of the class will focus on searching, sorting, and recursive data structures. Upon completing this course, you will have a solid foundation in the principles of computation and programming. This will prepare you for the next course in the specialization, which will begin to introduce a structured approach to developing and analyzing algorithms. Developing such algorithmic thinking skills will be critical to writing large scale software and solving real world computational problems.","tutor":"Scott Rixner, Joe Warren and Luay Nakhleh","provider":"Coursera","language":"English","skills":["python","usa","north america"],"subject":"Algorithms and Data Structures","studentsInterested":"2.5k","courseLink":"https://www.coursera.org/learn/principles-of-computing-2","classCentralLink":"https://www.class-central.com/course/coursera-principles-of-computing-part-2-3198"},{"title":"Bitcoin and Cryptocurrency Technologies","about":"To really understand what is special about Bitcoin, we need to understand how it works at a technical level. We’ll address the important questions about Bitcoin, such as:\n\nHow does Bitcoin work? What makes Bitcoin different? How secure are your Bitcoins? How anonymous are Bitcoin users? What determines the price of Bitcoins? Can cryptocurrencies be regulated? What might the future hold?\n\nAfter this course, you’ll know everything you need to be able to separate fact from fiction when reading claims about Bitcoin and other cryptocurrencies. You’ll have the conceptual foundations you need to engineer secure software that interacts with the Bitcoin network. And you’ll be able to integrate ideas from Bitcoin in your own projects.\n\nCourse Lecturers:\nArvind Narayanan, Princeton University","tutor":"Arvind Narayanan","provider":"Coursera","language":"English","skills":["cryptography","bitcoin","cryptocurrency","usa","north america"],"subject":"Algorithms and Data Structures","studentsInterested":"6.0k","courseLink":"https://www.coursera.org/learn/cryptocurrency","classCentralLink":"https://www.class-central.com/course/coursera-bitcoin-and-cryptocurrency-technologies-3655"},{"title":"Algorithmic Thinking (Part 1)","about":"Experienced Computer Scientists analyze and solve computational problems at a level of abstraction that is beyond that of any particular programming language. This two-part course builds on the principles that you learned in our Principles of Computing course and is designed to train students in the mathematical concepts and process of \"Algorithmic Thinking\", allowing them to build simpler, more efficient solutions to real-world computational problems.\n\nIn part 1 of this course, we will study the notion of algorithmic efficiency and consider its application to several problems from graph theory. As the central part of the course, students will implement several important graph algorithms in Python and then use these algorithms to analyze two large real-world data sets. The main focus of these tasks is to understand interaction between the algorithms and the structure of the data sets being analyzed by these algorithms.\n\nRecommended Background - Students should be comfortable writing intermediate size (300+ line) programs in Python and have a basic understanding of searching, sorting, and recursion. Students should also have a solid math background that includes algebra, pre-calculus and a familiarity with the math concepts covered in \"Principles of Computing\".","tutor":"Luay Nakhleh, Scott Rixner and Joe Warren","provider":"Coursera","language":"English","skills":["python","usa","north america"],"subject":"Algorithms and Data Structures","studentsInterested":"1.8k","courseLink":"https://www.coursera.org/learn/algorithmic-thinking-1","classCentralLink":"https://www.class-central.com/course/coursera-algorithmic-thinking-part-1-1725"},{"title":"Probabilistic Graphical Models 1: Representation","about":"Probabilistic graphical models (PGMs) are a rich framework for encoding probability distributions over complex domains: joint (multivariate) distributions over large numbers of random variables that interact with each other. These representations sit at the intersection of statistics and computer science, relying on concepts from probability theory, graph algorithms, machine learning, and more. They are the basis for the state-of-the-art methods in a wide variety of applications, such as medical diagnosis, image understanding, speech recognition, natural language processing, and many, many more. They are also a foundational tool in formulating many machine learning problems.\n\nThis course is the first in a sequence of three. It describes the two basic PGM representations: Bayesian Networks, which rely on a directed graph; and Markov networks, which use an undirected graph. The course discusses both the theoretical properties of these representations as well as their use in practice. The (highly recommended) honors track contains several hands-on assignments on how to represent some real-world problems. The course also presents some important extensions beyond the basic PGM representation, which allow more complex models to be encoded compactly.","tutor":"Daphne Koller","provider":"Coursera","language":"English","skills":["usa","north america"],"subject":"Artificial Intelligence","studentsInterested":"715","courseLink":"https://www.coursera.org/learn/probabilistic-graphical-models","classCentralLink":"https://www.class-central.com/course/coursera-probabilistic-graphical-models-1-representation-309"},{"title":"Intro to Machine Learning","about":"Machine Learning is a first-class ticket to the most exciting careers in data analysis today. As data sources proliferate along with the computing power to process them, going straight to the data is one of the most straightforward ways to quickly gain insights and make predictions.\nMachine learning brings together computer science and statistics to harness that predictive power. It’s a must-have skill for all aspiring data analysts and data scientists, or anyone else who wants to wrestle all that raw data into refined trends and predictions.\nThis is a class that will teach you the end-to-end process of investigating data through a machine learning lens. It will teach you how to extract and identify useful features that best represent your data, a few of the most important machine learning algorithms, and how to evaluate the performance of your machine learning algorithms.\nThis course is also a part of our Data Analyst Nanodegree.\n\n\nWhy Take This Course?\nIn this course, you’ll learn by doing! We’ll bring machine learning to life by showing you fascinating use cases and tackling interesting real-world problems like self-driving cars. For your final project you’ll mine the email inboxes and financial data of Enron to identify persons of interest in one of the greatest corporate fraud cases in American history.","tutor":"Sebastian Thrun","provider":"Udacity","language":"English","skills":["artificial intelligence","machine learning","usa","north america"],"subject":"Machine Learning","studentsInterested":"900","courseLink":"https://www.udacity.com/course/intro-to-machine-learning--ud120","classCentralLink":"https://www.class-central.com/course/udacity-intro-to-machine-learning-2996"},{"title":"Automata Theory","about":"I am pleased to be able to offer free over the Internet a course on Automata Theory, based on the material I have taught periodically at Stanford in the course CS154. Participants have access to screencast lecture videos, are given quiz questions, assignments and exams, receive regular feedback on progress, and can participate in a discussion forum. Those who successfully complete the course will receive a statement of accomplishment. You will need a decent Internet connection for accessing course materials, but should be able to watch the videos on your smartphone.\nThe course covers four broad areas: (1) Finite automata and regular expressions, (2) Context-free grammars, (3) Turing machines and decidability, and (4) the theory of intractability, or NP-complete problems.\n\nWhy Study Automata Theory?\n\nThis subject is not just for those planning to enter the field of complexity theory, although it is a good place to start if that is your goal. Rather, the course will emphasize those aspects of the theory that people really use in practice. Finite automata, regular expressions, and context-free grammars are ideas that have stood the test of time. They are essential tools for compilers. But more importantly, they are used in many systems that require input that is less general than a full programming language yet more complex than \"push this button.\"\n\nThe concepts of undecidable problems and intractable problems serve a different purpose. Undecidable problems are those for which no computer solution can ever exist, while intractable problems are those for which there is strong evidence that, although they can be solved by a computer, they cannot be solved sufficiently fast that the solution is truly useful in practice. Understanding this theory, and in particular being able to prove that a problem you are facing belongs to one of these classes, allows you to justify taking another approach — simplifying the problem or writing code to approximate the solution, for example.\n\nDuring the course, I\u0027m going to prove a number of things. The purpose of these proofs is not to torture you or confuse you. Neither are the proofs there because I doubt you would believe me were I merely to state some well-known fact. Rather, understanding how these proofs, especially inductive proofs, work, lets you think more clearly about your own work. I do not advocate proofs that programs are correct, but whenever you attempt something a bit complex, it is good to have in mind the inductive proofs that would be needed to guarantee that what you are doing really works in all cases.","tutor":"Jeffrey Ullman","provider":"Stanford OpenEdx","language":"English","skills":["usa","north america"],"subject":"Algorithms and Data Structures","studentsInterested":"587","courseLink":"https://online.stanford.edu/courses/soe-ycsautomata-automata-theory","classCentralLink":"https://www.class-central.com/course/stanford-openedx-automata-theory-376"},{"title":"Text Retrieval and Search Engines","about":"Recent years have seen a dramatic growth of natural language text data, including web pages, news articles, scientific literature, emails, enterprise documents, and social media such as blog articles, forum posts, product reviews, and tweets. Text data are unique in that they are usually generated directly by humans rather than a computer system or sensors, and are thus especially valuable for discovering knowledge about people’s opinions and preferences, in addition to many other kinds of knowledge that we encode in text.\n\nThis course will cover search engine technologies, which play an important role in any data mining applications involving text data for two reasons. First, while the raw data may be large for any particular problem, it is often a relatively small subset of the data that are relevant, and a search engine is an essential tool for quickly discovering a small subset of relevant text data in a large text collection. Second, search engines are needed to help analysts interpret any patterns discovered in the data by allowing them to examine the relevant original text data to make sense of any discovered pattern. You will learn the basic concepts, principles, and the major techniques in text retrieval, which is the underlying science of search engines.","tutor":"ChengXiang Zhai","provider":"Coursera","language":"English","skills":["usa","north america"],"subject":"Algorithms and Data Structures","studentsInterested":"299","courseLink":"https://www.coursera.org/learn/text-retrieval","classCentralLink":"https://www.class-central.com/course/coursera-text-retrieval-and-search-engines-2734"},{"title":"Machine Learning With Big Data","about":"Want to make sense of the volumes of data you have collected? Need to incorporate data-driven decisions into your process? This course provides an overview of machine learning techniques to explore, analyze, and leverage data. You will be introduced to tools and algorithms you can use to create machine learning models that learn from data, and to scale those models up to big data problems.\n\nAt the end of the course, you will be able to:\n• Design an approach to leverage data using the steps in the machine learning process.\n• Apply machine learning techniques to explore and prepare data for modeling.\n• Identify the type of machine learning problem in order to apply the appropriate set of techniques.\n• Construct models that learn from data using widely available open source tools.\n• Analyze big data problems using scalable machine learning algorithms on Spark.","tutor":"Paul Rodriguez, Natasha Balac and Andrea Zonca","provider":"Coursera","language":"English","skills":["big data","machine learning","usa","north america"],"subject":"Machine Learning","studentsInterested":"263","courseLink":"https://www.coursera.org/learn/big-data-machine-learning","classCentralLink":"https://www.class-central.com/course/coursera-machine-learning-with-big-data-4238"},{"title":"Introduction to Cyber Security","about":"##\nThis online course will help you understand online security and protect your digital life, whether at home or work.\nGuided by Cory Doctorow, you will learn how to recognise threats that could harm you online and take steps to reduce the chances that they happen to you.\nThe course will frame your online safety in the context of the wider world, introducing concepts like malware, viruses, trojans, network security, cryptography, identity theft and risk management.\nThe course was supported by the UK Government’s National Cyber Security Programme, is GCHQ Certified Training and IISP accredited.\nThe course does not assume any prior knowledge of computer security and can be enjoyed by anyone interested in improving the security of their digital information.","tutor":"Arosha K. Bandara","provider":"FutureLearn","language":"English","skills":["europe","security","cyber security","uk"],"subject":"Cybersecurity","studentsInterested":"3.0k","courseLink":"https://www.futurelearn.com/courses/introduction-to-cyber-security","classCentralLink":"https://www.class-central.com/course/futurelearn-introduction-to-cyber-security-2448"},{"title":"The Arduino Platform and C Programming","about":"The Arduino is an open-source computer hardware/software platform for building digital devices and interactive objects that can sense and control the physical world around them. In this class you will learn how the Arduino platform works in terms of the physical board and libraries and the IDE (integrated development environment). You will also learn about shields, which are smaller boards that plug into the main Arduino board to perform other functions such as sensing light, heat, GPS tracking, or providing a user interface display. The course will also cover programming the Arduino using C code and accessing the pins on the board via the software to control external devices. Please note that this course does not include discussion forums.\n\nUpon completing this course, you will be able to:\n1. Outline the composition of the Arduino development board\n2. Describe what it means to program the board\u0027s firmware\n3. Read board schematics\n4. Install Arduino IDE\n5. Describe what \"shields\" are and how they are used\n6. Specify the role of libraries in the use of shields\n7. Compile and run a program\n8. Name C Variables and Types\n9. Name common C operators\n10. Use conditionals and loops\n11. Explain functions, their definition and invocation\n12. Explain the implications of global variables\n13. Undertake the Arduino build process\n14. Describe the role of the tools behind the IDE\n15. Describe how to invoke functions in classes\n16. Explain the structure of an Arduino sketch\n17. Access the pins of the Arduino\n18. Differentiate between digital and analog pin\n19. Debug embedded software\n20. Explain the importance of controllability and observability in the debugging process\n21. Describe common debugging architectures for embedded systems\n22. Explain how the UART Serial communication protocol works\n23. Describe how the Arduino Serial library performs serial communication","tutor":"Ian Harris","provider":"Coursera","language":"English","skills":["arduino","c programming","usa","north america"],"subject":"Internet of Things","studentsInterested":"278","courseLink":"https://www.coursera.org/learn/arduino-platform","classCentralLink":"https://www.class-central.com/course/coursera-the-arduino-platform-and-c-programming-4206"},{"title":"Discrete Optimization","about":"Tired of solving Sudokus by hand? This class teaches you how to solve complex search problems with discrete optimization concepts and algorithms, including constraint programming, local search, and mixed-integer programming.\n\nOptimization technology is ubiquitous in our society. It schedules planes and their crews, coordinates the production of steel, and organizes the transportation of iron ore from the mines to the ports. Optimization clears the day-ahead and real-time markets to deliver electricity to millions of people. It organizes kidney exchanges and cancer treatments and helps scientists understand the fundamental fabric of life, control complex chemical reactions, and design drugs that may benefit billions of individuals.\n\nThis class is an introduction to discrete optimization and exposes students to some of the most fundamental concepts and algorithms in the field. It covers constraint programming, local search, and mixed-integer programming from their foundations to their applications for complex practical problems in areas such as scheduling, vehicle routing, supply-chain optimization, and resource allocation.","tutor":"Professor Pascal Van Hentenryck","provider":"Coursera","language":"English","skills":["australia"],"subject":"Algorithms and Data Structures","studentsInterested":"1.4k","courseLink":"https://www.coursera.org/learn/discrete-optimization","classCentralLink":"https://www.class-central.com/course/coursera-discrete-optimization-487"},{"title":"Computer Science 101","about":"CS101 teaches the essential ideas of Computer Science for a zero-prior-experience audience. Computers can appear very complicated, but in reality, computers work within just a few, simple patterns. CS101 demystifies and brings those patterns to life, which is useful for anyone using computers today.\nIn CS101, students play and experiment with short bits of \"computer code\" to bring to life to the power and limitations of computers. Everything works within the browser, so there is no extra software to download or install. CS101 also provides a general background on computers today: what is a computer, what is hardware, what is software, what is the internet. No previous experience is required other than the ability to use a web browser.","tutor":"Nick Parlante","provider":"Stanford OpenEdx","language":"English","skills":["usa","north america"],"subject":"Computer Science","studentsInterested":"1.4k","courseLink":"https://online.stanford.edu/courses/soe-ycscs101-sp-computer-science-101","classCentralLink":"https://www.class-central.com/course/stanford-openedx-computer-science-101-2175"},{"title":"The Nature of Code","about":"Can we capture the unpredictable evolutionary and emergent properties of nature in software? Can understanding the mathematical principles behind our physical world help us to create digital worlds? This class focuses on the programming strategies and techniques behind computer simulations of natural systems. We explore topics ranging from basic mathematics and physics concepts to more advanced simulations of complex systems. Subjects covered include physics simulation, trigonometry, fractals, cellular automata, self-organization, and genetic algorithms. Examples are demonstrated using the p5.js environment with a focus on object oriented programming.\nVideo featuring original artwork in P5.js by:\nParticle Equalizer #1 by Sehyun Kim\nLook at me! by Muqing Niu\nDancing Spring by Yue Hu\nFireWork by Yue Hu\nNature Of Code final at ITP by Joe_Mango\nNature of Code - midterm by Marcela Nowak\nSound And Motion Coding by Marcela Nowak","tutor":"Daniel Shiffman","provider":"Kadenze","language":"English","skills":["programming","p5.js"],"subject":"Algorithms and Data Structures","studentsInterested":"8.0k","courseLink":"https://www.kadenze.com/courses/the-nature-of-code-ii","classCentralLink":"https://www.class-central.com/course/kadenze-the-nature-of-code-3777"},{"title":"Hardware Security","about":"In this course, we will study security and trust from the hardware perspective. Upon completing the course, students will understand the vulnerabilities in current digital system design flow and the physical attacks to these systems. They will learn that security starts from hardware design and be familiar with the tools and skills to build secure and trusted hardware.","tutor":"Gang Qu","provider":"Coursera","language":"English","skills":["usa","north america"],"subject":"Computer Science","studentsInterested":"393","courseLink":"https://www.coursera.org/learn/hardware-security","classCentralLink":"https://www.class-central.com/course/coursera-hardware-security-1729"},{"title":"Machine Learning for Data Science and Analytics","about":"Machine Learning is a growing field that is used when searching the web, placing ads, credit scoring, stock trading and for many other applications.\nThis data science course is an introduction to machine learning and algorithms. You will develop a basic understanding of the principles of machine learning and derive practical solutions using predictive analytics. We will also examine why algorithms play an essential role in Big Data analysis.","tutor":"Ansaf Salleb-Aouissi, Cliff Stein, David Blei, Itsik Peer, Mihalis Yannakakis and Peter Orbanz","provider":"edX","language":"English","skills":["columbiax"],"subject":"Machine Learning","studentsInterested":"413","courseLink":"https://www.edx.org/course/machine-learning-data-science-analytics-columbiax-ds102x-1","classCentralLink":"https://www.class-central.com/course/edx-machine-learning-for-data-science-and-analytics-4912"},{"title":"Introduction to the Internet of Things and Embedded Systems","about":"The explosive growth of the “Internet of Things” is changing our world and the rapid drop in price for typical IoT components is allowing people to innovate new designs and products at home. In this first class in the specialization you will learn the importance of IoT in society, the current components of typical IoT devices and trends for the future. IoT design considerations, constraints and interfacing between the physical world and your device will also be covered. You will also learn how to make design trade-offs between hardware and software. We\u0027ll also cover key components of networking to ensure that students understand how to connect their device to the Internet. Please note that this course does not include discussion forums.\n\nUpon completing this course, you will be able to:\n1. Define the term “Internet of Things”\n2. State the technological trends which have led to IoT\n3. Describe the impact of IoT on society\n4. Define what an embedded system is in terms of its interface\n5. Enumerate and describe the components of an embedded system\n6. Describe the interactions of embedded systems with the physical world\n7. Name the core hardware components most commonly used in IoT devices\n8. Describe the interaction between software and hardware in an IoT device\n9. Describe the role of an operating system to support software in an IoT device\n10. Explain the use of networking and basic networking hardware\n11. Describe the structure of the Internet\n12. Describe the meaning of a “network protocol”\n13. Explain MANETs and their relation to IoT","tutor":"Ian Harris","provider":"Coursera","language":"English","skills":["internet of things","embedded systems","iot","usa","north america"],"subject":"Internet of Things","studentsInterested":"608","courseLink":"https://www.coursera.org/learn/iot","classCentralLink":"https://www.class-central.com/course/coursera-introduction-to-the-internet-of-things-and-embedded-systems-4338"},{"title":"Machine Learning for Trading","about":"This course introduces students to the real world challenges of implementing machine learning based trading strategies including the algorithmic steps from information gathering to market orders. The focus is on how to apply probabilistic machine learning approaches to trading decisions. We consider statistical approaches like linear regression, KNN and regression trees and how to apply them to actual stock trading situations.\n\n\nWhy Take This Course?\nBy the end of this course, you should be able to:\nUnderstand data structures used for algorithmic trading.\nKnow how to construct software to access live equity data, assess it, and make trading decisions.\nUnderstand 3 popular machine learning algorithms and how to apply them to trading problems.\nUnderstand how to assess a machine learning algorithm\u0027s performance for time series data (stock price data).\nKnow how and why data mining (machine learning) techniques fail.\nConstruct a stock trading software system that uses current daily data.\nSome limitations/constraints:\nWe use daily data. This is not an HFT course, but many of the concepts here are relevant.\nWe don\u0027t interact (trade) directly with the market, but we will generate equity allocations that you could trade if you wanted to.","tutor":"Tucker Balch","provider":"Udacity","language":"English","skills":["python","usa","north america"],"subject":"Machine Learning","studentsInterested":"519","courseLink":"https://www.udacity.com/course/machine-learning-for-trading--ud501","classCentralLink":"https://www.class-central.com/course/udacity-machine-learning-for-trading-1026"},{"title":"Web Security Fundamentals","about":"Web applications are inherently insecure, as aptly illustrated by a pile of recent events. Insecurity is however not fundamental to the web platform. As a matter of fact, the modern web offers a variety of powerful security features that help stop a hacker. Unfortunately, not many developers have the knowledge and skills to leverage these security features to their full potential.\nThis course is imperative for understanding the fundamental security principles of the web. The course provides an overview of the most common attacks, and illustrates fundamental countermeasures that every web application should implement. In essence, this course offers you the knowledge and skills to build better and more secure applications.\nThis MOOC will introduce you to the web security landscape. Throughout the course, you will gain insights into the threats that modern web applications face. You’ll build an understanding of common attacks and their countermeasures; not only in theory, but also in practice. You’ll be provided with an overview of current best practices to secure web applications\nAlthough no previous security knowledge is necessary to join this course, it will help to be familiar with the basic concepts behind web applications, including HTTP, HTML, and JavaScript.","tutor":"Philippe De Ryck","provider":"edX","language":"English","skills":["kuleuvenx"],"subject":"Cybersecurity","studentsInterested":"2.0k","courseLink":"https://www.edx.org/course/web-security-fundamentals-kuleuvenx-websecx","classCentralLink":"https://www.class-central.com/course/edx-web-security-fundamentals-8726"},{"title":"Usable Security","about":"This course focuses on how to design and build secure systems with a human-centric focus. We will look at basic principles of human-computer interaction, and apply these insights to the design of secure systems with the goal of developing security measures that respect human performance and their goals within a system.","tutor":"Jennifer Golbeck","provider":"Coursera","language":"English","skills":["usa","north america"],"subject":"Computer Science","studentsInterested":"314","courseLink":"https://www.coursera.org/learn/usable-security","classCentralLink":"https://www.class-central.com/course/coursera-usable-security-1727"},{"title":"Algorithmic Thinking (Part 2)","about":"Experienced Computer Scientists analyze and solve computational problems at a level of abstraction that is beyond that of any particular programming language. This two-part class is designed to train students in the mathematical concepts and process of \"Algorithmic Thinking\", allowing them to build simpler, more efficient solutions to computational problems.\n\nIn part 2 of this course, we will study advanced algorithmic techniques such as divide-and-conquer and dynamic programming. As the central part of the course, students will implement several algorithms in Python that incorporate these techniques and then use these algorithms to analyze two large real-world data sets. The main focus of these tasks is to understand interaction between the algorithms and the structure of the data sets being analyzed by these algorithms.\n\nOnce students have completed this class, they will have both the mathematical and programming skills to analyze, design, and program solutions to a wide range of computational problems. While this class will use Python as its vehicle of choice to practice Algorithmic Thinking, the concepts that you will learn in this class transcend any particular programming language.","tutor":"Luay Nakhleh, Scott Rixner and Joe Warren","provider":"Coursera","language":"English","skills":["progamming","python","usa","north america"],"subject":"Algorithms and Data Structures","studentsInterested":"2.8k","courseLink":"https://www.coursera.org/learn/algorithmic-thinking-2","classCentralLink":"https://www.class-central.com/course/coursera-algorithmic-thinking-part-2-3200"},{"title":"Artificial Intelligence (AI)","about":"What do self-driving cars, face recognition, web search, industrial robots, missile guidance, and tumor detection have in common?\nThey are all complex real world problems being solved with applications of intelligence (AI).\nThis course will provide a broad understanding of the basic techniques for building intelligent computer systems and an understanding of how AI is applied to problems.\nYou will learn about the history of AI, intelligent agents, state-space problem representations, uninformed and heuristic search, game playing, logical agents, and constraint satisfaction problems.\nHands on experience will be gained by building a basic search agent. Adversarial search will be explored through the creation of a game and an introduction to machine learning includes work on linear regression.\nThis course is part of a MicroMasters program. If you complete all courses in the MicroMasters program in 2018, GE will guarantee you an interview in Boston for an internship or full-time role. Open to Massachusetts residents only.","tutor":"Professor Ansaf Salleb-Aouissi","provider":"edX","language":"English","skills":["columbiax"],"subject":"Artificial Intelligence","studentsInterested":"805","courseLink":"https://www.edx.org/course/artificial-intelligence-ai-columbiax-csmm-101x-3","classCentralLink":"https://www.class-central.com/course/edx-artificial-intelligence-ai-7230"},{"title":"Julia Scientific Programming","about":"This four-module course introduces users to Julia as a first language. Julia is a high-level, high-performance dynamic programming language developed specifically for scientific computing. This language will be particularly useful for applications in physics, chemistry, astronomy, engineering, data science, bioinformatics and many more. As open source software, you will always have it available throughout your working life. It can also be used from the command line, program files or a new type of interface known as a Jupyter notebook (which is freely available as a service from JuliaBox.com).\n\nJulia is designed to address the requirements of high-performance numerical and scientific computing while also being effective for general-purpose programming. You will be able to access all the available processors and memory, scrape data from anywhere on the web, and have it always accessible through any device you care to use as long as it has a browser. Join us to discover new computing possibilities. Let\u0027s get started on learning Julia.\n\nBy the end of the course you will be able to:\n- Programme using the Julia language by practising through assignments\n- Write your own simple Julia programs from scratch\n- Understand the advantages and capacities of Julia as a computing language\n- Work in Jupyter notebooks using the Julia language\n- Use various Julia packages such as Plots, DataFrames and Stats\n\nThe course is delivered through video lectures, on-screen demonstrations, quizzes and practical peer-reviewed projects designed to give you an opportunity to work with the packages.","tutor":"Juan H Klopper and Henri Laurie","provider":"Coursera","language":"English","skills":["africa","julia","south africa"],"subject":"Computer Science","studentsInterested":"1.5k","courseLink":"https://www.coursera.org/learn/julia-programming","classCentralLink":"https://www.class-central.com/course/coursera-julia-scientific-programming-7092"},{"title":"Design of Computer Programs","about":"Understanding how to approach programming problems and devise a solution is an essential skill for any Python developer. In this course, you’ll learn new concepts, patterns, and methods that will expand your coding abilities from programming expert, Peter Norvig.\n\n\nWhy Take This Course?\nMove along the path towards becoming an expert programmer! In this class you will practice going from a problem description to a solution, using a series of assignments. During office hours segments, Peter will also share his own personal tips and tricks for approaching programming problems - and his techniques may surprise you!","tutor":"Peter Norvig","provider":"Udacity","language":"English","skills":["python","usa","north america"],"subject":"Algorithms and Data Structures","studentsInterested":"2.3k","courseLink":"https://www.udacity.com/course/design-of-computer-programs--cs212","classCentralLink":"https://www.class-central.com/course/udacity-design-of-computer-programs-323"},{"title":"Image and Video Processing: From Mars to Hollywood with a Stop at the Hospital","about":"In this course, you will learn the science behind how digital images and video are made, altered, stored, and used. We will look at the vast world of digital imaging, from how computers and digital cameras form images to how digital special effects are used in Hollywood movies to how the Mars Rover was able to send photographs across millions of miles of space.\n\nThe course starts by looking at how the human visual system works and then teaches you about the engineering, mathematics, and computer science that makes digital images work. You will learn the basic algorithms used for adjusting images, explore JPEG and MPEG standards for encoding and compressing video images, and go on to learn about image segmentation, noise removal and filtering. Finally, we will end with image processing techniques used in medicine.\n\nThis course consists of 7 basic modules and 2 bonus (non-graded) modules. There are optional MATLAB exercises; learners will have access to MATLAB Online for the course duration. Each module is independent, so you can follow your interests.","tutor":"Guillermo Sapiro","provider":"Coursera","language":"English","skills":["usa","north america"],"subject":"Computer Science","studentsInterested":"246","courseLink":"https://www.coursera.org/learn/image-processing","classCentralLink":"https://www.class-central.com/course/coursera-image-and-video-processing-from-mars-to-hollywood-with-a-stop-at-the-hospital-462"},{"title":"Machine Learning: Classification","about":"Case Studies: Analyzing Sentiment \u0026 Loan Default Prediction\n\nIn our case study on analyzing sentiment, you will create models that predict a class (positive/negative sentiment) from input features (text of the reviews, user profile information,...). In our second case study for this course, loan default prediction, you will tackle financial data, and predict when a loan is likely to be risky or safe for the bank. These tasks are an examples of classification, one of the most widely used areas of machine learning, with a broad array of applications, including ad targeting, spam detection, medical diagnosis and image classification.\n\nIn this course, you will create classifiers that provide state-of-the-art performance on a variety of tasks. You will become familiar with the most successful techniques, which are most widely used in practice, including logistic regression, decision trees and boosting. In addition, you will be able to design and implement the underlying algorithms that can learn these models at scale, using stochastic gradient ascent. You will implement these technique on real-world, large-scale machine learning tasks. You will also address significant tasks you will face in real-world applications of ML, including handling missing data and measuring precision and recall to evaluate a classifier. This course is hands-on, action-packed, and full of visualizations and illustrations of how these techniques will behave on real data. We\u0027ve also included optional content in every module, covering advanced topics for those who want to go even deeper!\n\nLearning Objectives: By the end of this course, you will be able to:\n-Describe the input and output of a classification model.\n-Tackle both binary and multiclass classification problems.\n-Implement a logistic regression model for large-scale classification.\n-Create a non-linear model using decision trees.\n-Improve the performance of any model using boosting.\n-Scale your methods with stochastic gradient ascent.\n-Describe the underlying decision boundaries.\n-Build a classification model to predict sentiment in a product review dataset.\n-Analyze financial data to predict loan defaults.\n-Use techniques for handling missing data.\n-Evaluate your models using precision-recall metrics.\n-Implement these techniques in Python (or in the language of your choice, though Python is highly recommended).","tutor":"Carlos Guestrin and Emily Fox","provider":"Coursera","language":"English","skills":["python","usa","north america","machine learning core"],"subject":"Machine Learning","studentsInterested":"4.9k","courseLink":"https://www.coursera.org/learn/ml-classification","classCentralLink":"https://www.class-central.com/course/coursera-machine-learning-classification-4219"},{"title":"Cryptography","about":"Welcome to Cryptography!\nCryptography is the practice and study of techniques for securing communications in the presence of third parties. You will learn how to protect information in order to ensure its integrity, confidentiality, authenticity, and non-repudiation.\nYou will come out with a basic understanding of cryptographic concepts and how to apply them, implement secure protocols, key management concepts, key administration and validation, and Public Key Infrastructure.\n\nCourse Objectives\n1. Apply the fundamental concepts of cryptography\n2. Describe the difference between symmetric and asymmetric cryptography\n3. Define the basic requirements for cryptography\n4. Identify processes to support secure protocols\n5. Describe the process for implementing cryptographic systems\n6. Define key management concepts\n7. Define Public Key Infrastructure\n8. Identify processes for key administration and validation\n9. Describe the implementation of secure protocols","tutor":"Jonathan Katz","provider":"Coursera","language":"English","skills":["usa","north america"],"subject":"Algorithms and Data Structures","studentsInterested":"2.7k","courseLink":"https://www.coursera.org/learn/cryptography","classCentralLink":"https://www.class-central.com/course/coursera-cryptography-1730"},{"title":"Computational Neuroscience","about":"This course provides an introduction to basic computational methods for understanding what nervous systems do and for determining how they function. We will explore the computational principles governing various aspects of vision, sensory-motor control, learning, and memory. Specific topics that will be covered include representation of information by spiking neurons, processing of information in neural networks, and algorithms for adaptation and learning. We will make use of Matlab/Octave/Python demonstrations and exercises to gain a deeper understanding of concepts and methods introduced in the course. The course is primarily aimed at third- or fourth-year undergraduates and beginning graduate students, as well as professionals and distance learners interested in learning how the brain processes information.","tutor":"Rajesh Rao and Adrienne Fairhall","provider":"Coursera","language":"English","skills":["usa","north america"],"subject":"Artificial Intelligence","studentsInterested":"488","courseLink":"https://www.coursera.org/learn/computational-neuroscience","classCentralLink":"https://www.class-central.com/course/coursera-computational-neuroscience-449"},{"title":"Introduction to Computer Networking","about":"This is an introductory course on computer networking, specifically the Internet. It focuses on explaining how the Internet works, ranging from how bits are modulated on wires and in wireless to application-level protocols like BitTorrent and HTTP. It also explains the principles of how to design networks and network protocols. Students gain experience reading and understanding RFCs (Internet protocol specifications) as statements of what a system should do. The course grounds many of the concepts in current practice and recent developments, such as net neutrality and DNS security.\nPREREQUISITES\nStudents need an introductory course in probability, a strong understanding of bits and bytes, and knowledge of how computers lay out data in memory.","tutor":"Nick McKeown and Philip Levis","provider":"Stanford OpenEdx","language":"English","skills":["usa","north america"],"subject":"Computer Networking","studentsInterested":"8.4k","courseLink":"https://online.stanford.edu/courses/soe-ynetworking-sp-introduction-computer-networking","classCentralLink":"https://www.class-central.com/course/stanford-openedx-introduction-to-computer-networking-1578"},{"title":"Introduction to Software Product Management","about":"This course highlights the importance and role of software product management. It also provides an overview of the specialization, as well as its goals, structure, and expectations. The course explains the value of process, requirements, planning, and monitoring in producing better software.\n\nUpon successful completion of this course, you will be able to:\n\n- Relate software product management to better software products\n- Recognize the role of a software product manager\n- Reflect on how Agile principles will improve your own projects","tutor":"Kenny Wong","provider":"Coursera","language":"English","skills":["sdlc","agile","usa","north america"],"subject":"Computer Science","studentsInterested":"1.5k","courseLink":"https://www.coursera.org/learn/introduction-to-software-product-management","classCentralLink":"https://www.class-central.com/course/coursera-introduction-to-software-product-management-4196"},{"title":"Cybersecurity and Its Ten Domains","about":"This course is designed to introduce students, working professionals and the community to the exciting field of cybersecurity. Throughout the MOOC, participants will engage in community discourse and online interaction. Participants will gain knowledge and understanding of cybersecurity and its domains. They will engage with expertly produced videos, gain insight from industry experts, participate in knowledge assessments, practice assessing their environmental awareness, and gain access to materials that address governance and risk management, compliance, business continuity and disaster recovery, cryptography, software development security, access control, network security, security architecture, security operations, and physical and environmental security. Learning will be assessed using strategies aligned to knowledge and understanding.\n\nYou do not need prior experience in IT security to do well in this course. All you need is a willingness to learn. We will point you to relevant open and free resources to assist you.\n\nAt the end of this course, you will have the option of applying for undergraduate level course credit at Kennesaw State University (dependent on admission to Kennesaw State University as a degree seeking or a non-degree seeking student). More information is available in final module \"Receive Course (undergraduate) Credit at Kennesaw State University\".","tutor":"Humayun Zafar, and Andy Green","provider":"Coursera","language":"English","skills":["usa","north america"],"subject":"Cybersecurity","studentsInterested":"422","courseLink":"https://www.coursera.org/learn/cyber-security-domain","classCentralLink":"https://www.class-central.com/course/coursera-cybersecurity-and-its-ten-domains-3206"},{"title":"Software Processes and Agile Practices","about":"This course delves into a variety of processes to structure software development. It also covers the foundations of core Agile practices, such as Extreme Programming and Scrum.\n\nUpon successful completion of this course, you will be able to:\n\n- Distinguish between different process models for organizing software production.\n- Gauge the applicability of process models for a software development project.\n- Apply the fundamentals of Agile software development and management practices.","tutor":"Kenny Wong","provider":"Coursera","language":"English","skills":["sdlc","agile","usa","north america"],"subject":"Software Development","studentsInterested":"1.8k","courseLink":"https://www.coursera.org/learn/software-processes-and-agile-practices","classCentralLink":"https://www.class-central.com/course/coursera-software-processes-and-agile-practices-4187"},{"title":"Learning from Data (Introductory Machine Learning course)","about":"This is an introductory course in machine learning (ML) that covers the basic theory, algorithms, and applications. ML is a key technology in Big Data, and in many financial, medical, commercial, and scientific applications. It enables computational systems to adaptively improve their performance with experience accumulated from the observed data. ML has become one of the hottest fields of study today, taken up by undergraduate and graduate students from 15 different majors at Caltech. This course balances theory and practice, and covers the mathematical as well as the heuristic aspects. The lectures below follow each other in a story-like fashion:\nWhat is learning?\nCan a machine learn?\nHow to do it?\nHow to do it well?\nTake-home lessons.","tutor":"Yaser Abu-Mostafa","provider":"Independent","language":"English","skills":["machine learning","usa","north america","machine learning core"],"subject":"Machine Learning","studentsInterested":"3.5k","courseLink":"https://www.http://work.caltech.edu/telecourse.html","classCentralLink":"https://www.class-central.com/course/learning-from-data-introductory-machine-learning-course-366"},{"title":"Reinforcement Learning","about":"You should take this course if you have an interest in machine learning and the desire to engage with it from a theoretical perspective. Through a combination of classic papers and more recent work, you will explore automated decision-making from a computer-science perspective. You will examine efficient algorithms, where they exist, for single-agent and multi-agent planning as well as approaches to learning near-optimal decisions from experience. At the end of the course, you will replicate a result from a published paper in reinforcement learning.\n\n\nWhy Take This Course?\nThis course will prepare you to participate in the reinforcement learning research community. You will also have the opportunity to learn from two of the foremost experts in this field of research, Profs. Charles Isbell and Michael Littman.","tutor":"Charles Isbell and Michael Littman","provider":"Udacity","language":"English","skills":["big data","data science","game theory","machine learning","reinforcement learning","markov decision process","usa","north america"],"subject":"Machine Learning","studentsInterested":"500","courseLink":"https://www.udacity.com/course/reinforcement-learning--ud600","classCentralLink":"https://www.class-central.com/course/udacity-reinforcement-learning-1849"},{"title":"Mastering the Software Engineering Interview","about":"You’ve hit a major milestone as a computer scientist and are becoming a capable programmer. You now know how to solve problems, write algorithms, and analyze solutions; and you have a wealth of tools (like data structures) at your disposal. You may now be ready for an internship or (possibly) an entry-level software engineering job. But can you land the internship/job? It depends in part on how well you can solve new technical problems and communicate during interviews. How can you get better at this? Practice!\n\nWith the support of Google’s recruiting and engineering teams we’ve provided tips, examples, and practice opportunities in this course that may help you with a number of tech companies. We’ll assist you to organize into teams to practice. Lastly, we’ll give you basic job search advice, and tips for succeeding once you’re on the job.","tutor":"Mia Minnes, Leo Porter and Christine Alvarado","provider":"Coursera","language":"English","skills":["job interview","programming interview questions","usa","north america"],"subject":"Software Development","studentsInterested":"197","courseLink":"https://www.coursera.org/learn/cs-tech-interview","classCentralLink":"https://www.class-central.com/course/coursera-mastering-the-software-engineering-interview-4261"},{"title":"软件测试 (Software Testing)","about":"从认识和理解软件Bug开始，介绍软件测试的基本理论，阐述软件测试设计的多样性原理。基于多样性原理，介绍白盒测试方法和黑盒测试，具体包括随机测试、等价类测试、控制流测试、数据流测试等；邀请业界专家讲解功能测试、性能测试、移动应用测试技术。","tutor":"Zhenyu Chen","provider":"Coursera","language":"Chinese","skills":["china","asia"],"subject":"Software Development","studentsInterested":"19","courseLink":"https://www.coursera.org/learn/ruanjian-ceshi","classCentralLink":"https://www.class-central.com/course/coursera--software-testing-3357"},{"title":"Cybersecurity and Mobility","about":"This course is for you if you are interested in transitioning toward a managerial role in cybersecurity and mobility. Through interviews with industry experts in this area, you will be able to analyze innovations powering the rapid spread of information technology and how they present new challenges for protecting data. For example, mobile devices increase convenience but often bypass traditional security measures. After this course, you will be able to describe how the nature of the threat evolves, as culprits employ a burgeoning set of sophisticated tools to take advantage of our growing reliance on networks for critical-data exchange.\n\nIf you want to pursue a career in the public sector, the stakes are high as well. The proliferation of hackers, inevitable human errors, bring-your-own-device (BYOD) initiatives, and the ever-broadening need to share information weigh heavily on government and education organizations, and consume substantial resources. The Pentagon, for example, has proposed to spend $23 billion on network security initiatives through 2018. This sounds like a large sum, until you consider the scope and importance of the U.S. government information resources this investment must protect.\n\nAfter completing the course modules you will be able to explain how yesterday’s prevention strategies are no longer adequate for stopping advanced, targeted attacks. Effective cybersecurity must be multi-dimensional and tiered, as threats can originate from virtually anywhere, target numerous levels of an organization, and sometimes persist for months or years before an information security staff is aware of an attack or breach. Therefore securing networks requires a holistic approach that incorporates several elements.","tutor":"Dr. Humayun Zafar, Dr. Traci Carte, Herbert J. Mattord, Ph.D., CISM, CISSP, CDP and Mr. Andy Green","provider":"Coursera","language":"English","skills":["information security","management skills","cybersecurity","usa","north america"],"subject":"Cybersecurity","studentsInterested":"216","courseLink":"https://www.coursera.org/learn/cybersecurity-mobility","classCentralLink":"https://www.class-central.com/course/coursera-cybersecurity-and-mobility-6584"},{"title":"Matrix Factorization and Advanced Techniques","about":"In this course you will learn a variety of matrix factorization and hybrid machine learning techniques for recommender systems. Starting with basic matrix factorization, you will understand both the intuition and the practical details of building recommender systems based on reducing the dimensionality of the user-product preference space. Then you will learn about techniques that combine the strengths of different algorithms into powerful hybrid recommenders.","tutor":"Michael D. Ekstrand and Joseph A Konstan","provider":"Coursera","language":"English","skills":["usa","north america","new-moocs-2017"],"subject":"Artificial Intelligence","studentsInterested":"56","courseLink":"https://www.coursera.org/learn/matrix-factorization","classCentralLink":"https://www.class-central.com/course/coursera-matrix-factorization-and-advanced-techniques-6933"},{"title":"Google Cloud Platform Fundamentals: Core Infrastructure","about":"\u003c\u003c\u003c ATTENTION \u003e\u003e\u003e\nLearners interested in Google Cloud Platform can continue to learn in either of our latest GCP infrastructure specializations.\n\nOption 1: The Developing Applications with Google Cloud Platform Specialization is available on Coursera. This brand-new Specialization teaches you to build secure, scalable, and intelligent cloud-native applications. Visit https://www.coursera.org/specializations/developing-apps-gcp for more details.\n\nOption 2: The Architecting with Google Cloud Platform Specialization is also available. This Specialization has updated, improved content that will help you if you are preparing for the Google Certified Professional - Cloud Architect exam. Head to https://www.coursera.org/specializations/gcp-architecture to explore the updated content.\n\nGoogle Cloud Platform Fundamentals: Core Infrastructure covers the fundamentals of Google Cloud Platform and is the first course in both specializations.\n\nThis course introduces you to important concepts and terminology for working with Google Cloud Platform (GCP). You learn about, and compare, many of the computing and storage services available in Google Cloud Platform, including Google App Engine, Google Compute Engine, and Google Container Engine.\n\nNotes:\n• You\u0027ll need a Google/Gmail account and a credit card or bank account to sign up for the Google Cloud Platform free trial (Google services are currently unavailable in China).\n• If you are a Google Cloud Platform customer with European Union (EU) and Russian billing addresses, read the VAT Overview documentation at: https://cloud.google.com/billing/docs/resources/vat-overview\n• More Google Cloud Platform free trial FAQs are available at: https://cloud.google.com/free-trial/","tutor":"Google Cloud Training","provider":"Coursera","language":"English","skills":[],"subject":"DevOps","studentsInterested":"505","courseLink":"https://www.coursera.org/learn/gcp-fundamentals","classCentralLink":"https://www.class-central.com/course/coursera-google-cloud-platform-fundamentals-core-infrastructure-7784"},{"title":"Essential Cloud Infrastructure: Core Services","about":"\u003e\u003e\u003e By enrolling in this course you agree to the Qwiklabs Terms of Service as set out in the FAQ and located at: https://qwiklabs.com/terms_of_service \u003c\u003c\u003c\n\nThis accelerated on-demand course introduces participants to the comprehensive and flexible infrastructure and platform services provided by Google Cloud Platform. Through a combination of video lectures, demos, and hands-on labs, participants explore and deploy solution elements, including infrastructure components such as networks, systems and applications services. This course also covers deploying practical solutions including securely interconnecting networks, customer-supplied encryption keys, security and access management, quotas and billing, and resource monitoring.\n\nPrerequisites:\nTo get the most out of this course, participants should have:\n• Completed Google Cloud Platform Fundamentals (Core Infrastructure or AWS Professionals.) or have equivalent experience\n• Completed Essential Cloud Infrastructure: Foundation or have equivalent experience\n• Basic proficiency with command-line tools and Linux operating system environments\n• Systems Operations experience including deploying and managing applications, either on-premises or in a public cloud environment","tutor":"Google Cloud Training","provider":"Coursera","language":"English","skills":["devops","google cloud","new-moocs-2017"],"subject":"DevOps","studentsInterested":"48","courseLink":"https://www.coursera.org/learn/gcp-infrastructure-core-services","classCentralLink":"https://www.class-central.com/course/coursera-essential-cloud-infrastructure-core-services-8763"},{"title":"Cybersecurity Policy for Aviation and Internet Infrastructures","about":"In this course we will examine the aviation and Internet infrastructures, and various policies that have been developed to help guide and strengthen their cybersecurity programs. The aviation and Internet infrastructures are also considered \"lifeline infrastructure\" as part of the transportation and communications sectors. Both subsectors are overseen by the Department of Homeland Security National Protection and Programs Directorate which manages the DHS National Infrastructure Protection Program. SSA responsibility for the aviation subsector is shared between the Transportation Security Administration and Federal Aviation Administration under the auspices of the Department of Homeland Security and Department of Transportation respectively. The Department of Homeland Security retains sole responsibility as the Sector-Specific Agency for the Internet subsector. While TSA and FAA have regulatory over the aviation subsector, DHS has no regulatory authority whatsoever over the Internet. In response to Executive Order 13636 issued by President Obama in February 2013, both sets of SSAs recommended continuing with voluntary cybersecurity measures. TSA and FAA reported they were working to implement the Transportation Roadmap across all transportation subsectors, including aviation. DHS reported that it was working with Internet providers to implement the Cyber Assessment Risk Management Approach. Despite some differences, the Transportation Roadmap and CARMA are very similar to the NIST Cybersecrity Framework and ES-C2M2 examined previously. That is to say, they are predicated on a continuous improvement process that engages the whole organization in identifying and implementing incremental changes to enhance cybersecurity practices based on prevailing standards. This module will examine both the aviation and Internet lifeline infrastructure subsectors, and elements and application of the Transportation Roadmap and CARMA.","tutor":"Richard White","provider":"Coursera","language":"English","skills":["cybersecurity","homeland security","new-moocs-2017"],"subject":"Cybersecurity","studentsInterested":"70","courseLink":"https://www.coursera.org/learn/cybersecurity-policy-aviation-internet","classCentralLink":"https://www.class-central.com/course/coursera-cybersecurity-policy-for-aviation-and-internet-infrastructures-8819"},{"title":"Homeland Security and Cybersecurity Future","about":"This course takes a look at the future of cybersecurity with respect to what is being done to lessen the potential for catastrophic destruction resulting from cyber attack on critical infrastructure. In this respect, we take a short survey of potential technological solutions and response options. We conclude this module by taking a look at unique aspects of the cyber profession and personal considerations for those who want to make cybersecurity a career.","tutor":"Richard White","provider":"Coursera","language":"English","skills":["cybersecurity","homeland security","new-moocs-2017"],"subject":"Cybersecurity","studentsInterested":"122","courseLink":"https://www.coursera.org/learn/homeland-security-cybersecurity-future","classCentralLink":"https://www.class-central.com/course/coursera-homeland-security-and-cybersecurity-future-8821"},{"title":"Introduction to Architecting Smart IoT Devices","about":"What will you learn?\n\nEmbedded Systems are so ubiquitous that some of us take them for granted: we find them in smartphones, GPS systems, airplanes and so on. But have you ever wondered how these devices actually work? If so, you\u0027re in the right place!\n\nIn this course, you\u0027ll learn about the characteristics of embedded systems: the possibilities, dangers, complications and recipes for success. We\u0027ll discuss all of this in the framework of a flourishing embedded systems field: the Internet of Things, where billions of intercommunicating devices could enable unprecedented, innovative products and services. If you\u0027d like to learn how to create similarly innovative products, then this is the course for you!\n\nAt the end of the course, you\u0027ll be able to:\n- make the right choice for your own project when it comes to the target market, parallel executions, time and the lifecycle of your system\n- hack, avoid failure and promote success\n- decide whether to buy or to build components\n- how to assemble a good team\n- install case tools\n- learn how to work with SysML\n\nThis is an introductory course. Check out our more advanced course Architecting Smart IoT Devices soon if you want to go beyond the basics!","tutor":"Martin Timmerman","provider":"Coursera","language":"English","skills":["internet of things","europe","embedded systems","iot","belgium"],"subject":"Internet of Things","studentsInterested":"168","courseLink":"https://www.coursera.org/learn/iot-devices","classCentralLink":"https://www.class-central.com/course/coursera-introduction-to-architecting-smart-iot-devices-6748"},{"title":"Convolutional Neural Networks","about":"This course will teach you how to build convolutional neural networks and apply it to image data. Thanks to deep learning, computer vision is working far better than just two years ago, and this is enabling numerous exciting applications ranging from safe autonomous driving, to accurate face recognition, to automatic reading of radiology images.\n\nYou will:\n- Understand how to build a convolutional neural network, including recent variations such as residual networks.\n- Know how to apply convolutional networks to visual detection and recognition tasks.\n- Know to use neural style transfer to generate art.\n- Be able to apply these algorithms to a variety of image, video, and other 2D or 3D data.\n\nThis is the fourth course of the Deep Learning Specialization.","tutor":"Andrew Ng","provider":"Coursera","language":"English","skills":["deep learning","neural networks","new-moocs-2017","neural networks core"],"subject":"Artificial Intelligence","studentsInterested":"390","courseLink":"https://www.coursera.org/learn/convolutional-neural-networks","classCentralLink":"https://www.class-central.com/course/coursera-convolutional-neural-networks-9057"},{"title":"Capstone: Autonomous Runway Detection for IoT","about":"This capstone project course ties together the knowledge from three previous courses in IoT though embedded systems: Development of Real-Time Systems, Web Connectivity \u0026 Security and Embedded Hardware and Operating Systems. The students will develop a larger system using the learning outcomes from these courses, and the students will evaluate the developed system in a real-world programming environment. This course is a true engineering task in which the student must, not only implement the algorithm code, but also handle the interfaces between many different actors and hardware platforms. The students will learn how to motivate engineering decisions and how to choose implementations to make a system actually running. The students will also learn to evaluate the efficiency and the correctness of their system as well as real-world parameters such as energy consumption and cost.","tutor":"Juha Plosila","provider":"Coursera","language":"English","skills":["internet of things","capstone","embedded systems","new-moocs-2017"],"subject":"Internet of Things","studentsInterested":"28","courseLink":"https://www.coursera.org/learn/autonomous-runway-detection","classCentralLink":"https://www.class-central.com/course/coursera-capstone-autonomous-runway-detection-for-iot-9141"},{"title":"An Introduction to Practical Deep Learning","about":"This course provides an introduction to Deep Learning, a field that aims to harness the enormous amounts of data that we are surrounded by with artificial neural networks, allowing for the development of self-driving cars, speech interfaces, genomic sequence analysis and algorithmic trading.\n\nYou will explore important concepts in Deep Learning, train deep networks using Intel Nervana Neon, apply Deep Learning to various applications and explore new and emerging Deep Learning topics.","tutor":"Nikhil Murthy and Andres Rodriguez","provider":"Coursera","language":"English","skills":["deep learning"],"subject":"Deep Learning","studentsInterested":"52","courseLink":"https://www.coursera.org/learn/intro-practical-deep-learning","classCentralLink":"https://www.class-central.com/course/coursera-an-introduction-to-practical-deep-learning-10449"},{"title":"Mathematics for Machine Learning: PCA","about":"This course introduces the mathematical foundations to derive Principal Component Analysis (PCA), a fundamental dimensionality reduction technique. We\u0027ll cover some basic statistics of data sets, such as mean values and variances, we\u0027ll compute distances and angles between vectors using inner products and derive orthogonal projections of data onto lower-dimensional subspaces. Using all these tools, we\u0027ll then derive PCA as a method that minimizes the average squared reconstruction error between data points and their reconstruction.\n\nAt the end of this course, you\u0027ll be familiar with important mathematical concepts and you can implement PCA all by yourself. If you’re struggling, you\u0027ll find a set of jupyter notebooks that will allow you to explore properties of the techniques and walk you through what you need to do to get on track. If you are already an expert, this course may refresh some of your knowledge.\n\nThis examples and exercises require:\n1. Some ability of abstract thinking\n2. Good background in linear algebra (e.g., matrix and vector algebra, linear independence, basis)\n3. Basic background in multivariate calculus (e.g., partial derivatives, basic optimization)\n4. Basic knowledge in python programming and numpy","tutor":"Marc P. Deisenroth","provider":"Coursera","language":"English","skills":["machine learning","statistics","pca"],"subject":"Machine Learning","studentsInterested":"52","courseLink":"https://www.coursera.org/learn/pca-machine-learning","classCentralLink":"https://www.class-central.com/course/coursera-mathematics-for-machine-learning-pca-10451"},{"title":"API Security on Google Cloud\u0027s Apigee API Platform","about":"Now that your APIs are developed, it\u0027s time to talk about how to secure them. This course covers API security using the Apigee API platform. We\u0027ll learn about how to properly secure your APIs by covering topics such as the types of OAuth, TLS, and SAML to name a few. We\u0027ll apply these concepts with hands on labs to implement proper authentication and validation in your APIs.\n\nBy taking this course, you\u0027ll come to have a high level understanding of API security and why it\u0027s important. All supplemental materials will be provided to you for offline review / reference. Since this is the final course in the Specialization, you\u0027ll come out of this course with a fully working and secure API to be used as reference for all your future builds!\n\nNote: Before starting this course, please ensure that you have completed the \"API Design and Fundamentals of Google Cloud\u0027s Apigee API Platform\" and \"API Development on Google Cloud\u0027s Apigee API Platform\" courses.","tutor":"Apigee Training Team","provider":"Coursera","language":"English","skills":["google","api\u0027s","google cloud","secure software"],"subject":"Cybersecurity","studentsInterested":"28","courseLink":"https://www.coursera.org/learn/api-security-apigee-gcp","classCentralLink":"https://www.class-central.com/course/coursera-api-security-on-google-cloud-s-apigee-api-platform-10487"},{"title":"Google Cloud Platform Big Data and Machine Learning Fundamentals en Español","about":"Este curso acelerado on demand de 1 semana de duración presenta a los participantes las funciones de macrodatos y aprendizaje automático de Google Cloud Platform (GCP). Ofrece una descripción general breve de Google Cloud Platform y profundiza en las funciones de procesamiento de datos.\n\nAl final del curso, los participantes podrán realizar lo siguiente:\n• Identificar el propósito y el valor de los productos clave de Google Cloud Platform relacionados con los macrodatos y el aprendizaje automático\n• Usar CloudSQL y Cloud Dataproc para migrar cargas de trabajo existentes de MySQL y Hadoop/Pig/Spark/Hive a Google Cloud Platform\n• Utilizar BigQuery y Cloud Datalab para realizar análisis interactivos de datos\n• Elegir entre Cloud SQL, BigTable y Datastore\n• Entrenar y usar una red neuronal mediante TensorFlow\n• Elegir entre diferentes productos de procesamiento de datos en Google Cloud Platform\n\nPara inscribirse en este curso, los participantes deben tener aproximadamente un (1) año de experiencia en uno o más de los siguientes:\n• Un lenguaje de consultas común, como SQL\n• Actividades de extracción, transformación y carga\n• Modelado de datos\n• Aprendizaje automático o estadísticas\n• Programación en Python\n\nNotas sobre la cuenta de Google:\n• Necesitará una cuenta de Google o de Gmail y una tarjeta de crédito o una cuenta bancaria para registrarse en la prueba gratuita de Google Cloud Platform (los servicios de Google no están disponibles en China en la actualidad).\n• Si es un cliente de Google Cloud Platform con una dirección de facturación de la Unión Europea (UE) o de Rusia, lea la información general sobre el IVA que se encuentra aquí: https://cloud.google.com/billing/docs/resources/vat-overview\n• Encontrará más Preguntas frecuentes sobre la prueba gratuita de Google Cloud Platform aquí: https://cloud.google.com/free/?hl\u003des-419","tutor":"Google Cloud Training","provider":"Coursera","language":"Spanish","skills":["big data","machine learning","google","google cloud"],"subject":"Machine Learning","studentsInterested":"103","courseLink":"https://www.coursera.org/learn/gcp-big-data-ml-fundamentals-es","classCentralLink":"https://www.class-central.com/course/coursera-google-cloud-platform-big-data-and-machine-learning-fundamentals-en-espanol-10754"},{"title":"On Premises Management, Security, and Upgrade with Google Cloud\u0027s Apigee API Platform","about":"This course helps you build hands-on experience with Apigee API Platform On-Premises installation, management and upgrade processes.\n\nThe material focuses on building understanding about the management capabilities of Apigee API Platform, how to secure the platform as well as how to maintained up to date by performing upgrades.","tutor":"Apigee Training Team","provider":"Coursera","language":"English","skills":["google","api\u0027s","google cloud","cloud administration"],"subject":"DevOps","studentsInterested":"29","courseLink":"https://www.coursera.org/learn/onprem-mgmt-security-apigee-gcp","classCentralLink":"https://www.class-central.com/course/coursera-on-premises-management-security-and-upgrade-with-google-cloud-s-apigee-api-platform-10747"},{"title":"Feature Engineering","about":"Want to know how you can improve the accuracy of your machine learning models? What about how to find which data columns make the most useful features? Welcome to Feature Engineering on Google Cloud Platform where we will discuss the elements of good vs bad features and how you can preprocess and transform them for optimal use in your machine learning models.\n\nIn this course you will get hands-on practice choosing features and preprocessing them inside of Google Cloud Platform with interactive labs. Our instructors will walk you through the code solutions which will also be made public for your reference as you work on your own future ML projects.","tutor":"Google Cloud Training","provider":"Coursera","language":"English","skills":["machine learning","google cloud"],"subject":"Machine Learning","studentsInterested":"103","courseLink":"https://www.coursera.org/learn/feature-engineering","classCentralLink":"https://www.class-central.com/course/coursera-feature-engineering-11074"},{"title":"Internet of Things: Communication Technologies","about":"Have you wondered how “Things” talk to each other and the cloud? Do you understand the alternatives for conveying latency-sensitive real time data versus reliable signaling data? Building on the skills from the Sensing and Actuation course, we will explore protocols to exchange information between processors.\n\nIn this course, you will learn how VoIP systems like Skype work and implement your own app for voice calls and text messages. You will start by using the Session Initiation Protocol (SIP) for session management. Next, you will learn how voice codecs such as Adaptive Multi Rate (AMR) are used in 3G networks and use them for voice traffic in your app.\n\nLearning Goals: After completing this course, you will be able to:\n\n1. Implement session initiation, management and termination on your DragonBoard™ 410c using SIP.\n2. Discover other users and exchange device capabilities.\n3. Compare and contrast narrowband and wideband codecs and experience the voice quality differences between them.\n4. Implement and demonstrate VoIP calls using the DragonBoard 410c.","tutor":"Ganz Chockalingam and Harinath Garudadri","provider":"Coursera","language":"English","skills":["internet of things","iot","network protocols","usa","north america"],"subject":"Internet of Things","studentsInterested":"477","courseLink":"https://www.coursera.org/learn/internet-of-things-communication","classCentralLink":"https://www.class-central.com/course/coursera-internet-of-things-communication-technologies-4173"},{"title":"数据结构基础","about":"学了C/C++ 语言，我们已经会编程解题了，那怎么用来处理实际的问题呢？\n怎么设计数据结构来有效地管理企业人员？如何编写程序没让人才和岗位达到最佳匹配？如何安排旅行计划，找到最佳行程路径？这些学习、工作、生活中常常困扰我们的问题，你将在《数据结构基础》课程中找到答案。\n数据结构是计算机程序设计的基础，告诉我们数据在计算机里是如何组织与存储的，能帮助我们刻画实际问题中的信息及其相互关系。当我们对一个实际问题本身有了一个结构化的认识之后，就可以选择合适的解决方法了。\n完成这门课之时，你将掌握线性表、栈与队列、字符串、二叉树、树、图等经典的数据结构，并运用这些基础数据结构和相关算法解决实际应用问题。扎实的数据结构知识是项目开发与结构层次设计的关键，学好这门课会让你在高年级的计算机专业课程以及毕业项目设计中事半功倍，同时也将为你成为一名优秀的程序设计人员打下坚实的基础。\n\n附：本课程的内容来自教材：《数据结构与算法》（张铭、王腾蛟、赵海燕 编著），高等教育出版社，2008年。","tutor":"Ming Zhang 张铭","provider":"Coursera","language":"Chinese","skills":["china","asia"],"subject":"Computer Science","studentsInterested":"11","courseLink":"https://www.coursera.org/learn/shuju-jiegou-suanfa","classCentralLink":"https://www.class-central.com/course/coursera--2761"},{"title":"Machine Learning: Clustering \u0026 Retrieval","about":"Case Studies: Finding Similar Documents\n\nA reader is interested in a specific news article and you want to find similar articles to recommend. What is the right notion of similarity? Moreover, what if there are millions of other documents? Each time you want to a retrieve a new document, do you need to search through all other documents? How do you group similar documents together? How do you discover new, emerging topics that the documents cover?\n\nIn this third case study, finding similar documents, you will examine similarity-based algorithms for retrieval. In this course, you will also examine structured representations for describing the documents in the corpus, including clustering and mixed membership models, such as latent Dirichlet allocation (LDA). You will implement expectation maximization (EM) to learn the document clusterings, and see how to scale the methods using MapReduce.\n\nLearning Outcomes: By the end of this course, you will be able to:\n-Create a document retrieval system using k-nearest neighbors.\n-Identify various similarity metrics for text data.\n-Reduce computations in k-nearest neighbor search by using KD-trees.\n-Produce approximate nearest neighbors using locality sensitive hashing.\n-Compare and contrast supervised and unsupervised learning tasks.\n-Cluster documents by topic using k-means.\n-Describe how to parallelize k-means using MapReduce.\n-Examine probabilistic clustering approaches using mixtures models.\n-Fit a mixture of Gaussian model using expectation maximization (EM).\n-Perform mixed membership modeling using latent Dirichlet allocation (LDA).\n-Describe the steps of a Gibbs sampler and how to use its output to draw inferences.\n-Compare and contrast initialization techniques for non-convex optimization objectives.\n-Implement these techniques in Python.","tutor":"Carlos Guestrin and Emily Fox","provider":"Coursera","language":"English","skills":["python","usa","north america","machine learning core"],"subject":"Machine Learning","studentsInterested":"2.4k","courseLink":"https://www.coursera.org/learn/ml-clustering-and-retrieval","classCentralLink":"https://www.class-central.com/course/coursera-machine-learning-clustering-retrieval-4313"},{"title":"算法基础","about":"算法代表着用系统的方法描述解决问题的策略机制，北京大学《算法基础》课程将带你一一探索枚举、二分、贪心、递归、深度优先搜索、广度优先搜索、动态规划等经典算法，体会他们巧妙的构思，感受他们利用计算解决问题的独特魅力。顺利完成本课程，你将不但能够掌握这些算法的原理，还能够对这些算法进行灵活应用以及准确实现。本课程的中的编程任务，将充分训练你的思维能力和动手能力，促成全面、缜密思考问题的习惯。达到本门课程的要求，即意味者你具备了初步的算法基础和较强的编程实现能力。","tutor":"Jiaying Liu 刘家瑛 and Wei Guo 郭炜","provider":"Coursera","language":"Chinese","skills":["algorithms","china","asia"],"subject":"Algorithms and Data Structures","studentsInterested":"10","courseLink":"https://www.coursera.org/learn/suanfa-jichu","classCentralLink":"https://www.class-central.com/course/coursera--4306"},{"title":"Advanced Algorithms and Complexity","about":"You\u0027ve learned the basic algorithms now and are ready to step into the area of more complex problems and algorithms to solve them. Advanced algorithms build upon basic ones and use new ideas. We will start with networks flows which are used in more typical applications such as optimal matchings, finding disjoint paths and flight scheduling as well as more surprising ones like image segmentation in computer vision. We then proceed to linear programming with applications in optimizing budget allocation, portfolio optimization, finding the cheapest diet satisfying all requirements and many others. Next we discuss inherently hard problems for which no exact good solutions are known (and not likely to be found) and how to solve them in practice. We finish with a soft introduction to streaming algorithms that are heavily used in Big Data processing. Such algorithms are usually designed to be able to process huge datasets without being able even to store a dataset.","tutor":"Alexander S. Kulikov and Michael Levin","provider":"Coursera","language":"English","skills":["algorithms","russia","algorithm design","usa","north america"],"subject":"Algorithms and Data Structures","studentsInterested":"143","courseLink":"https://www.coursera.org/learn/advanced-algorithms-and-complexity","classCentralLink":"https://www.class-central.com/course/coursera-advanced-algorithms-and-complexity-5474"},{"title":"Algorithms on Graphs","about":"If you have ever used a navigation service to find optimal route and estimate time to destination, you\u0027ve used algorithms on graphs. Graphs arise in various real-world situations as there are road networks, computer networks and, most recently, social networks! If you\u0027re looking for the fastest time to get to work, cheapest way to connect set of computers into a network or efficient algorithm to automatically find communities and opinion leaders in Facebook, you\u0027re going to work with graphs and algorithms on graphs.\n\nIn this course, you will first learn what a graph is and what are some of the most important properties. Then you\u0027ll learn several ways to traverse graphs and how you can do useful things while traversing the graph in some order. We will then talk about shortest paths algorithms — from the basic ones to those which open door for 1000000 times faster algorithms used in Google Maps and other navigational services. You will use these algorithms if you choose to work on our Fast Shortest Routes industrial capstone project. We will finish with minimum spanning trees which are used to plan road, telephone and computer networks and also find applications in clustering and approximate algorithms.","tutor":"Alexander S. Kulikov and Michael Levin","provider":"Coursera","language":"English","skills":["algorithms","russia","algorithm design","graphs","usa","north america"],"subject":"Algorithms and Data Structures","studentsInterested":"262","courseLink":"https://www.coursera.org/learn/algorithms-on-graphs","classCentralLink":"https://www.class-central.com/course/coursera-algorithms-on-graphs-5479"},{"title":"Cybersecurity and the X-Factor","about":"What is the X-Factor? In Cybersecurity, the X-Factor related to unknown and unpredictable human behavior within and outside of your organization. “No one really knows why humans do what they do”, (David K. Reynolds), and because of this organizations can be unprepared for malicious, untrained, or even best intentioned behavior that can cause alarm and sometimes irreparable harm.\n\nThis course will introduce you to the types of training available to reduce the impact of the X-Factor, evaluate its effectiveness, explore the Security Education, Training and Awareness (SETA) program, and learn why it may fail. The course will conclude with information designed to assist you with some critical components for your business security program. Activities focused on hactivism, cyberinsurance, and ransomware will round out your knowledge base. Your team of instructors has prepared a series of readings, discussions, guest lectures, and quizzes to engage you in this exciting topic.","tutor":"Dr. Humayun Zafar, Dr. Traci Carte, Herbert J. Mattord, Ph.D., CISM, CISSP, CDP and Mr. Andy Green","provider":"Coursera","language":"English","skills":["human behavior","information security","cybersecurity","x-factor","usa","north america"],"subject":"Cybersecurity","studentsInterested":"85","courseLink":"https://www.coursera.org/learn/cybersecurity-and-x-factor","classCentralLink":"https://www.class-central.com/course/coursera-cybersecurity-and-the-x-factor-6585"},{"title":"Testing with Agile","about":"To deliver agile outcomes, you have to do more than implement an agile process; you have to create a culture of experimentation. It\u0027s this commitment to experimenting that\u0027s at the heart of a high-functioning practice of agile. This course shows you how to integrate the practice of experimentation across concept/feature testing, usability testing, and testing the software itself.\n\nBasically, you’ll learn how to answer these four big questions with experiments:\n1. Should we build it?\n2. Did it matter?\n3. Is it usable?\n4. Did it break?\n\nMore specifically, after completing this course, you’ll be able to:\n- Identify where and how to invest your team’s scarce time and energy into better testing for maximum impact on outcomes\n- Coach your team on the relationship between idea, usability, and software testing to get the buy-in you need for strong\ninterdisciplinary collaboration\n- Test ideas before you build them to avoid waste and help your team focus on what will really drive outcomes\n- Test alternative interface patterns before you build them to maximize both product usability and purposeful\nimplementation\n- Understand your delivery pipeline and how to prioritize process and infrastructure improvements so you can deliver faster\nand more often\n\nAs a Project Management Institute (PMI®) Registered Education Provider, the University of Virginia Darden School of Business has been approved by PMI to issue 20 professional development units (PDUs) for this course, which focuses on core competencies recognized by PMI. (Provider #2122)\n\nThis course is supported by the Batten Institute at UVA’s Darden School of Business. The Batten Institute’s mission is to improve the world through entrepreneurship and innovation: www.batteninstitute.org.","tutor":"Alex Cowan","provider":"Coursera","language":"English","skills":["software development","agile","usa","north america"],"subject":"DevOps","studentsInterested":"126","courseLink":"https://www.coursera.org/learn/uva-darden-agile-testing","classCentralLink":"https://www.class-central.com/course/coursera-testing-with-agile-6523"},{"title":"Nearest Neighbor Collaborative Filtering","about":"In this course, you will learn the fundamental techniques for making personalized recommendations through nearest-neighbor techniques. First you will learn user-user collaborative filtering, an algorithm that identifies other people with similar tastes to a target user and combines their ratings to make recommendations for that user. You will explore and implement variations of the user-user algorithm, and will explore the benefits and drawbacks of the general approach. Then you will learn the widely-practiced item-item collaborative filtering algorithm, which identifies global product associations from user ratings, but uses these product associations to provide personalized recommendations based on a user\u0027s own product ratings.","tutor":"Joseph A Konstan and Michael D. Ekstrand","provider":"Coursera","language":"English","skills":["usa","north america"],"subject":"Artificial Intelligence","studentsInterested":"42","courseLink":"https://www.coursera.org/learn/collaborative-filtering","classCentralLink":"https://www.class-central.com/course/coursera-nearest-neighbor-collaborative-filtering-6927"},{"title":"Building Arduino robots and devices","about":"For many years now, people have been improving their tools, studying the forces of nature and bringing them under control, using the energy of the nature to operate their machines. Last century is noted for the creation of machines which can operate other machines. Nowadays the creation of devices that interact with the physical world is available to anyone.\nOur course consists of a series of practical problems on making things that work independently: they make their own decisions, act, move, communicate with each other and people around, and control other devices. We will demonstrate how to assemble such devices and programme them using the Arduino platform as a basis.\nAfter this course, you will be able to create devices that read the data about the external world with a variety of sensors, receive and forward this data to a PC, the Internet and mobile devices, and control indexing and the movement. The creation of such devices will involve design, the study of their components, the assemblage of circuit boards, coding and diagnostics. Along with the creation of the devices themselves, you will perform visualization on a PC, create a web page that will demonstrate one of your devices, and figure out how an FDM 3D-printer is configured and how it functions.\nBesides those keen on robotics or looking to broaden their horizons and develop their skills, the course will also be useful to anyone facing the task of home and industrial automation, as well as to anyone engaged in industrial design, advertising and art.\nThe course does not require any special knowledge from the participants and is open even to students of upper secondary school. Programming skills and the level of English allowing to read technical documentation would be an advantage, but this is not obligatory.\nThe entire course is dedicated to practice, so the best way for you would be to get hold of some electronics, follow the illustrated examples and experiment on your own.\n\nThe kits can be purchased here: kits.cyberphysica.ru.\n\nTaught by: Alexey Perepelkin, head of Robotics department in the Laboratory of innovative educational technologies at MIPT\nTaught by: Dmitry Savitsky, researcher in the Laboratory of innovative educational technologies at MIPT","tutor":"Алексей Перепёлкин and Дмитрий Савицкий","provider":"Coursera","language":"English","skills":["russia","new-moocs-2017"],"subject":"Internet of Things","studentsInterested":"124","courseLink":"https://www.coursera.org/learn/arduino","classCentralLink":"https://www.class-central.com/course/coursera-building-arduino-robots-and-devices-7785"},{"title":"Enterprise System Management and Security","about":"The world runs on computers. Your watch, your TV, your car. You might be familiar on how to operate each of these. Your home computer you are even more familiar with operating it. But what does it take to really take computer systems to the next level? - The enterprise level. In this course we discuss what makes home computing systems different from enterprise computing systems. This course will also help you prepare and design your own home lab to explore enterprise operating systems.\n\nThis course is for anyone who is exploring what it might take to have a job as a system administrator or for those who are already specialized in one area of system management and would like to move to another. This course may also be for those who are looking to understand how computer security plays an important role in system management.\n\nAt the end of the course, you will also be able to illustrate how different enterprise technologies play role in computing at an enterprise level. You will also be able to discuss the three pillars of the CIA triad and how they apply to enterprise systems.\nWhile there is no technical and software component installs necessary for the completion of this course, supplemental how-to guides will be provided if you wish to follow along on the technical portion presented during the course.","tutor":"Greg Williams","provider":"Coursera","language":"English","skills":["enterprise systems","systems management","new-moocs-2017"],"subject":"Information Technology","studentsInterested":"77","courseLink":"https://www.coursera.org/learn/enterprise-system-management-security","classCentralLink":"https://www.class-central.com/course/coursera-enterprise-system-management-and-security-9318"},{"title":"Windows Server Management and Security","about":"Microsoft Windows has been at the forefront of enterprise computing for several decades. What most office workers see is the desktop side – such as Windows 7, 8 or 10. This course explores what it takes to design and build the server side of Windows in an enterprise environment. This course will explore everything from Windows Server installation to configuring users, to hardening the server operating system itself.\nThis course is the second course in the System Management and Security Specialization focusing on enterprise system management. The first week of this course provides an overview of how Windows operates in an enterprise environment and what it may look like in the real world. Week 2 of the course will show you how Windows users interact with the system. At the end of Week 2, you will be able to demonstrate how Windows authentication works at the end of Week 2. Week 3 will explore authorization in a Windows environment. At the end of Week 3, you will be able to differentiate between different authorization mechanisms and use different technologies to secure data within the environment. Week 4 explores built in security features of Windows and demonstrates how to use each technology effectively and in what circumstances you would use what technology for what purpose. At the end of week 4, you will be able to determine which technology is the best technology to use to secure certain portions of the Windows operating system.","tutor":"Greg Williams","provider":"Coursera","language":"English","skills":["security","windows server administration","new-moocs-2017"],"subject":"Information Technology","studentsInterested":"134","courseLink":"https://www.coursera.org/learn/windows-server-management-security","classCentralLink":"https://www.class-central.com/course/coursera-windows-server-management-and-security-9320"},{"title":"Applying Machine Learning to your Data with GCP","about":"Want to know how to query and process petabytes of data in seconds? Curious about data analysis that scales automatically as your data grows? Welcome to the Data Insights course!\n\nThis 1-week, accelerated online course teaches participants how to derive insights through data analysis and visualization using the Google Cloud Platform. The course features interactive scenarios and hands-on labs where participants explore, mine, load, visualize, and extract insights from diverse Google BigQuery datasets. The course covers data loading, querying, schema modeling, optimizing performance, query pricing, and data visualization.\n\nPREREQUISITES\nTo get the most out of this course, participants must complete the prior courses in this specialization:\n• Exploring and Preparing your Data\n• Storing and Visualizing your Data\n• Architecture and Performance","tutor":"Google Cloud Training","provider":"Coursera","language":"English","skills":["machine learning","google cloud","google bigquery"],"subject":"Machine Learning","studentsInterested":"18","courseLink":"https://www.coursera.org/learn/data-insights-gcp-apply-ml","classCentralLink":"https://www.class-central.com/course/coursera-applying-machine-learning-to-your-data-with-gcp-9685"},{"title":"A Developer\u0027s guide to Node-RED","about":"\u003e\u003e\u003e By enrolling in this course you agree to the End User License Agreement as set out in the FAQ. Once enrolled you can access the license in the Resources area \u003c\u003c\u003c\n\nRapid application development using agile methodologies and processes are increasingly being used when developing applications. There is pressure on development teams to reduce the time needed to convert an idea into a working solution, be it as part of an innovation workshop or hackathon, a prototype for a new solution idea or main stream development.\n\nDevelopers are looking for new ways to allow them to be more production and innovations, such as Node-RED from the JS Foundation is a technology that allows a developer to rapidly create applications, taking a fraction of the time need coding write code.\n\nNode-RED is built on Node.js, so will run anywhere capable of hosting node.js applications, such as small single board computers like the Raspberry Pi or Beaglebone, on your laptop or workstation or in cloud environments, such as the IBM Cloud.\n\nNode red allows developers to compose flows using a pallet of nodes, where each node provides prebuilt functionality, that can be connected to other nodes to rapidly construct an application.\n\nThis course assumes some basic knowledge of Node-RED, so if you have not used Node-RED then you may want to take a look at the Coursera course - A Developer’s Guide to the Internet of Things (https://www.coursera.org/learn/developer-iot/), which provides a beginner look at Node-RED.\n\nWhat you will learn:\nThe course will improve your use of Node-RED. It will introduce some more advanced features available in key nodes, show you how to visualise data using dashboard nodes. It shows you how to create web APIs using Node-RED and how to consume web services and how to make use of different storage technologies within a Node-RED flow. The last section of the course shows how you can extend Node-RED by creating your own nodes.\n\nWhat technology is required to complete the course?\nThe course requires you to have an IBM Cloud account, as some of the assignment work does make use of designated cloud services. You can create a free account on the IBM Cloud and in week 2 of the course we make a promotional code available, which unlocks some additional resources on the IBM Cloud, so you can complete the course without having to provide credit card information or pay for cloud services.","tutor":"Brian Innes, Nick O\u0027Leary, Maeve O\u0027Reilly and John Walicki","provider":"Coursera","language":"English","skills":["raspberry pi","node.js","internet of things","node red"],"subject":"Internet of Things","studentsInterested":"15","courseLink":"https://www.coursera.org/learn/developer-nodered","classCentralLink":"https://www.class-central.com/course/coursera-a-developer-s-guide-to-node-red-9806"},{"title":"Mathematics for Machine Learning: Multivariate Calculus","about":"This course offers a brief introduction to the multivariate calculus required to build many common machine learning techniques. We start at the very beginning with a refresher on the “rise over run” formulation of a slope, before converting this to the formal definition of the gradient of a function. We then start to build up a set of tools for making calculus easier and faster. Next, we learn how to calculate vectors that point up hill on multidimensional surfaces and even put this into action using an interactive game. We take a look at how we can use calculus to build approximations to functions, as well as helping us to quantify how accurate we should expect those approximations to be. We also spend some time talking about where calculus comes up in the training of neural networks, before finally showing you how it is applied in linear regression models. This course is intended to offer an intuitive understanding of calculus, as well as the language necessary to look concepts up yourselves when you get stuck. Hopefully, without going into too much detail, you’ll still come away with the confidence to dive into some more focused machine learning courses in future.","tutor":"Samuel J. Cooper, David Dye and A. Freddie Page","provider":"Coursera","language":"English","skills":["calculus","machine learning"],"subject":"Machine Learning","studentsInterested":"47","courseLink":"https://www.coursera.org/learn/multivariate-calculus-machine-learning","classCentralLink":"https://www.class-central.com/course/coursera-mathematics-for-machine-learning-multivariate-calculus-10452"},{"title":"Microservices - Fundamentals","about":"In enterprise environments, the architectural style of microservices is gaining momentum. In this course, you will learn why microservices are well-suited to modern cloud environments which require short development and delivery cycles. You will learn the characteristics of microservices. You will compare the microservice architecture with monolithic style, emphasizing why microservices are well suited to continuous delivery.\n\nWhile microservices are more modular to develop and may look simpler, you will discovery that the complexity does not go away, it shifts. An inevitable organizational complexity comes along with many small interacting pieces. Managing, monitoring, logging, and updating microservices creates a greater operational complexity. In this course you learn about the tools necessary to successfully deploy, manage and monitor microservice based applications.\n\nAfter taking this course, you will have a much better understanding of why microservices are so well suited to cloud environments, the DevOps environments in which microservices run and the tools to manage the complexity that microservices bring to the operational and production environment.","tutor":"Karen Durston and Steeve Chwojko","provider":"Coursera","language":"English","skills":["devops","microservices"],"subject":"DevOps","studentsInterested":"13","courseLink":"https://www.coursera.org/learn/intro-ibm-microservices","classCentralLink":"https://www.class-central.com/course/coursera-microservices-fundamentals-10370"},{"title":"Access Controls","about":"Welcome to Access Controls!\n\nThe Access Controls Course provides information pertaining to specify what users are permitted to do, the resources they are allowed to access, and what operations they are able to perform on a system. Access Controls help managers limit and monitor systems use at a user level or group membership. You will understand the different access control systems and how they should be implemented to protect the system and data using the different levels of confidentiality, integrity, and availability.\n\nThe Access Controls course provides information pertaining to specifying what users are permitted to do, the resources they are allowed to access, and what operations they are able to perform on a system. Access Controls help managers limit and monitor systems use at a user level, and is usually predefined based on authority level or group membership. You will understand the different access control systems and how they should be implemented to protect the system and data using the different levels of confidentiality, integrity, and availability.\n\nObjectives\n1. Describe how to implement Authentication mechanisms\n2. Identify and operate internetwork trust architectures\n3. Describe the process of administering identity management life cycle\n4. Implement the different types of access controls (Subject/Object based)","tutor":"(ISC)² Education \u0026 Training","provider":"Coursera","language":"English","skills":["information security","systems administration"],"subject":"Cybersecurity","studentsInterested":"9","courseLink":"https://www.coursera.org/learn/access-control-sscp","classCentralLink":"https://www.class-central.com/course/coursera-access-controls-10337"},{"title":"On Premises Capacity Upgrade and Monitoring with Google Cloud\u0027s Apigee API Platform","about":"This course helps you build understanding on key considerations for capacity planning and how to add and remove logical and physical capacity to the platform. Here you will learn how to add and remove logical elements such as Organizations, Environments and Virtual Hosts. It will also cover how to add new and remove components as well as how to add entire regions.\n\nThe course will also cover the Apigee API Platform\u0027s monitoring capabilities, how to organize ideas for quickly detect and address failure scenarios as well as how to reach out to Apigee support for help.","tutor":"Apigee Training Team","provider":"Coursera","language":"English","skills":["google","api\u0027s","google cloud","cloud administration"],"subject":"DevOps","studentsInterested":"26","courseLink":"https://www.coursera.org/learn/onprem-upgrade-apigee-gcp","classCentralLink":"https://www.class-central.com/course/coursera-on-premises-capacity-upgrade-and-monitoring-with-google-cloud-s-apigee-api-platform-10755"},{"title":"Intro to TensorFlow","about":"We introduce low-level TensorFlow and work our way through the necessary concepts and APIs so as to be able to write distributed machine learning models. Given a TensorFlow model, we explain how to scale out the training of that model and offer high-performance predictions using Cloud Machine Learning Engine.\n\nCourse Objectives:\nCreate machine learning models in TensorFlow\nUse the TensorFlow libraries to solve numerical problems\nTroubleshoot and debug common TensorFlow code pitfalls\nUse tf.estimator to create, train, and evaluate an ML model\nTrain, deploy, and productionalize ML models at scale with Cloud ML Engine","tutor":"Google Cloud Training","provider":"Coursera","language":"English","skills":["machine learning","google","tensorflow"],"subject":"Machine Learning","studentsInterested":"83","courseLink":"https://www.coursera.org/learn/intro-tensorflow","classCentralLink":"https://www.class-central.com/course/coursera-intro-to-tensorflow-11075"},{"title":"Методы и средства защиты информации","about":"Целью курса является ознакомление слушателей с основными понятиями защиты информации, основными принципами построения систем защиты информации, а также основными категориями мер защиты информации, их возможностями с точки зрения защиты информации, сильными и слабыми сторонами.\nВ процессе освоения курса слушатели получат навыки выбора решений из различных категорий методов и средств защиты информаций, соответствующих требованиям защиты информации в конкретных информационных системах, оценки соответствия существующих решений таким требованиям, разработки предложений по совершенствованию системы обеспечения информационной безопасности.\nДля освоения материала курса будут полезны основные знания из общего курса физики, высшей алгебры, теории чисел, информационных технологий. Их наличие позволит понять принципы действия криптографических средств защиты информации, средств технической защиты информации, а также цифровых стеганографических систем.\nВ качестве эксперта в курсе участвует Алексей Викторович Уривский, заместитель генерального директора по науке и инновациям компании ИнфоТеКС (ОАО «Информационные Технологии и Коммуникационные Системы») – отечественного разработчика и производителя средств защиты информации, действующего с 1989 года, являющегося одной из крупнейших компаний России в сфере защиты информации.","tutor":"Сорокин Александр Владимирович","provider":"Coursera","language":"Russian","skills":["information security","data"],"subject":"Cybersecurity","studentsInterested":"2","courseLink":"https://www.coursera.org/learn/metody-i-sredstva-zashity-informacii","classCentralLink":"https://www.class-central.com/course/coursera------9988"},{"title":"IT Automation: It’s not that scary!","about":"This course is designed to give you an introduction to concepts related to the automatic management of infrastructure in the IT industry. Using tools like scripting languages, version control, configuration management systems, and monitoring solutions, this course will give you an introduction to automation in IT. It will have an emphasis on creating automation that’s both scalable and manageable.\n\nBy the end of this course, you’ll be able to:\n* understand the fundamentals of programming using the Ruby language.\n* create basic automation scripts to perform system administration tasks.\n* use regular expressions to extract meaning from raw text.\n* manage code by using the version control system, Git.\n* develop and understand the benefits of tests for the scripts and automation they create.\n* deploy software using the Chef configuration management software and understand the principles of configuration management in the IT context.\n* track the health of technology systems through monitoring and become familiar with common monitoring concepts and practices\n\nBefore taking this course, it\u0027s helpful to be familiar with the following concepts:\n- installation of software on a computer platform\n- basic computer network terminology and concepts\n- common system administrator tasks and responsibilities\n\nThis course has been designed to be completed completely in-browser. You don’t have to install any software on your computer. However, supplemental readings and instructions are provided, where appropriate, if you want to install the software and tools that we discuss in order to experiment on your own systems.\n\nExcept as otherwise noted, the contents on this site are licensed under a Creative Commons Attribution-ShareAlike 4.0 International License.","tutor":"Google","provider":"Coursera","language":"English","skills":["devops","automation","it"],"subject":"DevOps","studentsInterested":"47","courseLink":"https://www.coursera.org/learn/it-automation","classCentralLink":"https://www.class-central.com/course/coursera-it-automation-it-s-not-that-scary-10217"},{"title":"Data Analytics Foundations for Accountancy II","about":"Welcome to Data Analytics Foundations for Accountancy II! I\u0027m excited to have you in the class and look forward to your contributions to the learning community.\n\nTo begin, I recommend taking a few minutes to explore the course site. Review the material we’ll cover each week, and preview the assignments you’ll need to complete to pass the course. Click Discussions to see forums where you can discuss the course material with fellow students taking the class.\n\nIf you have questions about course content, please post them in the forums to get help from others in the course community. For technical problems with the Coursera platform, visit the Learner Help Center.\n\nGood luck as you get started, and I hope you enjoy the course!","tutor":"Robert Brunner","provider":"Coursera","language":"English","skills":["machine learning","data analysis"],"subject":"Machine Learning","studentsInterested":"36","courseLink":"https://www.coursera.org/learn/data-analytics-accountancy-2","classCentralLink":"https://www.class-central.com/course/coursera-data-analytics-foundations-for-accountancy-ii-10515"}]