[{"title":"Coding in your Classroom, Now!","about":"Questo corso è ambizioso e semplicissimo. Ha l’obiettivo di aiutarti ad introdurre il pensiero computazionale in classe attraverso il coding, usando solo attività intuitive e divertenti da proporre direttamente agli alunni.\nQuando affrontiamo un problema o abbiamo un’idea, spesso intuiamo la soluzione ma non siamo in grado di formularla in modo operativo per metterla in pratica. Il pensiero computazionale è proprio questo, la capacità di immaginare e descrivere un procedimento costruttivo che porti alla soluzione. Come imparare a parlare ci aiuta a formulare pensieri complessi, così il pensiero computazionale ci offre strumenti ulteriori a supporto della fantasia e della creatività.\nPer questo il pensiero computazionale è per tutti. E’ una capacità trasversale che va sviluppata il prima possibile. Non è solo per informatici e programmatori, ma programmare è il modo migliore per acquisirlo. Per questo in Europa e nel mondo si svolgono ogni anno campagne di alfabetizzazione per la diffusione del coding. E’ per questa stessa ragione che noi parleremo di coding e giocheremo con la programmazione senza ripeterci ogni volta che lo facciamo per sviluppare il pensiero computazionale. Quello accadrà da sé senza bisogno di dirlo.\nVeniamo al metodo. Questo corso non è concepito per introdurre metodi e concetti che in qualche futuro potranno esservi utili in classe, ma per aiutarvi ad organizzare attività di coding in classe direttamente durante il MOOC. La maggior parte delle lezioni di questo MOOC sono appuntamenti in diretta streaming che potrete seguire in classe con gli alunni, mettendovi in gioco insieme a loro. Non occorre che abbiate dimestichezza con l’informatica, le attività proposte sono intuitive e divertenti e nei video farò del mio meglio per darvi spunti di riflessione ulteriori. Se non riuscirete ad organizzarvi per seguire le lezioni in diretta potrete sempre riusarle successivamente.","tutor":"Alessandro Bogliolo","provider":"EMMA","language":"Italian","skills":["teaching","europe","italy","programming","computational thinking"],"subject":"STEM","studentsInterested":"430","courseLink":"https://platform.europeanmoocs.eu/course_coding_in_their_classrooms_now","classCentralLink":"https://www.class-central.com/course/emma-coding-in-your-classroom-now-5652"},{"title":"Understanding IELTS: Techniques for English Language Tests","about":"##\nAnyone thinking about taking an English language test, such as IELTS, will find this course particularly useful, but all English language learners will benefit from the tips and advice given in the course.\nThe course focuses on the IELTS test (International English Language Testing System). IELTS is the world’s most popular English language test for higher education and global migration. IELTS is accepted by over 10,000 organisations worldwide including universities, employers, immigration authorities and professional bodies. Over 3 million IELTS tests were taken globally last year.\nThis course will take you through each stage of the IELTS test — reading, writing, speaking and listening. At each stage there will be advice from our video tutor and a team of experienced IELTS educators. You will also be asked to share your experiences, tips and opinions with other learners.\nBy the end of the Understanding IELTS course, you will:\nbe familiar with all parts of the IELTS test\nhave some useful tips to help you achieve your IELTS goals\nunderstand how the IELTS test is assessed\nhave an opportunity to have your written and spoken English assessed by other learners\nThe British Council has over 80 years’ experience in English language teaching and assessment and delivers IELTS tests in more than 100 countries. The course draws on the British Council’s expertise in online learning.","tutor":"Chris Cavey","provider":"FutureLearn","language":"English","skills":[],"subject":"Test Prep","studentsInterested":"475","courseLink":"https://www.futurelearn.com/courses/understanding-ielts","classCentralLink":"https://www.class-central.com/course/futurelearn-understanding-ielts-techniques-for-english-language-tests-3301"},{"title":"Teaching Character and Creating Positive Classrooms","about":"Positive psychology meets K-12 pedagogy. This course explores key ideas of positive psychology and shows how great teachers apply those lessons to maximize student engagement and accomplishment. Through lectures, discussions, interviews and footage of great educators in action, you’ll learn how to integrate character-based objectives into your own teaching.","tutor":"Dave Levin","provider":"Coursera","language":"English","skills":["education","classroom behavior","classroom teaching","teacher training","usa","north america"],"subject":"Teacher Development","studentsInterested":"4.7k","courseLink":"https://www.coursera.org/learn/teaching-character","classCentralLink":"https://www.class-central.com/course/coursera-teaching-character-and-creating-positive-classrooms-866"},{"title":"Leaders of Learning","about":"All of us carry explicit or implicit theories of learning. They manifest themselves in the ways we learn, the ways we teach, and the ways we think about leadership and learning.\nIn Leaders of Learning, you will identify and develop your personal theory of learning, and explore how it fits into the shifting landscape of learning. This isn’t just about schools, it’s about the broader and bigger world of learning.\nThe education sector is undergoing great transformation, and in the coming decades will continue to change. How we learn, what we learn, where we learn, and why we learn; all these questions will be reexamined. In Leaders of Learning we will explore learning, leadership, organizational structure, and physical design.\nHarvardX requires individuals who enroll in its courses on edX to abide by the terms of the edX honor code. HarvardX will take appropriate corrective action in response to violations of the edX honor code, which may include dismissal from the HarvardX course; revocation of any certificates received for the HarvardX course; or other remedies as circumstances warrant. No refunds will be issued in the case of corrective action for such violations. Enrollees who are taking HarvardX courses as part of another program will also be governed by the academic policies of those programs.\nHarvardX pursues the science of learning. By registering as an online learner in an HX course, you will also participate in research about learning. Read our research statement to learn more.\nHarvard University and HarvardX are committed to maintaining a safe and healthy educational and work environment in which no member of the community is excluded from participation in, denied the benefits of, or subjected to discrimination or harassment in our program. All members of the HarvardX community are expected to abide by Harvard policies on nondiscrimination, including sexual harassment, and the edX Terms of Service. If you have any questions or concerns, please contact and/or .","tutor":"Trudy Van Houten","provider":"edX","language":"English","skills":["harvardx"],"subject":"Education \u0026 Teaching","studentsInterested":"2.7k","courseLink":"https://www.edx.org/course/leaders-learning-harvardx-gse2x-2","classCentralLink":"https://www.class-central.com/course/edx-leaders-of-learning-2027"},{"title":"Applying to U.S. Universities","about":"“It depends.” That is what you’ll hear when asking about the U.S. university admission process. With over 4,000 universities in the United States and no standard application system, the U.S. admission process can be confusing for everyone, but especially for students applying from other countries.\n\nThis course will help international students (non-U.S. citizens) and non-native English speakers navigate the U.S. university admission process by offering practical information about the documents and pieces that make up a U.S. university application. More importantly, admission officers will discuss how they use those pieces to decide who is accepted and who is denied, so that you can understand the process beyond the pieces.\n\nBy the end of this course, you will understand application basics that include researching schools, creating a school list, and establishing an application plan. This course will not answer all of your application questions, but it will teach you to ask the right questions of yourself and the universities. Ultimately, you will have all the information you need to start your process the right way, putting you on the path to acceptance.\n\n* Please note, while the English Language Programs are part of the University of Pennsylvania, this is not a course about applying to Penn. Furthermore, this course is intended for international students educated in the national curriculum of their country. While other students are welcome to enroll, the course is not intended for American students or students studying in an American, International Baccalaureate, or Advanced Placement curriculum. The course is also intended for students who do not have access to university counseling – if you attend a school that offers university counseling, your counselor is the best source of information on applying to university. Finally, this course is for undergraduate (Bachelors degree) freshmen (students who have not attended any university) applicants. Undergraduate transfer applicants, students who have attended a university, will find some of the information helpful, but graduate (Masters and Doctoral) applicants will not.","tutor":"Erick Hyde","provider":"Coursera","language":"English","skills":["usa","north america"],"subject":"Higher Education","studentsInterested":"305","courseLink":"https://www.coursera.org/learn/study-in-usa","classCentralLink":"https://www.class-central.com/course/coursera-applying-to-u-s-universities-1620"},{"title":"American Education Reform: History, Policy, Practice","about":"Discover what shapes how we talk about schools today by exploring the history of U.S. education reform. Engage with the main actors, key decisions, and major turning points in this history. See how social forces drive reform. Learn about how the critical tensions embedded in U.S. education policy and practice apply to schools nationally, globally— and where you live.","tutor":"John Puckett and Michael Johanek","provider":"Coursera","language":"English","skills":["usa","north america"],"subject":"Education \u0026 Teaching","studentsInterested":"1.5k","courseLink":"https://www.coursera.org/learn/edref","classCentralLink":"https://www.class-central.com/course/coursera-american-education-reform-history-policy-practice-2793"},{"title":"Techniques for Teaching Adjectives and Adjective Clauses","about":"This is the second course in the Teach English: Intermediate Grammar specialization. In this course, you will learn how to effectively teach adjectives, adjective phrases, and adjective clauses to your students. You will learn what makes this grammar difficult for students and how to make it easier for them. You will also learn a variety of activities and methods for teaching this content in a fun and interesting way. You will have opportunities to practice the skills you learn by creating sample assignments and recording short videos of your teaching demonstrations. This course is designed for teachers or those wanting to become teachers who have a solid understanding of English grammar and want to improve their skills of teaching that grammar to others.\n\nPlease note that the free version of this class gives you access to all of the instructional videos and handouts. The peer feedback and quizzes are only available in the paid version.","tutor":"Tamy Chapman and Judy Hu","provider":"Coursera","language":"English","skills":["usa","north america"],"subject":"Education \u0026 Teaching","studentsInterested":"97","courseLink":"https://www.coursera.org/learn/teaching-adjective-clauses","classCentralLink":"https://www.class-central.com/course/coursera-techniques-for-teaching-adjectives-and-adjective-clauses-7366"},{"title":"Get Interactive: Practical Teaching with Technology","about":"This course is designed to help you create dynamic, interactive online courses through the use of multimedia tools, student collaboration opportunities, and formative assessment and feedback.\n\nEach week we will focus on a particular topic:\n\n1. Using multimedia for teaching and learning\n2. Encouraging student collaboration\n3. Formative assessment and feedback\n\nYou will have a range of materials to read, videos to watch, topics to research, activities to perform, discussions to participate in, and an assessment to complete. In addition, you will have a random assignment of fellow participants\u0027 assessments to mark in order to receive your own mark. While most of the videos and activities are mandatory, we have included a number of \"Take it Further\" activities and longer versions of videos that are voluntary.\n\nAt first glance, It may seem like a lot, but you will quickly find that many activities will take just minutes to perform. The emphasis in this MOOC is on gaining a wide range of experience in order to decide for yourself which tools and techniques to explore in more depth.\n\nAlthough we introduce a few concepts along the way, this is a very practical course. You will be assessed according to what you create and share. We hope you will enjoy the active, hands-on nature of this course and find many ideas to incorporate in your teaching.","tutor":"Sarah Sherman, Nancy Weitz and Eileen Kennedy","provider":"Coursera","language":"English","skills":["new-moocs-2017"],"subject":"Education \u0026 Teaching","studentsInterested":"88","courseLink":"https://www.coursera.org/learn/getinmooc","classCentralLink":"https://www.class-central.com/course/coursera-get-interactive-practical-teaching-with-technology-8415"},{"title":"Making Teacher Education Relevant for 21st Century Africa","about":"Help African teachers use active learning and ICT in the classroom\nMajor changes are needed in African schools to raise achievement and cope with rapidly increasing student numbers. Learner-centred approaches, improved internet connectivity and the recent UNESCO ICT competency framework provide opportunities to do this.\nThis online course will help those who work with or train teachers in Africa make these changes happen. You’ll find out how to incorporate open educational resources (OERs) into teacher education, and help teachers use active learning and ICT.\nThis course is aimed at anyone who works with or trains pre-service or in-service teachers in Africa, including teacher educators, headteachers, education officers, lecturers, tutors, and teachers working together to provide peer-support. You’ll learn with The Open University’s TESSA network, which has provided free, digital resources to African teachers since 2008.","tutor":"Kris Stutchbury","provider":"FutureLearn","language":"English","skills":["education","teaching","africa","new-moocs-2017"],"subject":"Teacher Development","studentsInterested":"33","courseLink":"https://www.futurelearn.com/courses/teacher-education-africa","classCentralLink":"https://www.class-central.com/course/futurelearn-making-teacher-education-relevant-for-21st-century-africa-9122"},{"title":"ICT in Primary Education: Transforming children\u0027s learning across the curriculum","about":"Why and how are teachers integrating ICT (Information and Communication Technology) into primary education? In this course we analyse examples from schools in different parts of the world, and bring professional teachers, headteachers and policymakers together to share their best ideas and inspiring stories.\n\nThe materials in the course are based on studies carried out for the UNESCO Institute of IT in Education, Moscow.\n\nLearning Outcomes:\nto be aware of the range of reasons for using ICT\nto critique the strategies for developing ICT over time\nto analyse the strengths and weakness of different decision-making mechanisms\nto become familiar with a wider range of useful tools and resources for integrating ICT","tutor":"Diana Laurillard","provider":"Coursera","language":"English","skills":["europe","england"],"subject":"Education \u0026 Teaching","studentsInterested":"250","courseLink":"https://www.coursera.org/learn/ict-primary-education","classCentralLink":"https://www.class-central.com/course/coursera-ict-in-primary-education-transforming-children-s-learning-across-the-curriculum-1763"},{"title":"Studying at Japanese Universities","about":"Are you interested in studying at Japanese universities?\nDo you want to learn about Japan’s university application and enrollment processes, as well as the types of programs on offer?\n\nThis course will help you to both discover great programs offered by different Japanese universities and prepare a study plan through project-based learning.\n\nWe introduce a number of options to match a variety of goals, from full degree to non-degree programs, programs taught in English, as well as short-term programs in Japan. During the course, international students at UTokyo will provide you with useful information and advice to start you on the path to studying in Japan.\n\nAt the end of this course, you will produce a draft of your action plan for applying to Japanese universities.\nThe overall goal of the course is to start you off on the right foot to a happy, productive and fulfilling student life in Japan!","tutor":"Yujin Yaguchi and Yuko Itatsu","provider":"Coursera","language":"English","skills":["japan","asia"],"subject":"Higher Education","studentsInterested":"44","courseLink":"https://www.coursera.org/learn/study-in-japan","classCentralLink":"https://www.class-central.com/course/coursera-studying-at-japanese-universities-7172"},{"title":"Fundamentals of Engineering Exam Review","about":"The purpose of this course is to review the material covered in the Fundamentals of Engineering (FE) exam to enable the student to pass it. It will be presented in modules corresponding to the FE topics, particularly those in Civil and Mechanical Engineering. Each module will review main concepts, illustrate them with examples, and provide extensive practice problems.","tutor":"Philip Roberts","provider":"Coursera","language":"English","skills":["engineering","fe exam","usa","north america"],"subject":"Test Prep","studentsInterested":"39","courseLink":"https://www.coursera.org/learn/fe-exam","classCentralLink":"https://www.class-central.com/course/coursera-fundamentals-of-engineering-exam-review-4434"},{"title":"Orchestrating Whole Classroom Discussion","about":"This course offers strategies that can lead to richer, more productive, whole-class discussions in their classrooms. Focusing on how to prepare for discussion, this course is for anyone who leads, wants to lead, or is interested in how teachers lead discussion.\n\nAcross the 4 sessions in this course, we’ll learn more about what teachers and students need to do to prepare for rich discussions, including understanding:\n\n1. What is (and isn\u0027t) discussion, and why discussion is important\n2. How teachers set goals for discussion, and establish explicit norms that support these objectives\n3. How teachers select texts and prepare text-based questions to guide the conversation\n4. How teachers – based on these goals, norms, texts, and questions – then prepare students for the whole-class discussion\n\nThe course consists of short videos interspersed with various thinking tasks—such as reflecting on videos of classroom discussions in action, and designing and receiving peer feedback on aspects of a Discussion Plan, a plan for a discussion you’ll lead in your own classroom.","tutor":"Pam Grossman and Lisa M. Barker","provider":"Coursera","language":"English","skills":["usa","north america","new-moocs-2017"],"subject":"Education \u0026 Teaching","studentsInterested":"230","courseLink":"https://www.coursera.org/learn/classdiscussion","classCentralLink":"https://www.class-central.com/course/coursera-orchestrating-whole-classroom-discussion-7421"},{"title":"Introducción al Aprendizaje Universitario","about":"Este es un MOOC introductorio al aprendizaje universitario, a través del cual, el estudiante podrá conocer aspectos fundamentales que intervienen en el aprendizaje y rendimiento académico universitario. Representa a la vez una oportunidad para reflexionar sobre el propio quehacer académico como estudiante, así como una instancia para conocer distintas herramientas que promueven mejores prácticas en el contexto del estudio.","tutor":"Angélica Bustos and María José Anais","provider":"Coursera","language":"Spanish","skills":["higher education","university studies"],"subject":"Higher Education","studentsInterested":"11","courseLink":"https://www.coursera.org/learn/aprendizaje-universitario-introduccion","classCentralLink":"https://www.class-central.com/course/coursera-introduccion-al-aprendizaje-universitario-10749"},{"title":"e-Learning Ecologies: Innovative Approaches to Teaching and Learning for the Digital Age","about":"For three decades and longer we have heard educators and technologists making a case for the transformative power of technology in learning. However, despite the rhetoric, in many ways and at most institutional sites, education is still relatively untouched by technology. Even when technologies are introduced, the changes sometimes seem insignificant and the results seem disappointing. If the print textbook is replaced by an e-book, do the social relations of knowledge and learning necessarily change at all or for the better? If the pen-and-paper test is mechanized, does this change the nature of our assessment systems? Technology, in other words, need not necessarily bring significant change. Technology might not even represent a step forward in education.\n\nBut what might be new? How can we use technologies to innovate in education?\n\nThis course explores seven affordances of e-learning ecologies, which open up genuine possibilities for what we call New Learning – transformative, 21st century learning:\n\n1. Ubiquitous Learning\n2. Active Knowledge Making\n3. Multimodal Meaning\n4. Recursive Feedback\n5. Collaborative Intelligence\n6. Metacognition\n7. Differentiated Learning\n\nThese affordances, if recognized and harnessed, will prepare learners for success in a world that is increasingly dominated by digital information flows and tools for communication in the workplace, public spaces, and personal life. This course offers a wide variety of examples of learning technologies and technology implementations that, to varying degrees, demonstrate these affordances in action.\n\n--------------------------------\nRecommended Background\n--------------------------------\n\nThis course is designed for people interested in the future of education and the \"learning society,\" including people who may wish to join education as a profession, practicing teachers interested in exploring future directions for a vocation that is currently undergoing transformation, and community and workplace leaders who regard their mission to be in part \"educative.\"\n\n--------------------------------\nTake this Course for Credit at the University of Illinois\n--------------------------------\n\nThis course has the same content and anticipates the same level of contribution by students in the e-Learning Ecologies course offered to graduate certificate, masters, and doctoral level students in the College of Education at the University of Illinois.\n\nOf course, in the nature of MOOCs many people will just want to view the videos and casually join some of the discussions. Some people say that these limited kinds of participation offer evidence that MOOCs suffer from low retention rates. Far from it – we say that any level of engagement is good engagement.\n\nOn the other hand, if you would like to take this course for credit at the University of Illinois, apply here: http://education.illinois.edu/online-offcampus/programs-degrees/ldl-online If you have already taken this course in Coursera, you can prepare a portfolio of work created there and request that this work is taken into account for your University of Illinois course.","tutor":"William Cope and Mary Kalantzis","provider":"Coursera","language":"English","skills":["education","education technology","e-learning","digital learning","usa","north america"],"subject":"Online Education","studentsInterested":"281","courseLink":"https://www.coursera.org/learn/elearning","classCentralLink":"https://www.class-central.com/course/coursera-e-learning-ecologies-innovative-approaches-to-teaching-and-learning-for-the-digital-age-2066"},{"title":"Literacy Teaching and Learning: Aims, Approaches and Pedagogies","about":"This course opens with an exploration of the social context and aims of literacy teaching and learning. It goes on to describe a range of historical and contemporary approaches to literacy pedagogy, including didactic, authentic, functional, and critical approaches. The course takes has a \u0027Multiliteracies\u0027 perspective, which aims to expand the definition of literacy to encompass today\u0027s multimodal communications, and the diversity of literacies across different social and culltural contexts. A Multiliteracies approach also suggests a broad range of activity types—experiential, conceptual, analytical and critical.\n\n--------------------------------\nRecommended Background\n--------------------------------\n\nThis course is designed for people interested in literacy teaching and learning, including people who may wish to join education as a profession, practicing teachers interested in exploring future directions for a vocation that is currently undergoing transformation, and community and workplace leaders who regard their mission to be in part \"educative.\"\n\n--------------------------------\nTake this Course for Credit at the University of Illinois.\n--------------------------------\n\nThis course has the same content and anticipates the same level of contribution by students in the \u0027New Media and Literacies\u0027 course offered to graduate certificate, masters and doctoral level students in the College of Education at the University of Illinois.\n\nOf course, in the nature of MOOCs many people will just want to view the videos and casually join some of the discussions. Some people say that these limited kinds of participation offer evidence that MOOCs suffer from low retention rates. Far from it - we say that any level of engagement is good engagement.\n\nOn the other hand, if you would like to take this course for credit at the University of Illinois, apply here: http://education.illinois.edu/online-offcampus/programs-degrees/ldl-online If you have already taken this course in Coursera, you can prepare a portfolio of work created there and request that this work is taken into account for your University of Illinois course.","tutor":"William Cope and Mary Kalantzis","provider":"Coursera","language":"English","skills":["pedagogy","literacy","usa","north america"],"subject":"Teacher Development","studentsInterested":"145","courseLink":"https://www.coursera.org/learn/literacy-teaching-learning","classCentralLink":"https://www.class-central.com/course/coursera-literacy-teaching-and-learning-aims-approaches-and-pedagogies-6760"},{"title":"Virtual Teacher Final Project","about":"The Final Project will be a hands-on, comprehensive project that practitioners of virtual education can implement in their profession. For this final project, learners will draft a design plan for an online learning module utilizing materials learned from the virtual teacher series. Learners will choose the subject matter, method of delivery, tools, instructional strategies, and assessments, with the goal of creating a module of online or blended instruction that meets the needs of their students. Learners do not have to create, develop or teach the online learning module they design.\n\nUpon completing this course, you will be able to:\n1. Design a fully online or blended instructional module\n2. Apply theories and/or strategies of effective online instruction","tutor":"Victoria Roth O\u0027Neal","provider":"Coursera","language":"English","skills":["capstone","usa","north america","virtual teaching"],"subject":"Teacher Development","studentsInterested":"12","courseLink":"https://www.coursera.org/learn/virtual-teacher-capstone","classCentralLink":"https://www.class-central.com/course/coursera-virtual-teacher-final-project-6239"},{"title":"Teaching Tips for Tricky English Grammar","about":"This is the third course in the Teach English: Intermediate Grammar specialization. It will be useful to ESL teachers or those interested in learning to teach English language, but it is not an introduction to teaching course. You will learn about some specific problems students have learning intermediate grammar. You will learn why students have trouble with this tricky grammar and find out new ways to help students conquer it. You will also learn a variety of activities for teaching this content in a fun and interesting way. Finally, you will have opportunities to practice the skills you learn by creating sample assignments and recording short videos of your teaching demonstrations using a video camera, webcam, or smartphone. Learners wanting a grade will be required to submit short videos of their teaching skills.\n\nOnly learners who pay for the course will be able to take the graded quizzes or submit assignments for feedback. The free version provides access to the lectures and practice activities only.","tutor":"Tamy Chapman","provider":"Coursera","language":"English","skills":["usa","north america"],"subject":"Education \u0026 Teaching","studentsInterested":"144","courseLink":"https://www.coursera.org/learn/teaching-common-grammar-mistakes","classCentralLink":"https://www.class-central.com/course/coursera-teaching-tips-for-tricky-english-grammar-7364"},{"title":"Aboriginal Worldviews and Education","about":"Intended for both Aboriginal and non-Aboriginal learners, this course will explore indigenous ways of knowing and how they can benefit all students. Topics include historical, social, and political issues in Aboriginal education; terminology; cultural, spiritual and philosophical themes in Aboriginal worldviews; and how Aboriginal worldviews can inform professional programs and practices, including but not limited to the field of education.","tutor":"Jean-Paul Restoule","provider":"Coursera","language":"English","skills":["canada","north america"],"subject":"Education \u0026 Teaching","studentsInterested":"963","courseLink":"https://www.coursera.org/learn/aboriginal-education","classCentralLink":"https://www.class-central.com/course/coursera-aboriginal-worldviews-and-education-394"},{"title":"Teach English Now! Technology Enriched Teaching","about":"This course focuses on the key concepts you need in order to effectively integrate technology into your teaching, without letting it overshadow language learning. Discover current and future trends in educational technology, along with strategies for implementing these trends in the classroom and beyond. As technology is continually evolving, learn how to keep up on current technological applications through professional development networks and training opportunities.","tutor":"Jessica Cinco, Dr. Shane Dixon and Dr. Justin Shewell","provider":"Coursera","language":"English","skills":["english","technology enhanced teaching","usa","north america"],"subject":"Course Development","studentsInterested":"115","courseLink":"https://www.coursera.org/learn/tesol-technology","classCentralLink":"https://www.class-central.com/course/coursera-teach-english-now-technology-enriched-teaching-6211"},{"title":"Teaching for Success: Learning and Learners","about":"Learn with English language teachers worldwide\nThis free online course is for English language teachers around the world. It will help you develop the skills and practices you need for your continuing professional development (CPD).\nIn this course you will look at four professional practices:\nUnderstanding learners\nKnowing the subject\nUsing inclusive practices\nAssessing learning\nShort video interviews with experienced teachers will be combined with classroom films from around the world to illustrate the main points.\nVideo tutors will guide you through each week, offering tips, advice and downloadable resources.\nThe course is aimed at teachers of English as a foreign language at all levels. Intermediate level English (around B1 on the CEFR) is required.\nThe course draws on the British Council’s many years of expertise in teacher training and development around the world. It will be useful for teachers of English at primary, secondary or higher levels.\nYou will be asked to share your experiences and opinions as you become part of a global community of English language teachers.","tutor":"Claire Ross","provider":"FutureLearn","language":"English","skills":["english teaching","esl","cpd"],"subject":"Teacher Development","studentsInterested":"88","courseLink":"https://www.futurelearn.com/courses/english-language-teaching-learning","classCentralLink":"https://www.class-central.com/course/futurelearn-teaching-for-success-learning-and-learners-6379"},{"title":"Critical Thinking Skills for University Success","about":"In this course, you will learn how to develop your Critical Thinking Skills to help you achieve success in your university studies. After completing this course, you will be able to:\n\n1. Use critical thinking and argumentation in university contexts to improve academic results\n\n2. Understand the importance and function of critical thinking in academic culture\n\n3. Use a variety of thinking tools to improve critical thinking\n\n4. Identify types of argument, and bias within arguments, in order to better evaluate the strength of arguments\n\n5. Use evidence to support claims in arguments\n\n6. Apply critical thinking and argumentation to real world problems and issues","tutor":"Katherine Olston","provider":"Coursera","language":"English","skills":["critical thinking","university studies","australia"],"subject":"Higher Education","studentsInterested":"118","courseLink":"https://www.coursera.org/learn/critical-thinking-skills","classCentralLink":"https://www.class-central.com/course/coursera-critical-thinking-skills-for-university-success-6689"},{"title":"Leading for Equity, Diversity and Inclusion in Higher Education","about":"This course is open to professionals interested in learning more about leadership in higher education for a changing demographic or interested in developing their own leadership skills. The very idea that individuals can be taught to lead is not without its skeptics. Reasonable people, even some scholars in the field, point to the important traits, skills, and attributes that are observed in many visible leaders and contend that certain qualities necessary for effective leadership are not easily transmitted. To accept this premise and conclude that some people are born as natural leaders and others cannot be expected to lead at all is to make a mistake at the other end of the logical spectrum. We believe that leadership can be taught as long as it is concurrently nurtured, that most people possess a constellation of strengths around which they can construct their own leadership philosophy and approach, and that leadership development programming—if done well—can be transformative for organizers and participants.\n\nCourse Level Objectives:\nUnderstand the historical narrative of institutions as well as institutional structures that have created instances of inclusion and exclusion in colleges and universities.\nDescribe how transformational leadership is enacted for diversity, equity, and inclusion in a complex and contested environment.\nCompare legislative, governance, and public accountability and expectations in relation to contemporary issues in higher education.\nAnalyze the strategic diversity planning process and documents of a selected institution.\nRecommend innovations and opportunities for transformational change at various levels of the ecological model using the strategic diversity planning process as a tool.","tutor":"Dr. John C. Burkhardt","provider":"Coursera","language":"English","skills":["higher education","diversity","school administration","new-moocs-2017"],"subject":"Higher Education","studentsInterested":"71","courseLink":"https://www.coursera.org/learn/leading-for-equity-diversity-inclusion","classCentralLink":"https://www.class-central.com/course/coursera-leading-for-equity-diversity-and-inclusion-in-higher-education-8736"},{"title":"Learning Online: Reflecting and Sharing","about":"##\nIn this course, you’ll be introduced to some of the tools you can use to help you reflect on your learning; such as short tests and quizzes or online logs and journals. You will then move on to focus on sharing your learning with others. By producing and sharing video, using blogs, pin-boards, collaborative platforms or social media you can enrich the learning experience.\nThis course is just one of a series about ‘learning online’, which introduces you to the essential skills and tools you need to study online.\nThis course is part of the Going to University collection which has been specifically designed for schools and colleges. The course can be used as a teachers’ classroom enrichment resource or can be studied independently by students.","tutor":"Carol Elston and Neil Morris","provider":"FutureLearn","language":"English","skills":["europe","online learning","uk"],"subject":"Online Education","studentsInterested":"199","courseLink":"https://www.futurelearn.com/courses/reflecting-and-sharing","classCentralLink":"https://www.class-central.com/course/futurelearn-learning-online-reflecting-and-sharing-5017"},{"title":"Teaching Practical Science: Biology","about":"Improve student learning in biology practical lessons\nThere are only so many ways a student can look at an onion cell, so how do we engage students with biology practicals?\nOn this course you will discuss the relationship between theoretical concepts and practical work, and consider closely what is happening in your own classroom during biology practicals.\nYou will also develop and share creative ways of teaching practical biology with approaches that are applicable to a range of situations including GCSE required practicals.\nThe course has been designed as CPD for teachers of science subjects for 14-16 year olds. Teachers of biology, early career teachers, returning teachers, non-specialist teachers, technicians and teaching assistants will gain from the peer learning and resources available on this course.\nLearn from national CPD subject leaders, the experience of other teachers and access high quality supporting resources throughout this course.\nAccess to a laboratory is recommended in order for you to evaluate approaches to practical work during this course.","tutor":"Matt Cornock","provider":"FutureLearn","language":"English","skills":["biology","stem","new-moocs-2017"],"subject":"STEM","studentsInterested":"30","courseLink":"https://www.futurelearn.com/courses/teaching-practical-science-biology","classCentralLink":"https://www.class-central.com/course/futurelearn-teaching-practical-science-biology-9115"},{"title":"Cómo hacer una tesis","about":"El participante en proceso de titulación o que están finalizando estudios universitarios, será capaz de elaborar una tesis en seis meses; por medio de las herramientas adquiridas en cada módulo, a fin de que las conjuguen con los conocimientos, habilidades y aptitudes con que cuentan e impulsando sus capacidades de investigación.","tutor":"Felipe de la O López","provider":"Coursera","language":"Spanish","skills":["thesis","university studies","new-moocs-2017"],"subject":"Higher Education","studentsInterested":"22","courseLink":"https://www.coursera.org/learn/como-hacer-una-tesis","classCentralLink":"https://www.class-central.com/course/coursera-como-hacer-una-tesis-9595"},{"title":"Промышленность, инженерное образование и наука: история и перспективы","about":"Курс является одной из первых попыток дать системный анализ развития промышленности, научного и инженерного образования, прикладных исследований с использованием одновременно историко-научного материала, современных сравнительно-экономических данных, системного анализа истории технологий. Системный исторический анализ проводится с целью найти решения для сегодняшнего дня. Автор является одновременно специалистом в истории науки и технологий и действующим руководителем современного научно-производственного предприятия в области новейших производственных технологий.\nПрограмма курса состоит из 5 недель. В течение первой недели речь пойдет об инженерном образовании в России, истории его появления и перспективах. На второй неделе мы поговорим о так называемых \"Технологических эпохах\" в мировой и Российской истории, и увидим, в каком пространстве создаются и развиваются новые технологии. В третьей и четвертой неделях вы узнаете о важной связи гуманитарного и технического образования, о \"Великих эпохах\" русской науки, а также о том, как взаимодействуют наука и технологии.После краткого экскурса в историю, вам предстоит подумать и понять,что же нас ожидает в будущем, и каким образом действовать сейчас, чтобы в новом научно-технологическом укладе Россия оказалась в числе лидеров.","tutor":"Сапрыкин Дмитрий Леонидович","provider":"Coursera","language":"Russian","skills":["science","teaching","engineering","history"],"subject":"Education \u0026 Teaching","studentsInterested":"2","courseLink":"https://www.coursera.org/learn/promyshlennost","classCentralLink":"https://www.class-central.com/course/coursera---------9944"},{"title":"Teacher SEL: Programs, Possibilities, and Contexts","about":"Social and emotional learning, or SEL, student programs have flourished in schools during the last decade. Unfortunately inadequate attention has been paid to teachers’ social and emotional learning.\nIn this course the instructors (Randy Testa and Dan Liston) introduce and examine distinct and established teacher SEL programs, as well as some alternative possibilities.\n\nThis course is a part of the 5-course Specialization “The Teacher and Social Emotional Learning (SEL)”. Interested in earning 3 university credits from the University of Colorado-Boulder for this specialization? If so check out \"How you can earn 3 university credits from the University of Colorado-Boulder for this specialization\" reading in the first module of this course for additional information.\n\nWe want to note that the courses in this Specialization were designed with a three-credit university course load in mind. As a participant you may notice a bit more reading content and a little less video/lecture content. Completing and passing the SEL Specialization allows the participant to apply for 3 graduate credits toward teacher re-certification and professional enhancement. We want to ensure the quality and high standards of a University of Colorado learning experience.\n\nInterested in earning 3 graduate credits from the University of Colorado-Boulder for The Teacher and Social Emotional Learning (SEL) Specialization? Check out \"How you can earn 3 university credits from the University of Colorado-Boulder for this specialization\" reading in the first week of this course for more information.","tutor":"Dan Liston and Randy Testa","provider":"Coursera","language":"English","skills":["teacher training","social and emotional learning","sel"],"subject":"Teacher Development","studentsInterested":"23","courseLink":"https://www.coursera.org/learn/teacher-sel-programs","classCentralLink":"https://www.class-central.com/course/coursera-teacher-sel-programs-possibilities-and-contexts-10014"},{"title":"Assessment in Higher Education: Professional Development for Teachers","about":"Are you a teacher in higher education wanting to get the best out of your students and assessments? Then on behalf of Risbo, Erasmus University Rotterdam, we would like to welcome you to this MOOC on Assessment in Higher Education. In this MOOC we will guide you through the different phases of preparing, creating and evaluating the assessments in your course.\n\nAfter participating in this MOOC, you will be able to:\n1. Design an assessment that is constructively aligned (content, level, methods) with the course objectives and activities\n2. Apply the quality criteria with respect to validity, reliability and transparency for construction of assessments and assessment items\n3. Analyze the assessment output and results, assess the quality of the assessment and make decisions about students’ grades accordingly\n4. Formulate future improvements for an assessment\n\nFor the assignments, you will be working with your own teaching materials. For example you will create your own assessment plan for your course. Next to that you will become part of a learning community with teachers from all over the world.\n\nWe are offering you instructional videos, interviews, animations and checklists. In addition to these, there will be course activities, such as assessments, and discussion prompts. By participating in this MOOC, you will find answers to the following questions:\n\n• What is the role of assessment?\n• How can you select the right methods of assessment for your course?\n• What is constructive alignment?\n• How can an assessment plan and matrix help you in the construction of assessments?\n• Is it possible to make an absolute reliable and valid assessment?\n• How can the formulation of good assessment questions have an impact on that?\n• What is the role of feedback?\n• How can rubrics help with providing feedback?\n• What are the things to consider when performing an exam or item analysis? What aspects should you look out for?\n• How do you draw conclusions from an exam analysis and make plans for future improvements?\n• If good students fail on certain questions, what does this say about the question… or about your teaching?\n\nAre you ready for enhancing your teaching skills? Then take this journey with us.","tutor":"Mandy Hollander, Kris Stabel, Remy Fermont, Berry Nijveld, Marit Nieuwenhuys and Sanne van Herpen","provider":"Coursera","language":"English","skills":["teacher training","higher education","assessments"],"subject":"Teacher Development","studentsInterested":"52","courseLink":"https://www.coursera.org/learn/assessment-higher-education","classCentralLink":"https://www.class-central.com/course/coursera-assessment-in-higher-education-professional-development-for-teachers-10184"},{"title":"Build a Makerspace for Young People","about":"Embrace the maker movement - build a makerspace in your community\nA makerspace is an area inside a school, library or other public facility, which young people can use to apply digital skills to the real world, exploring ideas and making things collaboratively.\nThis online course will show you how to create a makerspace in your community. You’ll explore different approaches to makerspaces, understand the pedagogy that underpins the maker movement, and get practical advice on getting started.\nBy the end of the course, you’ll understand the benefits of embracing making and know how to find partners to help you build a successful makerspace in your community.\nThis course is designed for anyone who wants to build a makerspace for young people. You might be a school or community librarian, a primary or secondary school teacher, a school governor, a member of a parent-teacher association or a museum education officer.\nTo take part in the course learners need access to free programming software Scratch and Python","tutor":"Andrew Collins","provider":"FutureLearn","language":"English","skills":["makerspace"],"subject":"STEM","studentsInterested":"34","courseLink":"https://www.futurelearn.com/courses/build-a-makerspace","classCentralLink":"https://www.class-central.com/course/futurelearn-build-a-makerspace-for-young-people-10564"},{"title":"What future for education?","about":"Through this course you will start to critically examine your own ideas about education, teaching and learning. The critique will be developed through engagement with theories and ideas developed through educational research. You will be encouraged to use these ideas to challenge or support your own ideas about education.\n\nEach week we will focus on one key question, using video lectures, key readings and challenges to explore some commonplace notions about education. With the guidance of the course team, you will be asked to use these ideas to critically reflect on your own understandings and experience. By the end of the course, you will have developed a personal response to the main question: what is your preferred future for education?","tutor":"Clare Brooks","provider":"Coursera","language":"English","skills":["education","education management","europe","england"],"subject":"Teacher Development","studentsInterested":"4.1k","courseLink":"https://www.coursera.org/learn/future-education","classCentralLink":"https://www.class-central.com/course/coursera-what-future-for-education-2033"},{"title":"Learning Online: Managing Your Identity","about":"##\nMany of us now have an online identity running alongside our everyday lives. In this course you’ll consider your online presence; you’ll discover how what we say and do online can have major implications for our real lives, and those of others. You’ll also spend time looking at how to assess and enhance your online identities to ensure that you can get the most out of being yourself online.\nThis course is just one of a series about ‘learning online’, which introduces you to the essential skills and tools you need to study effectively online.\nThis course is part of the Going to University collection which has been specifically designed for schools and colleges. The course can be used as a teachers’ classroom enrichment resource or can be studied independently by students.","tutor":"Helen Howard and Raphael Hallett","provider":"FutureLearn","language":"English","skills":["europe","online learning","uk","online identity"],"subject":"Online Education","studentsInterested":"1.3k","courseLink":"https://www.futurelearn.com/courses/online-identity","classCentralLink":"https://www.class-central.com/course/futurelearn-learning-online-managing-your-identity-5018"},{"title":"Teach English Now! Second Language Listening, Speaking, and Pronunciation","about":"In this course, you will be introduced to some of the challenges of teaching and learning listening and speaking, such as paralinguistics, performance variables, reduced and regional forms, and differing types of oral discourse. Don\u0027t worry--you\u0027ll learn what those mean, too! Then you\u0027ll learn how to ease the acquisition of listening and speaking for your students. The course also highlights the powerful opportunity to include pronunciation in listening and speaking classes and offers strategies to incorporate pronunciation activities.","tutor":"Jessica Cinco, Dr. Shane Dixon and Dr. Justin Shewell","provider":"Coursera","language":"English","skills":["teaching","english","paralinguistics","oral discourse","usa","north america"],"subject":"Teacher Development","studentsInterested":"2.5k","courseLink":"https://www.coursera.org/learn/tesol-speaking","classCentralLink":"https://www.class-central.com/course/coursera-teach-english-now-second-language-listening-speaking-and-pronunciation-6201"},{"title":"Multimodal Literacies: Communication and Learning in the Era of Digital Media","about":"This course introduces innovative approaches to learning and teaching, with a focus on the use of e-learning and social web technologies.","tutor":"William Cope and Mary Kalantzis","provider":"Coursera","language":"English","skills":["usa","north america"],"subject":"Education \u0026 Teaching","studentsInterested":"62","courseLink":"https://www.coursera.org/learn/multimodal-literacies","classCentralLink":"https://www.class-central.com/course/coursera-multimodal-literacies-communication-and-learning-in-the-era-of-digital-media-7057"},{"title":"Instructional Design and Technology: Learning Theories","about":"Technology, digital media and mobile access have changed how people learn. Today’s students want to be engaged and self-directed with digital content, available anytime, anywhere. This is a challenge for instructional designers as they create online learning experiences.\nAs an instructional designer, it’s critical to understand emerging learning theories including Bloom’s taxonomy and constructivism and how they relate to the way people learn in our digitally connected world. This course, which is part of the Instructional Design and Technology MicroMasters Program, explores the evolution of learning theories from traditional Socratic methods to emerging learning sciences. Additionally, you will explore curriculum design models using performance-based assessments to create effective and engaging learning experiences.\nAfter a solid foundation of how people learn today, you will explore technology’s role in supporting and enhancing the teaching and learning process.\nPrevious background in teaching or professional development is a plus, but not required. Join us and launch your career as an instructional designer.","tutor":"Randy Hansen, Jessica Levene and Eli Collins-Brown","provider":"edX","language":"English","skills":["usmx","umuc"],"subject":"Education \u0026 Teaching","studentsInterested":"65","courseLink":"https://www.edx.org/course/instructional-design-technology-learning-usmx-umuc-ldt100x-1","classCentralLink":"https://www.class-central.com/course/edx-instructional-design-and-technology-learning-theories-8182"},{"title":"Basics of Inclusive Design for Online Education","about":"This course provides instruction and strategies to support you in developing a course that is inclusive to students with a wide range of abilities, including students with disabilities. We cover effective practices to increase inclusion and avoid some of the common accessibility issues that can arise in an online course.\n\nIn particular, Basics of Inclusive Design Online covers course organization, the accessibility of Microsoft Office and PDF documents, making course instruction pages accessible, captioning of videos, making images accessible, and designing for learning differences. We also discuss how inclusive course materials can help all students, including students without disabilities.\n\nThis course will appeal to those who want both a broad overview of the range of accessibility considerations and also a step-by-step guide of how to check documents for accessibility, caption a video, or prepare course content for non-visual users.\n\nCourse logo credit: \"web accessibility word cloud\" by Jill Wright (https://goo.gl/xyUoeU).\nCopyright - some rights remain. See https://creativecommons.org/licenses/by/2.0/","tutor":"Emily Moore, Howard Kramer and Clayton Lewis","provider":"Coursera","language":"English","skills":["online education","inclusive classroom"],"subject":"Online Education","studentsInterested":"54","courseLink":"https://www.coursera.org/learn/inclusive-design","classCentralLink":"https://www.class-central.com/course/coursera-basics-of-inclusive-design-for-online-education-11169"},{"title":"Dangerous Questions: Why Academic Freedom Matters","about":"Challenge the limits to critical inquiry\nAcademic freedom is a fundamental value in modern higher education and research.\nOn this course, you’ll find out how we can use academic freedom to ask critical questions and contribute to a democratic society.\nYou’ll explore the importance of free and open research, and how it relates to core higher education and societal values.\nYou’ll understand why academic freedom is crucial for maintaining the quality and relevance of research in higher education.\nYou’ll learn about some of the current threats to academic freedom, and how this relates to the academic community worldwide.\nThis course is designed for students and staff in higher education, but it will be relevant for anyone interested in asking critical questions.","tutor":"Robert Quinn","provider":"FutureLearn","language":"English","skills":["higher education","democracy","freedom of speech"],"subject":"Higher Education","studentsInterested":"51","courseLink":"https://www.futurelearn.com/courses/academic-freedom","classCentralLink":"https://www.class-central.com/course/futurelearn-dangerous-questions-why-academic-freedom-matters-11056"},{"title":"Our Solar System and Beyond: Teaching Primary Science","about":"Understand the Solar System and how to teach it with real-life astronomers\nUnderstanding the Solar System and how to teach it can be a tricky business. Fortunately astronomers at the Royal Observatory Greenwich are here to help.\nIn this online course, they’ll help you understand space, address some common misconceptions, and introduce you to the science and people behind real-life, cutting-edge discoveries.\nYou’ll also find out how to select the most appropriate resources for your primary science lessons. You’ll explore digital resources, museum tips, video chats and podcasts, and find out what works best for your students.\nThis course is designed for primary school teachers and home educators, who have an interest in expanding their knowledge of space, the Solar System and science more broadly, and improving their primary science lessons.","tutor":"Liz Avery","provider":"FutureLearn","language":"English","skills":["stem","solar systems","new-moocs-2017"],"subject":"STEM","studentsInterested":"23","courseLink":"https://www.futurelearn.com/courses/primary-science","classCentralLink":"https://www.class-central.com/course/futurelearn-our-solar-system-and-beyond-teaching-primary-science-9111"},{"title":"SEL for Students: A Path to Social Emotional Well-Being","about":"Social and emotional learning, or SEL, programs have flourished in schools during the last decade. In this course the instructor (Emily Price) introduces you to the history and framings of social and emotional learning preK-12 curricula, as well as various elementary, middle, and high school SEL programs and associated research.\n\nThis course is a part of the 5-course Specialization “The Teacher and Social Emotional Learning (SEL)”. Interested in earning 3 university credits from the University of Colorado-Boulder for this specialization? If so check out \"How you can earn 3 university credits from the University of Colorado-Boulder for this specialization\" reading in the first module of this course for additional information.\n\nWe want to note that the courses in this Specialization were designed with a three-credit university course load in mind. As a participant you may notice a bit more reading content and a little less video/lecture content. Completing and passing the SEL Specialization allows the participant to apply for 3 graduate credits toward teacher re-certification and professional enhancement. We want to ensure the quality and high standards of a University of Colorado learning experience.\n\nInterested in earning 3 graduate credits from the University of Colorado-Boulder for The Teacher and Social Emotional Learning (SEL) Specialization? Check out \"How you can earn 3 university credits from the University of Colorado-Boulder for this specialization\" reading in the first week of this course for more information.","tutor":"Dan Liston and Emily Claire Price","provider":"Coursera","language":"English","skills":["teacher training","social and emotional learning","sel"],"subject":"Teacher Development","studentsInterested":"25","courseLink":"https://www.coursera.org/learn/sel-for-students","classCentralLink":"https://www.class-central.com/course/coursera-sel-for-students-a-path-to-social-emotional-well-being-10010"},{"title":"Blended Learning: Personalizing Education for Students","about":"Plenty of buzz exists about blended learning and its transformational potential. But what does blended learning really mean? In this course we will explore the different models of blended learning and dive into key issues that impact students, teachers, and schools. Specifically, we will look at these issues through the lens of three high-performing schools that each use a different type of blended learning. A few of the key topics will include:\n\n- The role of the student and how to support students in the transition from traditional to blended learning\n- Implications for teachers in their day-to-day work and overall role\n- Impact on the way schools are designed including staffing models, use of time, hardware/software selection, and the use of data\n- Implementation challenges, potential solutions, and the remaining open questions\n\nWe will live by the attributes of blended learning in this course, encouraging students to take quizzes at the beginning of the module to assess their understanding and skip material they already know. Overall, we will take a hand-on approach and the course will culminate in participants prototyping their own blended learning model.\n\nIf you are interested in learning more about how to best leverage technology in education and rethink the way we run schools, join this MOOC and encourage your colleagues to do the same. Become a part of this growing movement and learn first-hand how blended learning can help provide students a more personalized learning experience.","tutor":"Brian Greenberg, Rob Schwartz and Michael Horn","provider":"Coursera","language":"English","skills":["usa","north america"],"subject":"Course Development","studentsInterested":"1.3k","courseLink":"https://www.coursera.org/learn/blending-learning-personalization","classCentralLink":"https://www.class-central.com/course/coursera-blended-learning-personalizing-education-for-students-1199"},{"title":"Learning Online: Searching and Researching","about":"##\nIn this course, you’ll explore the rich and diverse range of information available to you online, how to use search tools effectively, and the ways in which you can begin to assess information that you might want to use in your studies. Using a wide range of learning activities, you will be challenged to dig deeper and think critically about the information that you find online.\nThis course is just one of a series about ‘learning online’, which introduces you to the essential skills and tools you need to study online.\nThis course is part of the Going to University collection which has been specifically designed for schools and colleges. The course can be used as a teachers’ classroom enrichment resource or can be studied independently by students.","tutor":"Raphael Hallett and Angela Newton","provider":"FutureLearn","language":"English","skills":["europe","online learning","google searching","uk","research skills"],"subject":"Online Education","studentsInterested":"198","courseLink":"https://www.futurelearn.com/courses/searching-and-researching","classCentralLink":"https://www.class-central.com/course/futurelearn-learning-online-searching-and-researching-5019"},{"title":"Problem-Solving Skills for University Success","about":"In this course, you will learn how to develop your Problem Solving and Creativity Skills to help you achieve success in your university studies. After completing this course, you will be able to:\n\n1. Recognise the importance and function of problem solving and creative thought within academic study and the role of critical thought in creative ideation.\n\n2. Develop a toolkit to be able to identify real problems and goals within ill-defined problems\n\n3. Recognize and apply analytical problem solving techniques\n\n4. Recognise and apply creative problem solving techniques\n\n5. Identify the use of creativity within and types of problems most common to your field\n\n6. Apply learnt problem solving and creative ideation skills to a real-life context and reflect on personal learning processes","tutor":"Katherine Olston","provider":"Coursera","language":"English","skills":["creativity","problem solving","university studies","australia"],"subject":"Higher Education","studentsInterested":"81","courseLink":"https://www.coursera.org/learn/problem-solving-skills","classCentralLink":"https://www.class-central.com/course/coursera-problem-solving-skills-for-university-success-6687"},{"title":"Learning Online: Learning and Collaborating","about":"##\nOnline learning is likely to be important for you in the future, either at university or in the workplace. Learning online is different to learning in the classroom as it requires different skills. This course will help you to develop those skills, showing you how to learn and communicate effectively in an online environment.\nThis course is just one of a series about ‘learning online’, which introduces you to the essential skills and tools you need to study effectively online.\nThis course is part of the Going to University collection which has been specifically designed for schools and colleges. The course can be used as a teachers’ classroom enrichment resource or can be studied independently by students.","tutor":"Neil Morris and Carol Elston","provider":"FutureLearn","language":"English","skills":["europe","online learning","uk"],"subject":"Online Education","studentsInterested":"218","courseLink":"https://www.futurelearn.com/courses/learning-and-collaborating","classCentralLink":"https://www.class-central.com/course/futurelearn-learning-online-learning-and-collaborating-5015"},{"title":"Grant Proposal","about":"The course provides guidance on developing a strong application that will allow reviewers to better evaluate the science and merit of your proposal. You will learn how to put your ideas into proper words, arrange a clear and concise paper and search grant market for potential funder. You will also learn how to react to negative feedback from reviewers and resubmit your proposal. The course focuses on useful project management tools and possible budget pitfalls.","tutor":"Elena Bazanova","provider":"Coursera","language":"English","skills":["russia"],"subject":"Higher Education","studentsInterested":"93","courseLink":"https://www.coursera.org/learn/grant-proposal","classCentralLink":"https://www.class-central.com/course/coursera-grant-proposal-7124"},{"title":"How to Apply to College","about":"How to Apply to College will empower learners of all backgrounds to demystify and better understand the college search and selection process, combining the expertise of an Ivy League admissions office and a leading college access and success organization. Led by expert educators, including Eric J. Furda, Dean of Admissions at the University of Pennsylvania, and Dr. Sean Vereen, President of Steppingstone Scholars, Inc., this free course will help students, family members, college counselors and any inquisitive learner to navigate each stage from the start of the college search process through the transition into a college environment.\n\nThrough dialogue with students applying to and currently in college as well as campus advocates, How to Apply to College also aims to close the information gap for students who may be the first in their family to attend college and students who are underrepresented in higher education.\n\nA range of video and web resources are provided through a collaboration with a number of educational partners including The Common Application, with nearly 700 colleges on the application platform, and Raise.me, which provides a new way for high school students to earn money for college starting in 9th grade based on their achievements in school and life. Other resources and tools featured in the course include Naviance, College Greenlight, College Scorecard, BigFuture by the College Board, College and Pell Abacus, ZeeMee and Federal Student Aid.","tutor":"Eric J. Furda and Dr. Sean Vereen","provider":"Coursera","language":"English","skills":["usa","north america","new-moocs-2017"],"subject":"Higher Education","studentsInterested":"135","courseLink":"https://www.coursera.org/learn/applying-to-college","classCentralLink":"https://www.class-central.com/course/coursera-how-to-apply-to-college-7504"},{"title":"Communication Skills for University Success","about":"This Specialization is aimed at preparing students for undergraduate study in an English-speaking university. The course equips you for full participation and engagement with your studies by building awareness and understanding of the core values and expectations of academic culture, and providing you with practical strategies to apply to your studies. In this course, you will learn how to develop your Communication Skills to help you achieve success in your university studies. After completing this course, you will be able to:\n\n1. Recognise the importance of communication in communities of practice at university\n2. Understand contexts of communication at university and associated expectations\n3. Communicate clearly across a variety of different contexts and to a wide range of audiences by adapting communicative styles appropriately\n4. Demonstrate, negotiate, and further understanding through spoken, written, visual, and conversational modes\n5. Effectively formulate arguments and communicate research findings through the process of researching, composing, and editing\n6. Confidently engage in constructive and critical dialogue with respect and professionalism","tutor":"Katherine Olston","provider":"Coursera","language":"English","skills":["communication skills","university studies","australia"],"subject":"Higher Education","studentsInterested":"83","courseLink":"https://www.coursera.org/learn/communication-skills","classCentralLink":"https://www.class-central.com/course/coursera-communication-skills-for-university-success-6688"},{"title":"Information \u0026 Digital Literacy for University Success","about":"This Specialization is aimed at preparing students for undergraduate study in an English-speaking university. The course equips you for full participation and engagement with your studies by building awareness and understanding of the core values and expectations of academic culture, and providing you with practical strategies to apply to your studies. In this course, you will learn how to develop your Information \u0026 Digital Literacy Skills to help you achieve success in your university studies. After completing this course, you will be able to:\n\n1. Access and search for information efficiently and effectively using a variety of digital tools.\n\n2. Critically evaluate the reliability of sources for an academic context.\n\n3. Filter, manage and organize information from a wide variety of sources for use in academic study.\n\n4. Demonstrate awareness of ethical issues related to academic integrity surrounding the access and use of information.\n\n5. Understand how to use digital tools for referencing and attribution in order to avoid plagiarism.\n\n6. Understand how to disseminate and communicate information in a professional way, including managing digital identity and building networks for learning and research.","tutor":"Katherine Olston","provider":"Coursera","language":"English","skills":["digital literacy","english speaking skills","undergraduate","australia"],"subject":"Higher Education","studentsInterested":"39","courseLink":"https://www.coursera.org/learn/digital-literacy","classCentralLink":"https://www.class-central.com/course/coursera-information-digital-literacy-for-university-success-6690"},{"title":"Expanding SEL","about":"Social and emotional learning, or SEL, programs have flourished in schools during the last decade. In this course the instructors (Emily Price and Ben Kirshner) introduce and help you examine community based and youth-empowerment approaches to social and emotional learning. Some of these approaches address the impact of social and political systems, such as immigration and structural racism, on children’s social and emotional experiences.\n\nThis course is a part of the 5-course Specialization “The Teacher and Social Emotional Learning (SEL)”. Interested in earning 3 university credits from the University of Colorado-Boulder for this specialization? If so check out \"How you can earn 3 university credits from the University of Colorado-Boulder for this specialization\" reading in the first module of this course for additional information.\n\nWe want to note that the courses in this Specialization were designed with a three-credit university course load in mind. As a participant you may notice a bit more reading content and a little less video/lecture content. Completing and passing the SEL Specialization allows the participant to apply for 3 graduate credits toward teacher re-certification and professional enhancement. We want to ensure the quality and high standards of a University of Colorado learning experience.\n\nInterested in earning 3 graduate credits from the University of Colorado-Boulder for The Teacher and Social Emotional Learning (SEL) Specialization? Check out \"How you can earn 3 university credits from the University of Colorado-Boulder for this specialization\" reading in the first week of this course for more information.","tutor":"Emily Claire Price and Ben Kirshner","provider":"Coursera","language":"English","skills":["teacher training","social and emotional learning","sel"],"subject":"Teacher Development","studentsInterested":"8","courseLink":"https://www.coursera.org/learn/expanding-sel","classCentralLink":"https://www.class-central.com/course/coursera-expanding-sel-10012"},{"title":"Strategies for Teaching Perfect Tenses and Modals","about":"This is the first course in the Teach English: Intermediate Grammar specialization. In this course, you will learn about teaching important intermediate verb tenses, including present perfect, present perfect progressive, past perfect, and past perfect progressive. You will also learn about teaching common modal verbs used in English. Finally, you will have opportunities to practice the skills you learn by creating sample assignments and recording short videos of your teaching demonstrations. This course is designed for teachers or those wanting to become teachers who have a solid understanding of English grammar and want to improve their skills of teaching that grammar to others.\n\nPlease note that the free version of this class gives you access to all of the instructional videos and handouts. The peer feedback and quizzes are only available in the paid version.","tutor":"Tamy Chapman and Emily Wong","provider":"Coursera","language":"English","skills":["usa","north america"],"subject":"Education \u0026 Teaching","studentsInterested":"74","courseLink":"https://www.coursera.org/learn/teaching-verb-tenses-modals","classCentralLink":"https://www.class-central.com/course/coursera-strategies-for-teaching-perfect-tenses-and-modals-7365"},{"title":"The Teacher\u0027s Social and Emotional Learning","about":"Social and emotional learning, or SEL, programs have flourished in schools during the last decade. While this growth has been impressive, inadequate attention has been paid to teachers’ social and emotional learning. In this course Dan Liston and Randy Testa introduce you to various rationales for why teacher SEL is needed as well as examine and reflect on various emotions in teaching and learning.\n\nThis course is a part of the 5-course Specialization “The Teacher and Social Emotional Learning (SEL)”. Interested in earning 3 university credits from the University of Colorado-Boulder for this specialization?? If so check out \"How you can earn 3 university credits from the University of Colorado-Boulder for this specialization\" reading in the first module of this course for additional information.\n\nWe want to note that the courses in this Specialization were designed with a three-credit university course load in mind. As a participant you may notice a bit more reading content and a little less video/lecture content. Completing and passing the SEL Specialization allows the participant to apply for 3 graduate credits toward teacher re-certification and professional enhancement. We want to ensure the quality and high standards of a University of Colorado learning experience.\n\nInterested in earning 3 graduate credits from the University of Colorado-Boulder for The Teacher and Social Emotional Learning (SEL) Specialization? Check out \"How you can earn 3 university credits from the University of Colorado-Boulder for this specialization\" reading in the first week of this course for more information.","tutor":"Dan Liston and Randy Testa","provider":"Coursera","language":"English","skills":["teacher training","social and emotional learning","sel"],"subject":"Teacher Development","studentsInterested":"39","courseLink":"https://www.coursera.org/learn/teachers-social-emotional-learning","classCentralLink":"https://www.class-central.com/course/coursera-the-teacher-s-social-and-emotional-learning-10013"},{"title":"Éducation par la recherche : Savanturiers du vivant","about":"A propos du cours\nÉducation par la recherche\nL’Éducation par la recherche désigne à la fois la posture de l’enseignant comme pédagogue-chercheur et l’initiation des élèves aux méthodes de la recherche et à son éthique. En prenant modèle sur la recherche, la culture scolaire renoue avec la rigueur de la démarche, le développement de l’esprit critique, la volonté d’explorer l’inconnu et d’innover, la créativité et la collaboration.\nLes enseignants engagent ainsi leurs élèves dans des projets coopératifs rigoureux où ils mobilisent de nombreuses compétences telles que : observer, questionner, décrire, formuler des hypothèses, capitaliser des savoirs, expérimenter, modéliser, échanger des informations, argumenter et valider des résultats. Le questionnement, l’erreur, l’essai, l’itération, la comparaison entre le modèle et la réalité, le travail collaboratif, l’ouverture de l’école au monde constituent autant de leviers pour les apprentissages.\nGrâce à la démarche d’Éducation par la recherche, les élèves s’initient dès le plus jeune âge aux outils et concepts de la recherche et de la production de savoirs. Ils mènent des projets dont l’aboutissement est un chef-d’oeuvre témoignant de leurs apprentissages, leurs compétences et l’avancée de leur réflexion.\nPourquoi le vivant à l’école ?\nLa biologie est une discipline qui étudie le vivant.","tutor":"Régis Forgione, Patrice Clair and Elaine Del Nery","provider":"France Université Numerique","language":"French","skills":["education","research"],"subject":"Education \u0026 Teaching","studentsInterested":"10","courseLink":"https://www.fun-mooc.fr/courses/course-v1:USPC+37017+session01/about","classCentralLink":"https://www.class-central.com/course/france-universite-numerique-education-par-la-recherche-savanturiers-du-vivant-11189"},{"title":"Foundations of Teaching for Learning: Learners and Learning","about":"The Foundations of Teaching for Learning programme is designed for teachers and educators of all abilities and backgrounds; from those who are new to the classroom and looking for development, to experienced teachers ready to reboot their skills for modern education. With dynamic lessons taught by established and respected professionals from across the Commonwealth, this eight course programme will see you develop and strengthen your skills in teaching, professionalism, assessment, and more. As you carry on through the programme, you will find yourself strengthening not only your professional skills, but your connection with colleagues across the globe. A professional development opportunity not to be missed.\n\nThe teacher’s work becomes meaningful when it is informed by research and theories of learning, and their relationship to actual practice. This course provides an opportunity for you to identify and understand students’ expectations and prior learning.\n\nEnhance your course by joining the Commonwealth teaching community on our website, Facebook and Twitter.","tutor":"George Oduro","provider":"Coursera","language":"English","skills":["europe","uk"],"subject":"Teacher Development","studentsInterested":"2.7k","courseLink":"https://www.coursera.org/learn/teaching-learning","classCentralLink":"https://www.class-central.com/course/coursera-foundations-of-teaching-for-learning-learners-and-learning-876"},{"title":"Aprenda a ensinar programação com o Programaê!","about":"O curso \"Aprenda a ensinar programação com o Programaê!\" tem como objetivo apoiar professores no desenvolvimento de suas aulas com o ‘Programaê!’, um movimento que quer aproximar a programação do cotidiano de jovens de todo o Brasil por meio de um portal prático, agregador de ideias, soluções, dicas e planos de aula estruturados para professores.\n\nVocê não precisa ser programador ou entender de programação para fazer este curso! Nosso público-alvo são profissionais da educação (formal e não formal) que desejam desenvolver o pensamento lógico computacional de crianças, jovens e adultos utilizando os planos de aula do Programaê!\n\nAo concluir este curso, os alunos serão capazes de:\n\n• Apresentar o Programaê! e os objetivos do movimento;\n• Definir qual é o papel da programação no desenvolvimento de habilidades e competências;\n• Apresentar e explorar o code.org como aluno e como professor, criando turmas, gerenciando e acompanhando o progresso dos alunos;\n• Entender como os planos de aula foram organizados e a importância do desenvolvimento de atividades desplugadas para o aprendizado dos conceitos da lógica de programação;\n\nPara ser certificado, o cursista deve obter 100% de aproveitamento nas avaliações, que são apresentadas em formato de teste, com possibilidade de mais de uma tentativa.\n\nParticipe de outros cursos da Fundação Lemann no Coursera - https://www.coursera.org/lemann","tutor":"Maristela Alcântara and Tiago Maluta","provider":"Coursera","language":"Portuguese","skills":["teaching","stem","programming","brazil","south america"],"subject":"STEM","studentsInterested":"6","courseLink":"https://www.coursera.org/learn/programae","classCentralLink":"https://www.class-central.com/course/coursera-aprenda-a-ensinar-programacao-com-o-programae-4470"},{"title":"El desafío de Innovar en la Educación Superior","about":"El propósito del curso es incentivarte a que en tu labor docente replantees tu práctica, desde perspectivas innovadoras con miras a mejorar la calidad de los aprendizajes con todos tus estudiantes. Además, este curso promueve que vincules la formación de tus estudiantes con desafíos sociales, profesionales y laborales, propiciando la excelencia en el aula y la inclusión de la diversidad, proponiendo enfoques de enseñanza participativos centrados en el esfuerzo cognitivo de tus aprendices.\n\nDespués de completar este curso serás capaz de:\n\n1) Tomar decisiones docentes que propicien en forma efectiva el logro de aprendizaje de los estudiantes.\n2) Contextualizar el proceso de enseñanza y aprendizaje, identificando las implicancias y desafíos para la formación a nivel universitario, considerando las características de sus estudiantes.\n3) Conocer experiencias de enseñanza y de monitoreo que impacten en la validad de los aprendizajes de sus estudiantes, considerando los desafíos sociales, profesionales y laborales.\n4) Identificar estrategias para gestionar aulas heterogéneas que propicien la inclusión y la cohesión social en el aula, facilitando los aprendizajes colectivos.","tutor":"Oscar Jerez, Rodolfo Chiple and Beatriz Hasbún","provider":"Coursera","language":"Spanish","skills":["innovation","higher education","chile","south america"],"subject":"Higher Education","studentsInterested":"6","courseLink":"https://www.coursera.org/learn/educacion-superior","classCentralLink":"https://www.class-central.com/course/coursera-el-desafio-de-innovar-en-la-educacion-superior-5911"},{"title":"Foundations of Virtual Instruction","about":"This course provides teachers with the foundation for understanding the movement towards virtual instruction. It introduces fundamental knowledge needed by teachers to succeed in a technology-dependent, instructional environment. You will explore the history of online learning and understand how a variety of delivery models are evolving in the K-12 environment, ranging from completely online to hybrid or blended classrooms. We will discuss how the programs work and who they serve, addressing some basics about equity issues, access and school funding, as well as ethical and legal issues that support and challenge the models. Upon completion of the course, you will understand what it takes to transition from teaching in the classroom to providing virtual instruction.\n\nUpon completing this course, you will be able to:\n1. Describe the history of online learning models\n2. Identify current virtual instruction models and who offers them\n3. Explain how virtual instruction models have evolved and why\n4. Describe common features of synchronous and asynchronous technologies\n5. Discuss basic ethical and legal issues faced by schools","tutor":"Cindy Carbajal","provider":"Coursera","language":"English","skills":["usa","north america"],"subject":"Online Education","studentsInterested":"311","courseLink":"https://www.coursera.org/learn/virtual-school","classCentralLink":"https://www.class-central.com/course/coursera-foundations-of-virtual-instruction-860"},{"title":"Art \u0026 Inquiry: Museum Teaching Strategies For Your Classroom","about":"Explore how to integrate works of art into your classroom with inquiry-based teaching methods originally developed for in-gallery museum education.","tutor":"Lisa Mazzola","provider":"Coursera","language":"English","skills":["usa","north america"],"subject":"K12","studentsInterested":"162","courseLink":"https://www.coursera.org/learn/artinquiry","classCentralLink":"https://www.class-central.com/course/coursera-art-inquiry-museum-teaching-strategies-for-your-classroom-865"},{"title":"Foundations of Teaching for Learning: Curriculum","about":"The Foundations of Teaching for Learning programme is designed for teachers and educators of all abilities and backgrounds; from those who are new to the classroom and looking for development, to experienced teachers ready to reboot their skills for modern education. With dynamic lessons taught by established and respected professionals from across the Commonwealth, this eight course programme will see you develop and strengthen your skills in teaching, professionalism, assessment, and more. As you carry on through the programme, you will find yourself strengthening not only your professional skills, but your connection with colleagues across the globe. A professional development opportunity not to be missed.\n\nCurriculum is a framework for guiding teaching and learning. This course provides an opportunity for you to consider the relationship between the teacher, the learner and the curriculum.\n\nEnhance your course by joining the Commonwealth teaching community on our website, Facebook and Twitter.","tutor":"Suseela Malakolunthu","provider":"Coursera","language":"English","skills":["europe","uk"],"subject":"Course Development","studentsInterested":"395","courseLink":"https://www.coursera.org/learn/teacher-curriculum","classCentralLink":"https://www.class-central.com/course/coursera-foundations-of-teaching-for-learning-curriculum-877"},{"title":"Fundamentos do Google para o Ensino","about":"Este curso é oferecido pelo Google em parceria com a Fundação Lemann e a Foreducation, e tem como objetivo apresentar a educadores possibilidades de uso das tecnologias do Google para aumentar a eficiência, a inovação e a personalização do ensino. O conteúdo está dividido em cinco módulos:\n\n1. Visão geral: entenda a estrutura do curso e confira dicas para obter sucesso na sua estratégia de estudo.\n2. Pesquisa e comunicação: busque recursos online e divulgue informações para a comunidade escolar.\n3. Criação e compartilhamento: crie documentos online e incentive a colaboração usando ferramentas de edição de texto, planilhas, apresentações e formulários de pesquisa.\n4. Melhorar a experiência em sala de aula: utilize ferramentas online para melhorar a comunicação e aspectos visuais nas aulas.\n5. Saiba mais: encontre links e conteúdos interessantes de assuntos relacionados ao uso de tecnologia em sala de aula.\n\nCada módulo contém um vídeo de introdução seguido de tópicos que exploram casos práticos de como educadores podem fazer o melhor uso das tecnologias do Google em sala de aula. Em seguida, os módulos apresentam um passo a passo sobre como realizar tarefas básicas com a ferramenta indicada e links para aprofundamento. Como conclusão de cada etapa, teremos atividades para praticar as habilidades adquiridas e discussões em fóruns para compartilhar experiências e obter feedback de outros cursistas.\n\nPronto para começar? Desejamos um excelente curso!","tutor":"Augusto Portugal and Artur Jovanelli","provider":"Coursera","language":"Portuguese","skills":["education","google technology","brazil","south america"],"subject":"Course Development","studentsInterested":"9","courseLink":"https://www.coursera.org/learn/fundamentosgoogle","classCentralLink":"https://www.class-central.com/course/coursera-fundamentos-do-google-para-o-ensino-4476"},{"title":"Tinkering Fundamentals: Circuits","about":"The Tinkering Fundamentals course will offer educators and enthusiasts an opportunity to develop a practice of tinkering and making. We see tinkering as a serious endeavor—one that is generalizable across content and especially good at interweaving disciplines in a way that leads to complex projects and individualized learning opportunities. Tinkering has recently been introduced into the educational field as a potential driver of creativity, excitement, and innovation in science learning. It is seen by many as an effective means to engage in exploring STEM concepts, practices and phenomena. Tinkering typically blends the high and low tech tools of science along with a strong aesthetic dimension that supports children’s (and adults) self expression.\n\nFor over a decade, the Exploratorium has been developing science-rich tinkering activities for both children and adults. We see tinkering as a fun yet serious endeavor—spanning many disciplines and content areas and fostering connections between art, science, and technology. Learners follow their own path to understanding by investigating tools and materials and exploring questions that interest them. This opens up a wide range of possible answers rather than any “right” one, particularly for teaching STEM (Science, Technology, Engineering, Math) subjects in the classroom. This course centers on circuit-related activities, which offer a wealth of opportunities for thinking through making.\n\nIn this course, we won’t just show you how we develop tinkering activities; we’ll also delve into why. We’ll focus on three important aspects: activity design around specific materials, facilitation strategies, and environmental organization. We’ll also share some guiding principles and learning indicators we’ve developed that can help you integrate tinkering into your elementary and middle-school science program. Whether you’re new to making or a seasoned tinkerer, we hope this course will help you take the next step!\n\nOUR APPROACH TO TEACHING\n\nThis is a hands-on workshop, not a lecture-based class. Participation is essential! We want everyone to be making and tinkering together: trying things out, asking questions, sharing ideas, and reflecting together as a community. This is a wonderful chance to tinker and learn alongside people from all over the world and from all walks of life, so don’t be shy!\n\nPLEASE NOTE: Although this course will not have active instructor participation, we have put a great deal of effort towards creating a supportive space that encourages exploration. We’ll give you a few ways to get started; prompt you to share your own observations and experience as learners, designers and facilitators; and hopefully spark interesting conversations and discoveries along the way. While it’s not a requirement, we encourage you to take this class with a friend or colleague or meet with other people in your area: having support or doing activities with others will enhance your experience and help you stay engaged.\n\nREQUIRED COURSE MATERIALS\n\nYou will need several tools and materials to do weekly course activities. Pre-bundled materials are available from the Exploratorium store at www.artoftinkering.com. Please obtain all materials as soon as possible, well in advance of when you will need them in the course. Be sure to allow extra time for shipping and, if you are outside the U.S., for customs. In some cases, certain items may require assembly. Please refer to the Resources section to review this course’s activity guides.","tutor":"Mike Petrich, Karen Wilkinson and Luigi Anzivino","provider":"Coursera","language":"English","skills":["stem","tinkering","new-moocs-2017"],"subject":"STEM","studentsInterested":"29","courseLink":"https://www.coursera.org/learn/tinkering-circuits","classCentralLink":"https://www.class-central.com/course/coursera-tinkering-fundamentals-circuits-8961"},{"title":"K-12 Blended \u0026 Online Learning","about":"This course introduces teachers and interested adults to K12 blended and online learning. Participants will design a blended or online unit and develop one module to use with K12 students.","tutor":"Jordan Cameron and Anissa Lokey-Vega","provider":"Coursera","language":"English","skills":["usa","north america"],"subject":"K12","studentsInterested":"186","courseLink":"https://www.coursera.org/learn/k-12-online-education","classCentralLink":"https://www.class-central.com/course/coursera-k-12-blended-online-learning-1531"},{"title":"Academic Information Seeking","about":"This course will introduce you to the basic elements of academic information seeking - we will explore the search process from defining a strategy to evaluating and documenting your search results.\n\nAttending the course will make you a proficient information seeker. You will learn how to carry out comprehensive literature searches based on your own research assignment. You will be guided through the various information seeking steps from selecting relevant search strategies and techniques to evaluating your search results, documenting your search process and citing your sources.\n\nAttending the course will enable you to:\n• Identify your information need\n• Evaluate databases and other information resources\n• Set up search strategies and use various search techniques\n• Formulate search strings based on your own research assignment\n• Identify relevant material types\n• Undertake critical evaluation of your sources\n• Search more efficiently on the internet\n• Avoid plagiarism\n• Cite correctly\n• Work with reference management\n• Document your search process\n\nThe course is intended for undergraduate students but the lessons will be useful to anyone who is interested in becoming better at finding scientific information. There are no formal requirements for the course.\n\nThe series consists of 21 lectures that are organized into three modules. The lectures include small assignments and quizzes (to check comprehension).\nThe lectures will each touch upon a topic that is essential to the information seeking process. To get the most out of the lecture series, we recommend that you access the lectures while you are working on an academic paper. We also recommend that you watch the lectures in the order in which we have structured them.\nWe recommend that you create and fill out a log book while attending the lectures. We have created a log book template that you can use during the course.\n\nThe lecture series has been developed in collaboration between information specialists at University of Copenhagen and Technical University of Denmark","tutor":"Thomas Skov Jensen and Birgitte Munk","provider":"Coursera","language":"English","skills":["academic research","research","research skills","denmark","north america"],"subject":"Education \u0026 Teaching","studentsInterested":"522","courseLink":"https://www.coursera.org/learn/academicinfoseek","classCentralLink":"https://www.class-central.com/course/coursera-academic-information-seeking-5153"},{"title":"Instructional Methods in Health Professions Education","about":"This course provides those involved in educating members of the health professions an asynchronous, interdisciplinary, and interactive way to obtain, expand, and improve their teaching skills. These skills can then be applied within their own professional context, with a variety of learners, extending across many stages.\n\nAfter completing this course, learners will:\n1. Understand educational theory as it relates to health professions education\n2. Match instructional methods with desired educational outcomes\n3. Learn a variety of applied teaching techniques\n4. Share successful teaching strategies\n\nSuggested resources will include educational videos, individual readings, recommended\nreference books, and crowd-sourced recommendations. All students should have\ndependable access to the internet with video streaming capabilities. Some students\nmay want the ability to utilize on-line video conferencing as well.","tutor":"Caren Stalburg","provider":"Coursera","language":"English","skills":["usa","north america"],"subject":"Teacher Development","studentsInterested":"578","courseLink":"https://www.coursera.org/learn/instructional-methods-education","classCentralLink":"https://www.class-central.com/course/coursera-instructional-methods-in-health-professions-education-949"},{"title":"Foundations of Teaching for Learning: Introduction","about":"The Foundations of Teaching for Learning programme is designed for teachers and educators of all abilities and backgrounds; from those who are new to the classroom and looking for development, to experienced teachers ready to reboot their skills for modern education. With dynamic lessons taught by established and respected professionals from across the Commonwealth, this eight course programme will see you develop and strengthen your skills in teaching, professionalism, assessment, and more. As you carry on through the programme, you will find yourself strengthening not only your professional skills, but your connection with colleagues across the globe. A professional development opportunity not to be missed.\n\nThis introductory course considers the three domains of being a teacher: Professional Knowledge and Understanding; Professional Practice; and Professional Values, Relationships and Engagement.\n\nEnhance your course by joining the Commonwealth teaching community on our website, Facebook and Twitter.","tutor":"John MacBeath","provider":"Coursera","language":"English","skills":["europe","uk"],"subject":"Teacher Development","studentsInterested":"479","courseLink":"https://www.coursera.org/learn/teaching","classCentralLink":"https://www.class-central.com/course/coursera-foundations-of-teaching-for-learning-introduction-874"},{"title":"Ensino Híbrido: Personalização e Tecnologia na Educação","about":"Neste curso, oferecido pela Fundação Lemann em parceria com o Instituto Península, você terá a oportunidade de aprender, a partir de experiências reais, como integrar as tecnologias digitais no seu contexto escolar. As vivências compartilhadas pelos diferentes professores envolvidos neste curso lhe proporcionará reflexões sobre os modelos de Ensino Híbrido e sua relação com a personalização do ensino.\n\nA expectativa é apresentar a você possibilidades de integração das tecnologias digitais ao currículo escolar, de forma a alcançar uma série de benefícios no dia a dia da sala de aula, entre elas:\n\nAproximação da realidade escolar com o cotidiano do aluno;\nMaior engajamento dos alunos no aprendizado;\nMelhor aproveitamento do tempo do professor;\nAmpliação do potencial do professor para intervenções efetivas;\nPlanejamento personalizado.\n\nA carga horária prevista para a conclusão do curso é de 40h.\n\nVamos lá? Comece agora mesmo!","tutor":"Adolfo Tanzi Neto, Fernando Mello Trevisani and Lilian Bacich","provider":"Coursera","language":"Portuguese","skills":["hybrid education","digital pedagogy","brazil","south america"],"subject":"Course Development","studentsInterested":"5","courseLink":"https://www.coursera.org/learn/ensino-hibrido","classCentralLink":"https://www.class-central.com/course/coursera-ensino-hibrido-personalizacao-e-tecnologia-na-educacao-4435"},{"title":"Teach English Now! Second Language Reading, Writing, and Grammar","about":"In this course, you will learn ideas for teaching reading and writing courses, and how to include grammar instruction within them. Learn how to help students with differing types of reading problems and how to implement both intensive and extensive reading strategies. Learn strategies to engage students in the stages of writing--pre-writing, writing, and post-writing. Find out about different writing problems that students may encounter. Incorporate grammar through the use of noticing and input enhancement.","tutor":"Jessica Cinco, Dr. Shane Dixon and Dr. Justin Shewell","provider":"Coursera","language":"English","skills":["writing","teaching","grammar","usa","north america"],"subject":"Teacher Development","studentsInterested":"259","courseLink":"https://www.coursera.org/learn/tesol-writing","classCentralLink":"https://www.class-central.com/course/coursera-teach-english-now-second-language-reading-writing-and-grammar-6190"},{"title":"Managing Behaviour for Learning","about":"Enabling you to get the most from your students\nWith effective behaviour management in your classroom, your learners will gain as a result and you’ll enjoy your teaching more.\nYou’ll explore first how your behaviour influences your students’, looking at how you control emotional responses and interact with students. Then, you’ll learn techniques and develop your capability to achieve consistency in managing behaviour, recognise positive behaviour and build trust in your classroom.\nYou’ll be supported by experienced teachers, encouraged to actively reflect on your classroom practice, and share your experience as part of the course discussions.\nManaging Behaviour for Learning is a continuing professional development (CPD) course designed for teachers of science, technology, engineering and mathematics (STEM) subjects, focusing mainly on the context of UK secondary schools and colleges.\nAlthough the course draws from examples experienced in the UK, the material covered is relevant to an international audience and to non-STEM teachers.","tutor":"Paul Dix","provider":"FutureLearn","language":"English","skills":["discipline","behaviour management"],"subject":"Teacher Development","studentsInterested":"103","courseLink":"https://www.futurelearn.com/courses/managing-behaviour-for-learning","classCentralLink":"https://www.class-central.com/course/futurelearn-managing-behaviour-for-learning-6272"},{"title":"Docencia para la capacitación laboral y el aprendizaje a lo largo de la vida.","about":"El curso tiene como propósito promover el desarrollo de habilidades de gestión educativa en el aula para fomentar los aprendizajes del estudiante que trabaja y se forma a lo largo de su trayectoria laboral y personal a lo largo de la vida.\n\n\nEste curso es parte del proyecto Erasmus + \"MOOC MAKER\": Construcción de Capacidades de Gestión de MOOCs en la Educación Superior. Más información visitar: http://www.mooc-maker.org/","tutor":"Oscar Jerez","provider":"Coursera","language":"Spanish","skills":["job training","continuing education","new-moocs-2017"],"subject":"Education \u0026 Teaching","studentsInterested":"14","courseLink":"https://www.coursera.org/learn/docencia-capacitacion-laboral","classCentralLink":"https://www.class-central.com/course/coursera-docencia-para-la-capacitacion-laboral-y-el-aprendizaje-a-lo-largo-de-la-vida-9632"},{"title":"Lectura comprensiva en niños de 4 a 8 años: temas centrales para su desarrollo.","about":"En este curso los estudiantes podrán actualizar sus conocimientos teóricos respecto a la enseñanza y aprendizaje de la lectura en educación inicial y los primeros años de educación básica. El objetivo es que los estudiantes desarrollen habilidades que les permitan integrar el modelo simple de la lectura en sus prácticas pedagógicas","tutor":"Macarena Silva","provider":"Coursera","language":"Spanish","skills":["teaching","early childhood","reading skills"],"subject":"K12","studentsInterested":"30","courseLink":"https://www.coursera.org/learn/lecturacomprensivaenninos","classCentralLink":"https://www.class-central.com/course/coursera-lectura-comprensiva-en-ninos-de-4-a-8-anos-temas-centrales-para-su-desarrollo-10788"},{"title":"Foundations of Teaching for Learning: Being a Teacher","about":"The Foundations of Teaching for Learning programme is designed for teachers and educators of all abilities and backgrounds; from those who are new to the classroom and looking for development, to experienced teachers ready to reboot their skills for modern education. With dynamic lessons taught by established and respected professionals from across the Commonwealth, this eight course programme will see you develop and strengthen your skills in teaching, professionalism, assessment, and more. As you carry on through the programme, you will find yourself strengthening not only your professional skills, but your connection with colleagues across the globe. A professional development opportunity not to be missed.\n\nHow we teach has its foundation in how we were taught and how we learned. This course provides an opportunity for you to reflect on your personal and professional development as a teacher. Through reflection and portfolio development you will enhance your knowledge and understanding of how to promote learning.\n\nEnhance your course by joining the Commonwealth teaching community on our website, Facebook and Twitter.","tutor":"Dennis Francis","provider":"Coursera","language":"English","skills":["europe","uk"],"subject":"Teacher Development","studentsInterested":"351","courseLink":"https://www.coursera.org/learn/being-a-teacher","classCentralLink":"https://www.class-central.com/course/coursera-foundations-of-teaching-for-learning-being-a-teacher-875"},{"title":"Compassionate Leadership Through Service Learning with Jane Goodall and Roots \u0026 Shoots","about":"Join us for an action-oriented online teacher professional development course! This course will teach participants how to identify and implement a local service-learning campaign using the Roots \u0026 Shoots program model. The service learning curriculum equips participants with teacher resources to discover the differences between service-learning and community service, and apply the Roots \u0026 Shoots model to help youth have a voice in identifying and addressing needs in their community.\n\nAt Roots \u0026 Shoots, our goal is to develop compassionate leaders to make the world a better place for people, other animals and the environment. Help us achieve that goal! Complete the course and mentor young people to lead change in their communities using community mapping, collaborating with stakeholders, and designing practical solutions in the form of campaigns.\n\nConnect young people to Dr. Jane Goodall’s message of hope while facilitating a sense of empowerment that comes from helping others!","tutor":"Hope Martinez, Brad McLain, Erin Viera-Orr and Jane Goodall","provider":"Coursera","language":"English","skills":["education","jane goodall","community programs"],"subject":"K12","studentsInterested":"103","courseLink":"https://www.coursera.org/learn/compassionate-leadership-jane-goodall","classCentralLink":"https://www.class-central.com/course/coursera-compassionate-leadership-through-service-learning-with-jane-goodall-and-roots-shoots-2101"},{"title":"Get Organized: How to be a Together Teacher","about":"This course is designed for classroom teachers who juggle time-sensitive tasks and often-exhausting teaching schedules. With an eye toward long-term sustainability, The Together Teacher examines the purpose for planning ahead, provides tools for tracking time commitments, deadlines and tasks, and helps teachers develop a personal organization system that interacts with their day-by-day practices.\n\nAll teachers, from the pen \u0026 paper list maker to the tech-savvy digital maven, will benefit from the no-nonsense approach to \"togetherness\" that\u0027s presented in this course. We don\u0027t care what format you use; we care that you know when you have free time during the day, and that you have a plan for using it.","tutor":"Maia Heyck-Merlin","provider":"Coursera","language":"English","skills":["k-12 education","education","teacher professional development","classroom teaching","teacher training","usa","north america"],"subject":"Teacher Development","studentsInterested":"2.4k","courseLink":"https://www.coursera.org/learn/together-teacher","classCentralLink":"https://www.class-central.com/course/coursera-get-organized-how-to-be-a-together-teacher-2113"},{"title":"Powerful Tools for Teaching and Learning: Digital Storytelling","about":"Powerful Tools for Teaching and Learning: Digital Storytelling introduces educators to digital storytelling and explores ways to use digital stories to enhance students’ learning experiences. The course is designed to be comprehensive yet fundamental. By comprehensive we mean that the course provides a solid foundation for all of the components of a digital story and illustrates these components with tutorials, example stories, and links to additional readings. The course also provides a hands-on opportunity for learners to create their own digital stories. The course is fundamental because it covers the basic process of creating a digital story starting with just a simple script and as little as one image.\n\nThis course is intended for K-12 teachers in all disciplines, although it is open to anyone with an interest in digital storytelling. Course participants will use WeVideo (https://www.wevideo.com/), a free web-based video editing program, to create a digital story that could be shared both online and with students in the classroom. Teachers in the state of Texas may be eligible to receive Continuing Professional Education units if they complete the major requirements of the course.","tutor":"Bernard Robin and Sara Mcneil","provider":"Coursera","language":"English","skills":["teacher professional development","digital storytelling","story writing","usa","north america"],"subject":"K12","studentsInterested":"907","courseLink":"https://www.coursera.org/learn/digital-storytelling","classCentralLink":"https://www.class-central.com/course/coursera-powerful-tools-for-teaching-and-learning-digital-storytelling-2170"},{"title":"Explorando os recursos educacionais da Khan Academy","about":"O curso \"Explorando os recursos educacionais da Khan Academy\" tem como objetivo ajudar todos aqueles que desejam utilizar a plataforma como um recurso pedagógico. No decorrer do curso, você terá a oportunidade de conhecer a plataforma do ponto de vista do estudante e do ponto de vista do tutor, sabendo exatamente como utilizá-la em favor da aprendizagem. Ao longo do curso, você terá todas as orientações de que precisa para utilizar a plataforma com seus alunos.\n\nA plataforma Khan Academy foi concebida para oferecer aprendizado personalizado para todas as idades, com exercícios, vídeos e um painel de acompanhamento que habilita os estudantes a aprender no seu próprio ritmo. Para o professor, a Khan Academy é uma poderosa ferramenta pedagógica que possibilita personalizar o percurso de aprendizagem dos alunos, dinamizar a experiência educacional com recursos de gamificação e monitorar o progresso de todos e de cada um, com relatórios simples e objetivos.\n\nEste curso é autoinstrucional, ou seja, a aprendizagem acontece na interação com o conteúdo, com outros participantes e por meio da realização das atividades propostas. Assim, o cursista tem mais flexibilidade para estudar no seu próprio ritmo, de acordo com a sua disponibilidade de tempo.\n\nComo material didático, disponibilizamos textos, links, vídeo tutoriais, quizzes e uma proposta de atividade final, que envolve a sistematização da experiência de uso da plataforma como recurso pedagógico.\n\nPara ser certificado, o cursista deve obter 100% de aproveitamento nas avaliações ofertadas ao longo do curso, que são apresentadas em formato de teste, com possibilidade de mais de uma tentativa.\n\n\nInstituições envolvidas no projeto Khan Academy no Brasil:\n\nA Fundação Lemann é parceira internacional da Khan Academy no Brasil e tem experiência na implementação da plataforma em diferentes contextos educacionais, incluindo ONGs, instituições de ensino públicas e privadas.\n\nComo instituições parceiras do projeto no Brasil, temos o Instituto Península, o Instituto Natura e o Ismart. Ainda, agradecemos o apoio do Instituto Singularidades no desenvolvimento deste programa de formação.\n\nParticipe de outros cursos da Fundação Lemann no Coursera - https://www.coursera.org/lemann","tutor":"Julciane Rocha and Ana Paula Manzalli","provider":"Coursera","language":"Portuguese","skills":["online education","khan academy","brazil","south america"],"subject":"Online Education","studentsInterested":"13","courseLink":"https://www.coursera.org/learn/khanacademy","classCentralLink":"https://www.class-central.com/course/coursera-explorando-os-recursos-educacionais-da-khan-academy-4479"},{"title":"Enseñanza de la Escritura Emergente.","about":"En este curso los estudiantes podrán profundizar aspectos teóricos sobre la enseñanza y aprendizaje de la escritura en educación inicial y los primeros años de educación básica. El objetivo es que los estudiantes conozcan cómo se desarrolla la escritura emergente y que puedan incorporar estrategias para poder integrarlas en el aula, a fin de promover una adecuada adquisición de la escritura durante los primeros años del niño.","tutor":"Carmen Sotomayor","provider":"Coursera","language":"Spanish","skills":["writing","teaching","writing skills"],"subject":"K12","studentsInterested":"18","courseLink":"https://www.coursera.org/learn/escrituraemergente","classCentralLink":"https://www.class-central.com/course/coursera-ensenanza-de-la-escritura-emergente-10789"},{"title":"Fundamentals of Online Education: Planning and Application","about":"In this course you will learn about the fundamentals of online education. The emphasis will be on planning and application. In the planning phase, you will explore online learning pedagogy, online course design,privacy and copyright issues, online assessments, managing an online class, web tools and Learning Management Systems. In the application phase, you will create online learning materials. The final project for the course will consist of you building an online course based on everything that you learned and created in the course.","tutor":"Fatimah Wirth","provider":"Coursera","language":"English","skills":["usa","north america"],"subject":"Online Education","studentsInterested":"266","courseLink":"https://www.coursera.org/course/foe","classCentralLink":"https://www.class-central.com/course/coursera-fundamentals-of-online-education-planning-and-application-409"},{"title":"On the Hunt for Feedback: Self-Directed Teacher Improvement","about":"On the Hunt for Feedback: Self-Directed Teacher Improvement\nTeaching is isolating.  Most of the work happens behind a closed door.  Teachers want feedback about their teaching, but encounter three problems:\n1. They don\u0027t get much.  The principal or department head doesn\u0027t visit very often.  And there’s no built-in structure at their school for peer observation.\n2. The feedback isn\u0027t helpful or actionable.\nSometimes it\u0027s just happy talk -- 98% of American teachers are rated satisfactory -- and while everyone likes a pat on the back, evaluations that say \"you were wonderful\" don\u0027t make better teachers.  Or sometimes the feedback is critical in ways that don’t present clear next steps.  Sometimes it\u0027s vague or just plain wrong.  \n3. Some teachers can be defensive.  \n(Yes, we know – only SOME people are defensive, but not YOU.  You are different.  You handle feedback with grace, confidence, and a \"let\u0027s fix this\" orientation. {Except sometimes maybe not.})\n***\nThis course is based on a simple idea: that teachers take control of their own improvement by aggressively seeking out and acting upon feedback about their teaching.","tutor":"Orin Gutlerner","provider":"Coursera","language":"English","skills":["usa","north america"],"subject":"Teacher Development","studentsInterested":"123","courseLink":"https://www.coursera.org/course/teacherfeedback","classCentralLink":"https://www.class-central.com/course/coursera-on-the-hunt-for-feedback-self-directed-teacher-improvement-878"},{"title":"Children Acquiring Literacy Naturally","about":"In this short course you will explore the possibility that children might acquire written language in a way that is similar to how they acquire spoken language—without instruction. You will encounter various aspects of behavioral science and technology that are relevant to this proposition. You will have the opportunity to learn the the perceptual, cognitive, and neurological capacities of children during their first years of life. You will advance your understanding of children and how they learn language. You will also be more attuned to current advances in the technology of human machine interactions, and what these phenomena imply for learning to read at an early age.","tutor":"Dominic William Massaro","provider":"Coursera","language":"English","skills":["usa","north america"],"subject":"K12","studentsInterested":"278","courseLink":"https://www.coursera.org/learn/children-literacy","classCentralLink":"https://www.class-central.com/course/coursera-children-acquiring-literacy-naturally-672"},{"title":"The Brain-Targeted Teaching® Model for 21st Century Schools","about":"New findings from the neuro- and cognitive sciences have the potential to inform classroom instruction and influence educational practices for children at all developmental levels.  Translating this research to practice, however, is often challenging for educational practitioners.  This course will offer practical application of research by linking it with the Brain-Targeted Teaching® Model (BTT)—a pedagogical framework for using research in the neuro- and cognitive sciences as well as research-based effective instruction to guide teachers in planning, implementing, and assessing a sound program of instruction for all learners. \nParticipants in the course will examine research from the brain sciences that can inform educational practice and be able to implement research findings using the instructional framework, The Brain-Targeted Teaching® Model. This model presents six stages, or “brain targets” of the teaching and learning process. The components include (1) establishing the emotional climate for learning, (2) creating the physical learning environment, (3) designing the learning experience, (4) teaching for the mastery of content, skills, and concepts, (5) teaching for the extension and application of knowledge, and (6) evaluating learning. A central theme of the model is the integration of the arts to foster retention of new information, conceptual development, and higher-order thinking and creative problem-solving.\nCourse objectives:\nDescribe themes in brain research that can inform educational practice consistent with the Brain-Targeted Teaching® Model.","tutor":"Mariale Hardiman","provider":"Coursera","language":"English","skills":["usa","north america"],"subject":"K12","studentsInterested":"449","courseLink":"https://www.coursera.org/course/braintargeted","classCentralLink":"https://www.class-central.com/course/coursera-the-brain-targeted-teaching-model-for-21st-century-schools-879"},{"title":"Engaging Students through Cooperative Learning","about":"Some of the most powerful and widely applicable research-proven instructional practices are those of cooperative learning, which are highly effective in engaging and motivating students. When implemented correctly, such practices have been proven to increase students’ achievement in a wide range of content areas at all grade levels. Cooperative learning models will be explored to understand the variables that differentiate group work from true cooperative learning, including individual accountability and group rewards. The effectiveness of student teams to support learning through peer motivation, peer assessment and reteaching will be examined in depth.\nCourse Objectives\nDefine the concept of cooperative learning and how it relates to today’s learner.\nDescribe how cooperative learning works when there is individual accountability, equal opportunities for success and team recognition built into a task.\nDescribe the four theoretical perspectives of cooperative learning.\nConsider the impact of cooperative learning on 21st century skills and meeting the cognitive demands of the Common Core State Standards.","tutor":"Paul Miller","provider":"Coursera","language":"English","skills":["usa","north america"],"subject":"Course Development","studentsInterested":"369","courseLink":"https://www.coursera.org/course/cooperativelearning","classCentralLink":"https://www.class-central.com/course/coursera-engaging-students-through-cooperative-learning-886"},{"title":"Introduction to Software Engineering","about":"When the learning objectives are achieved, you can get access to the fast lane (3 years) bachelor education of software engineering at the Fontys University of Applied Sciences (Eindhoven, The Netherlands).","tutor":"Frank Peeters, Nico Kuijpers and Coen Crombach","provider":"Canvas Network","language":"Dutch","skills":["software development","stem","ict"],"subject":"STEM","studentsInterested":"138","courseLink":"https://http://www.canvas.net/browse/stichting-fontys-hogescholen/courses/software-engineering","classCentralLink":"https://www.class-central.com/course/canvas-network-introduction-to-software-engineering-11103"},{"title":"Information Systems and Computer Applications, Part 4: Programming","about":"This is the fourth part of an introductory business information systems course, designed to help you pass the CLEP Information Systems and Computer Applications exam and introduce you to the amazing world of Information Technology.\nIn this course, you will learn the basic concepts of information systems and their application.","tutor":"Ignacio Despujol, Carlos Turró, Miguel Rebollo and Vicent Botti Navarro","provider":"edX","language":"English","skills":["upvalenciax"],"subject":"Test Prep","studentsInterested":"20","courseLink":"https://www.edx.org/course/it-fundamentals-business-professionals-upvalenciax-isc101-4x","classCentralLink":"https://www.class-central.com/course/edx-information-systems-and-computer-applications-part-4-programming-3785"},{"title":"Developing Your Research Project","about":"##\nCuriosity is one of humanity’s most important characteristics. It has enabled us to make the unknown known, to break barriers and to shine a light on all aspects of life, from our day to day hobbies to the exploration of the stars. Our innate desire to explore is responsible for many of our proudest achievements. This course will help train you to harness your curiosity and use it to undertake your own research projects in a scholarly manner.\nThe course is intended for anyone who is currently undertaking or planning to undertake a piece of academic research, be that the Extended Project Qualification (EPQ), International Baccalaureate Extended Essay, Welsh Baccalaureate Individual Project, coursework or a piece of independent scholarship. The course is running in June, September and October 2016 so you can chose the start date that suits you (select your preference on the right-hand-side).\nDeveloped and delivered by research-active academics, the course will support you with every step of the research process, from developing a hypothesis and finding sources to writing up and presenting one’s findings.\nThe practical, hands-on lessons will give you the opportunity to share your ideas with fellow researchers from all over the world, to receive peer feedback on your research proposals and enable you to review and comment on the work of other researchers, building a supportive community of like-minded curious learners.\nThere are no specific course requirements, other than a curious disposition and desire to undertake some academic research.","tutor":"Chris Fuller Emma Thompson","provider":"FutureLearn","language":"English","skills":["europe","academic research","graduate studies","dissertation","thesis","uk"],"subject":"Higher Education","studentsInterested":"646","courseLink":"https://www.futurelearn.com/courses/research-project","classCentralLink":"https://www.class-central.com/course/futurelearn-developing-your-research-project-2138"},{"title":"English for Teaching Purposes","about":"Thinking about teaching your university subject in English but it’s not the Language you normally use?\nThen, English for teaching purposes is the course for you. A course on English and teaching methodology that aims to help university lecturers do their teaching in English, in line with university internationalisation policies.\n\nThe course structure is the same for all learners and there are opportunities for them to link up with colleagues from universities all over the world who share the same discipline and discourse community, to ask questions and exchange ideas.\nThis MOOC targets lecturers who wish to begin using English in their teaching. A priori, this means university lecturers from countries where English is not the L1 or a widely-used language (Romance language-speaking countries, for example), though in fact the course is open to teachers from all educational stages who want to teach through English, following the principles of EMI (English Medium Instruction).\n\nOn completing the course, you should be able to do the following.\n\na) Teach a university subject in English, having gained the necessary confidence and skills.\n\nb) Integrate all aspects of CLIL (methodological, pedagogical, strategic, attitudinal, motivational, linguistic, sociolinguistic and pragmatic) to put together their own English-medium course on their particular subject.\n\nc) Describe the characteristics of the university lecture discourse genre (planning, agents, channels, phases, dynamics, and current flexibility of the genre).\n\nd) Understand and perform the basic linguistic macro-functions within English teaching discourse.\n\ne) Understand and perform, using the appropriate linguistic exponents (vocabulary, structures, and phraseology), the main micro-functions in English teaching discourse: metalinguistic, informative, evaluative, inductive, and social.\n\nf) Consolidate their oral expression and interaction skills, and their grammar and vocabulary, at English levels C1 and C2 as defined by the Council of Europe.\n\n\nEnglish for Teaching Purposes is a course provided by the Language Service at the Universitat Autònoma de Barcelona (UAB).","tutor":"Ian James","provider":"Coursera","language":"English","skills":["spain","europe"],"subject":"Teacher Development","studentsInterested":"281","courseLink":"https://www.coursera.org/learn/teaching-english","classCentralLink":"https://www.class-central.com/course/coursera-english-for-teaching-purposes-2582"},{"title":"Criterios para la Gestión y el Aseguramiento de la Calidad en la Educación Superior","about":"El presente curso tiene como propósito comprender el concepto, componentes e implicancias en la Gestión y Aseguramiento de la Calidad en la Educación Superior. Por ello, se revisará: los fines de las educación superior; qué son los sistemas de educación superior, criterios o ámbitos a considerar en la educación superior; procesos de enseñanza y aprendizaje; sistemas de acreditación entre otros. Así́ mismo, se analizarán los criterios e indicadores a tener en cuenta en los procesos de gestión, \"accountability\" y aseguramiento involucrados en dichos procesos.\n\nMetas del curso son:\n\n• Analizar las implicancias y alcances de los distintos conceptos, modelos e instrumentos involucrados en procesos de calidad en la educación superior.\n\n• Identificar los componentes y dimensiones consideradas en los procesos de aseguramiento de la calidad en la educación superior, y su vinculación con los procesos de gestión organizacional.\n\n• Aplicar los criterios para el aseguramiento de la calidad en la ES, en diversos casos o situaciones, proponiendo eventuales vías de solución.","tutor":"Oscar Jerez","provider":"Coursera","language":"Spanish","skills":["higher education","quality assurance","new-moocs-2017"],"subject":"Higher Education","studentsInterested":"10","courseLink":"https://www.coursera.org/learn/calidadeducacionsuperior","classCentralLink":"https://www.class-central.com/course/coursera-criterios-para-la-gestion-y-el-aseguramiento-de-la-calidad-en-la-educacion-superior-9064"},{"title":"Prepare to Run a Code Club","about":"Prepare to run a fun and educational Code Club\nCode Club is a global network of volunteers and educators who run free coding clubs for 9- to 13-year-olds.\nThis short course will give you the confidence and skills to run a Code Club for young people and inspire the next generation to get excited about computing and digital making.\nYou’ll get practical advice and tips from volunteers, teachers, and the Code Club team, and you’ll explore the free resources which Code Club provides.\nThis course is ideal for volunteers, parents, and educators who are keen to join the Code Club network to run a coding club for young people.\nScratch 2, online or offline version.","tutor":"Sarah Sheerman-Chase","provider":"FutureLearn","language":"English","skills":["stem","coding clubs","new-moocs-2017"],"subject":"STEM","studentsInterested":"27","courseLink":"https://www.futurelearn.com/courses/code-club","classCentralLink":"https://www.class-central.com/course/futurelearn-prepare-to-run-a-code-club-9557"},{"title":"Ubiquitous Learning and Instructional Technologies","about":"This course will analyze currently available technologies for learning. Areas addressed include: learning management systems, intelligent tutors, computer adaptive testing, gamification, simulations, learning in and through social media and peer interaction, universal design for learning, differentiated instruction systems, big data and learning analytics, attention monitoring, and affect-aware systems. Participants will explore the processes for selection and implementation of suitable technologies, the design of electronic learning resources, design and application of digital media in teaching and learning, familiarization with web usability and accessibility, and critical analysis of the benefits of technologies in education.","tutor":"Dr William Cope","provider":"Coursera","language":"English","skills":["learning","lms","technology"],"subject":"Course Development","studentsInterested":"58","courseLink":"https://www.coursera.org/learn/ubiquitouslearning","classCentralLink":"https://www.class-central.com/course/coursera-ubiquitous-learning-and-instructional-technologies-11068"},{"title":"Negotiating Learner Differences: Towards Productive Diversity in Learning","about":"An investigation of the dimensions of learner diversity: material (class, locale), corporeal (age, race, sex and sexuality, and physical and mental characteristics) and symbolic (culture, language, gender, family, affinity and persona). Examines social-cultural theories of difference, as well as considering alternative responses to these differences in educational settings - ranging from broad, institutional responses to specific pedagogical responses within classes of students. The course also focuses on the application of learning technologies and new media to meet the needs of diverse populations of learners. Its main practical question is, how do we use educational technologies to create learning environments in which learning experiences can be customized and calibrated to meet the precise needs of particular learners? Topics include: universal design for learning, differentiated instruction systems, and adaptive and personalized learning environments.","tutor":"Dr William Cope","provider":"Coursera","language":"English","skills":["learning","diversity"],"subject":"Teacher Development","studentsInterested":"62","courseLink":"https://www.coursera.org/learn/learnerdifferences","classCentralLink":"https://www.class-central.com/course/coursera-negotiating-learner-differences-towards-productive-diversity-in-learning-11070"},{"title":"Advanced Instructional Strategies in the Virtual Classroom","about":"This course will help you ‘up’ your game and develop the advanced level skills and techniques that elude even some of the most experienced virtual teachers. We will examine the pitfalls beginning teachers run into and learn how to overcome them by focusing on the fundamentals that have the greatest impact on student learning in a blended or online environment. Throughout the course, you will be challenged to assess your own skills and apply what you are learning by creating a guide, assignment, or resource that you will be able to use in a class that you teach or hope to teach someday soon. By the end of the course, you will not only have a better understanding of the basics, you will be able to put them together like a pro and empower your future students to be voracious learners who are ready to go out and make the world a better place to live.\n\nUpon completing this course, you will be able to:\n1. Meet your students\u0027 needs and craft a better virtual learning experience for them\n2. Set up the learning environment so you get to know your students and they get to know each other\n3. Personalize learning by providing feedback using a variety of online tools\n5. Identify at-risk students and employ effective strategies for teaching them\n6. Compare and contrast online and face-to-face learning communities\n7. Apply strategies to make virtual courses more human","tutor":"Laura Soule","provider":"Coursera","language":"English","skills":["usa","north america"],"subject":"Online Education","studentsInterested":"338","courseLink":"https://www.coursera.org/learn/teaching-strategies","classCentralLink":"https://www.class-central.com/course/coursera-advanced-instructional-strategies-in-the-virtual-classroom-1567"},{"title":"U101: Understanding College and College Life","about":"College can be confusing and intimidating, but U101 can help. If you were just admitted to college and are nervous about what the next step in life might look like, this course is for you. If you are the parent of a newly admitted college student and curious about what college life is like, this course is also for you.\n\nWhile your specific college will, no doubt, provide additional orientation material, we wanted to give some basic information about what life might be like at a large American University. You might be years away from college or enrolled right now; either way, U101 has some excellent advice from college students, professors, administrators, and staff.\n\nAt the conclusion of the course, learners should:\n1. Understand the basics of how colleges and universities operate.\n2. Identify and describe what faculty are looking for in college-level academic work.\n3. List some effective study strategies.\n4. Identify some strategies for exploring and selecting a major.\n5. Identify the various types of grants and scholarships available and describe the steps involved in applying to these.\n6. Discuss the college life, with special attention to the benefits/limitations of living on or off campus.\n7. Identify some strategies for getting the most out of campus life activities (investigating student clubs, fraternities, sororities, etc.).\n\nThe course is divided into 4 weeks/8 lessons, which provide an overview of the different aspects of college life. If you were just watching the videos and looking at some of the links, the whole course would take about 4-5 hours.\n\nWeek 1\nLesson 1. Welcome to U101!\nLesson 2. Understanding the Nature of College\n\nWeek 2\nLesson 3. Succeeding as a Student\nLesson 4. Building Your Major\n\nWeek 3\nLesson 5. Financing Your Education\nLesson 6. Living On and Off Campus\n\nWeek 4\nLesson 7. Getting Involved in Campus Life\nLesson 8. Conclusion\n\nPlease join us for a short exploration of modern American Colleges. Hopefully, this course can help demystify your upcoming college experience.","tutor":"Dr. Matt McGarrity and First Year Programs","provider":"Coursera","language":"English","skills":["college readiness","usa","north america"],"subject":"Higher Education","studentsInterested":"40","courseLink":"https://www.coursera.org/learn/college-life","classCentralLink":"https://www.class-central.com/course/coursera-u101-understanding-college-and-college-life-4910"}]