[{"title":"Understanding Dementia","about":"The 7-week curriculum is divided into three units: ‘the brain’, ‘the diseases’ and ‘the person’. It covers a range of topics including basic brain anatomy, pathology, dementia research, risk factors, the difference between normal ageing and dementia, diagnosis, medical management, living with dementia, progression and staging, palliation, behavioural and psychological symptoms, therapeutic approaches, dementia friendly communities and more.\nThe content is delivered by 18 experts in the field of dementia including neuroscientists, health scientists, clinicians, dementia care professionals and people living with dementia.\nParticipants will have an opportunity to engage with the material via video clips, activities, games, scenarios and quizzes. Furthermore, they will have an opportunity to meet an international network of peers online to discuss the key issues surrounding dementia.","tutor":"Prof Fran McInerney","provider":"Independent","language":"English","skills":["australia"],"subject":"Disease \u0026 Disorders","studentsInterested":"11.2k","courseLink":"https://http://www.utas.edu.au/wicking/understanding-dementia","classCentralLink":"https://www.class-central.com/course/understanding-dementia-981"},{"title":"Understanding Clinical Research: Behind the Statistics","about":"If you’ve ever skipped over`the results section of a medical paper because terms like “confidence interval” or “p-value” go over your head, then you’re in the right place. You may be a clinical practitioner reading research articles to keep up-to-date with developments in your field or a medical student wondering how to approach your own research. Greater confidence in understanding statistical analysis and the results can benefit both working professionals and those undertaking research themselves.\n\nIf you are simply interested in properly understanding the published literature or if you are embarking on conducting your own research, this course is your first step. It offers an easy entry into interpreting common statistical concepts without getting into nitty-gritty mathematical formulae. To be able to interpret and understand these concepts is the best way to start your journey into the world of clinical literature. That’s where this course comes in - so let’s get started!\n\nThe course is free to enroll and take. You will be offered the option of purchasing a certificate of completion which you become eligible for, if you successfully complete the course requirements. This can be an excellent way of staying motivated! Financial Aid is also available.","tutor":"Dr Juan H Klopper","provider":"Coursera","language":"English","skills":["clinical trials","statistics","africa","clinical research","south africa"],"subject":"Health Care","studentsInterested":"7.3k","courseLink":"https://www.coursera.org/learn/clinical-research","classCentralLink":"https://www.class-central.com/course/coursera-understanding-clinical-research-behind-the-statistics-5037"},{"title":"Vital Signs: Understanding What the Body Is Telling Us","about":"The vital signs – heart rate, blood pressure, body temperature, respiration rate, and pain – communicate important information about the physiological status of the human body. In this six-part course we explore the anatomy and physiology underlying the vital signs so that you will develop a systematic, integrated understanding of how the body functions. Relevant body systems are reviewed including cardiovascular and respiratory, followed by explanations of how the function of these systems affects vital signs. We discuss normal ranges, normal variants, and the mechanisms that underlie changes in the objective measurement of vital signs. The course also includes demonstrations of appropriate techniques for measuring vital signs in yourself and others.\n\nThe course is designed for a broad, general audience but will be particularly interesting for individuals working in healthcare, those considering a career as a healthcare professional, lay caregivers, those with an interest in personal health and fitness, or anyone who simply wants to understand how the body functions.","tutor":"Connie Scanga","provider":"Coursera","language":"English","skills":["human body","physiology","health","usa","north america"],"subject":"Nutrition \u0026 Wellness","studentsInterested":"9.8k","courseLink":"https://www.coursera.org/learn/vital-signs","classCentralLink":"https://www.class-central.com/course/coursera-vital-signs-understanding-what-the-body-is-telling-us-1887"},{"title":"Mindfulness for Wellbeing and Peak Performance","about":"Learn mindfulness techniques to reduce stress and improve performance\nStressed by the pace of modern life? Mindfulness might be the answer. Research shows that when you’re not deliberately paying attention to something, your brain goes into default mode causing increased anxiety and poor communication. Mindfulness can help end this unproductive behaviour. In this online course, you’ll learn how to incorporate mindfulness practices into your life, to reduce stress and improve your personal and professional life.\nThis course is for anyone, because everyone can benefit from mindfulness. No previous experience of mindfulness is required. We will explain how mindfulness works, but above all this is a practical course. We will ask you to explore different mindfulness techniques and reflect on your experience.\nThis course is not designed to be therapeutic for significant health problems so if you have any concerns in this regard then it is recommended that you speak to a suitably qualified health practitioner.","tutor":"Dr Richard Chambers and Dr Craig Hassed","provider":"FutureLearn","language":"English","skills":["mental health","wellness","australia"],"subject":"Nutrition \u0026 Wellness","studentsInterested":"10.9k","courseLink":"https://www.futurelearn.com/courses/mindfulness-wellbeing-performance","classCentralLink":"https://www.class-central.com/course/futurelearn-mindfulness-for-wellbeing-and-peak-performance-3714"},{"title":"Stanford Introduction to Food and Health","about":"Around the world, we find ourselves facing global epidemics of obesity, Type 2 Diabetes and other predominantly diet-related diseases. To address these public health crises, we urgently need to explore innovative strategies for promoting healthful eating. There is strong evidence that global increases in the consumption of heavily processed foods, coupled with cultural shifts away from the preparation of food in the home, have contributed to high rates of preventable, chronic disease. In this course, learners will be given the information and practical skills they need to begin optimizing the way they eat. This course will shift the focus away from reductionist discussions about nutrients and move, instead, towards practical discussions about real food and the environment in which we consume it. By the end of this course, learners should have the tools they need to distinguish between foods that will support their health and those that threaten it. In addition, we will present a compelling rationale for a return to simple home cooking, an integral part of our efforts to live longer, healthier lives.\n\nView the trailer for the course here: https://www.youtube.com/watch?v\u003dz7x1aaZ03xU","tutor":"Maya Adam","provider":"Coursera","language":"English","skills":["diet","obesity","healthy eating","usa","north america"],"subject":"Nutrition \u0026 Wellness","studentsInterested":"4.0k","courseLink":"https://www.coursera.org/learn/food-and-health","classCentralLink":"https://www.class-central.com/course/coursera-stanford-introduction-to-food-and-health-5057"},{"title":"Child Nutrition and Cooking","about":"Eating patterns that begin in childhood affect health and well-being across the lifespan. The culture of eating has changed significantly in recent decades, especially in parts of the world where processed foods dominate our dietary intake. This course examines contemporary child nutrition and the impact of the individual decisions made by each family. The health risks associated with obesity in childhood are also discussed. Participants will learn what constitutes a healthy diet for children and adults and how to prepare simple, delicious foods aimed at inspiring a lifelong celebration of easy home-cooked meals. This course will help prepare participants to be the leading health providers, teachers and parents of the present and future.The text and other material in this course may include the opinion of the specific instructor and are not statements of advice, endorsement, opinion, or information of Stanford University.","tutor":"Maya Adam","provider":"Coursera","language":"English","skills":["nutrition","usa","north america"],"subject":"Nutrition \u0026 Wellness","studentsInterested":"2.0k","courseLink":"https://www.coursera.org/learn/childnutrition","classCentralLink":"https://www.class-central.com/course/coursera-child-nutrition-and-cooking-816"},{"title":"The Addicted Brain","about":"This is a course about addiction to drugs and other behaviors. It will describe what happens in the brain and how this information helps us deal with and overcome addiction. It will also discuss other topics such as government policy and our vulnerability to take drugs.","tutor":"Michael Kuhar","provider":"Coursera","language":"English","skills":["usa","north america"],"subject":"Disease \u0026 Disorders","studentsInterested":"1.5k","courseLink":"https://www.coursera.org/learn/addiction-and-the-brain","classCentralLink":"https://www.class-central.com/course/coursera-the-addicted-brain-1403"},{"title":"Food as Medicine","about":"How can we use food as medicine?\nThis course introduces the concept of food as medicine. You will explore how food can be important both in preventative health and as an aid in the management of certain chronic diseases today, in the past and in the future. You will also learn about what’s in food that gives it the potential to improve our health and how to recognise which types of foods are essential for health and wellbeing, and how food can play an important role in treating/preventing disease.\nThis course will have broad general interest appeal to everyone interested in food, nutrition and health. But it will be of particular interest to healthcare professionals who are looking to have more evidenced-based information, to assist them in providing food-based recommendations to their patients.\nAfN Certified Course\nThis course has been certified by the Association for Nutrition. It meets AfN standards for nutrition training of individuals working at Level 1 on the Qualifications and Credit Framework (QCF). What does AfN Certification say about this course - please visit the Association for Nutrition website.\nPlease note completion of this course does not lead to registration on the UK Voluntary Register of Nutritionists nor does it equip any individual to practice ethically as a nutritionist.\nBDA Endorsed Course","tutor":"Helen Truby","provider":"FutureLearn","language":"English","skills":["food","nutrition","diet","australia"],"subject":"Nutrition \u0026 Wellness","studentsInterested":"3.2k","courseLink":"https://www.futurelearn.com/courses/food-as-medicine","classCentralLink":"https://www.class-central.com/course/futurelearn-food-as-medicine-5742"},{"title":"Positive Psychiatry and Mental Health","about":"In today’s world, mental illness and distress are common and these account for a significant burden of disability within our community. At the same time, there is a growing interest in understanding and enhancing positive mental health and wellbeing; particularly from developments in the fields of positive psychology and mental health promotion. Positive Psychiatry is a new term (Jeste et al 2016) that describes a dual approach to mental health, where we build strengths, supports and healthy lifestyles as well as treating illness and distress.\n\nIn this course, we will explore different aspects of good mental health as well as provide an overview of the major kinds of mental disorders, their causes, treatments and how to seek help and support. The course will feature a large number of Australian experts in psychiatry, psychology and mental health research, and we will also hear from “lived experience experts”, people who have lived with mental illness, and share their personal stories of recovery.\n\nWe take an evidence-based approach to a range of strategies that anyone can use to enhance their own mental health and that of others, from exercise and relaxation techniques through to the role of love, relationships and \u0027good\u0027 types of work. We cover topics from creativity and yoga through to psychiatric medications and psychotherapies.","tutor":"Jo Lockwood and Sonia Kumar","provider":"Coursera","language":"English","skills":["new-moocs-2017"],"subject":"Health \u0026 Medicine","studentsInterested":"1.9k","courseLink":"https://www.coursera.org/learn/positive-psychiatry","classCentralLink":"https://www.class-central.com/course/coursera-positive-psychiatry-and-mental-health-8783"},{"title":"Epidemiology: The Basic Science of Public Health","about":"Often called “the cornerstone” of public health, epidemiology is the study of the distribution and determinants of diseases, health conditions, or events among populations and the application of that study to control health problems. By applying the concepts learned in this course to current public health problems and issues, students will understand the practice of epidemiology as it relates to real life and makes for a better appreciation of public health programs and policies. This course explores public health issues like cardiovascular and infectious diseases – both locally and globally – through the lens of epidemiology.","tutor":"Karin Yeatts and Lorraine Alexander","provider":"Coursera","language":"English","skills":["usa","north america"],"subject":"Public Health","studentsInterested":"2.2k","courseLink":"https://www.coursera.org/learn/epidemiology","classCentralLink":"https://www.class-central.com/course/coursera-epidemiology-the-basic-science-of-public-health-733"},{"title":"Introduction to Clinical Neurology","about":"An overview of the relevant aspects of the epidemiology, clinical presentation, basic disease mechanisms, diagnostic approaches and treatment options of the most common neurological diseases.","tutor":"Daniel Lowenstein","provider":"Coursera","language":"English","skills":["usa","north america"],"subject":"Disease \u0026 Disorders","studentsInterested":"723","courseLink":"https://www.coursera.org/learn/clinical-neurology","classCentralLink":"https://www.class-central.com/course/coursera-introduction-to-clinical-neurology-1538"},{"title":"Epidemics - the Dynamics of Infectious Diseases","about":"Not so long ago, it was almost guaranteed that you would die of an infectious disease. In fact, had you been born just 150 years ago, your chances of dying of an infectious disease before you\u0027ve reached the tender age of 5 would have been extremely high.\n\nSince then, science has come a long way in understanding infectious diseases - what they are, how they spread, and how they can be prevented. But diseases like HIV/AIDS, Malaria, Tuberculosis, or the flu are still major killers worldwide, and novel emerging diseases are a constant threat to public health. In addition, the bugs are evolving. Antibiotics, our most potent weapon against bacterial infections, are losing their power because the bacteria are becoming resistant. In this course, we\u0027ll explore the major themes of infectious diseases dynamics.\n\nAfter we’ve covered the basics, we\u0027ll be looking at the dynamics of the flu, and why we\u0027re worried about flu pandemics. We\u0027ll be looking at the dynamics of childhood diseases such as measles and whooping cough, which were once considered almost eradicated, but are now making a comeback. We\u0027ll explore Malaria, and use it as a case study of the evolution of drug resistance. We\u0027ll even be looking at social networks - how diseases can spread from you to your friends to your friends\u0027 friends, and so on. And of course we’ll be talking about vaccination too. We’ll also be talking about how mobile phones, social media and crowdsourcing are revolutionizing disease surveillance, giving rise to a new field of digital epidemiology. And yes, we will be talking about Zombies - not human zombies, but zombie ants whose brains are hijacked by an infectious fungus.\n\nWe\u0027re looking forward to having you join us for an exciting course!","tutor":"Marcel Salathé, Ottar N. Bjornstad, Andrew Read, Rachel A. Smith, Mary L. Poss, David P. Hughes, Peter Hudson and Matthew Ferrari","provider":"Coursera","language":"English","skills":["usa","north america"],"subject":"Disease \u0026 Disorders","studentsInterested":"2.6k","courseLink":"https://www.coursera.org/learn/epidemics","classCentralLink":"https://www.class-central.com/course/coursera-epidemics-the-dynamics-of-infectious-diseases-678"},{"title":"Nutrition and Health: Macronutrients and Overnutrition","about":"There is an overload of information about nutrition and health, but what is the truth and what can you do to improve the health of your patients? Learn more about nutrition and how our diet profoundly impacts our current and future health. This course addresses the relationship between nutrition and human health, with a focus on health problems related to overnutrition.\nIn this course, Professor Sander Kersten from Wageningen University \u0026 Research will explain about the composition of the three macronutrients: carbohydrates, fat and protein. You will learn about their role in the body (how they are absorbed, stored and metabolized for energy) and their impact on our health. Moreover, this course will cover energy homeostasis and the regulation of body weight. You will learn about overweight and obesity and strategies to improve and combat these problems of overnutrition. Finally, the course will make you familiar with nutritional research and research methodologies.\n\nThis course is especially useful for health care professionals and people working in the food industry with a non-nutrition background. You will develop a critical mindset by learning to better weigh and interpret information about food, nutrition and health.\n\nThis course, NUTR101x, is part of the Food, Nutrition and Health Professional Certificate Program of Wageningen University \u0026 Research. To continue learning, look into Nutrition and Health Part 2, which focuses on micronutrients and undernutrition.","tutor":"Sander Kersten","provider":"edX","language":"English","skills":["wageningenx"],"subject":"Nutrition \u0026 Wellness","studentsInterested":"3.9k","courseLink":"https://www.edx.org/course/nutrition-and-health-macronutrients-and-overnutrition","classCentralLink":"https://www.class-central.com/course/edx-nutrition-and-health-macronutrients-and-overnutrition-2154"},{"title":"Becoming a Resilient Person - The Science of Stress Management","about":"Everyone experiences adversity and stress at some level, whether it’s the pressure to perform in school or work, relationship problems, financial difficulties, or simply the number of tasks to do in a short period of time. All stress isn’t bad, but chronic stress can take its toll on our minds, bodies, and behavior. Research has shown that people can learn and use specific resilience skills (such as optimistic thinking, relaxation strategies, choosing one’s attention) and positive routines (good sleep, scheduling in fun, and so on) in order to better manage stress, bounce back quicker after a setback, be more effective in their academic and vocational pursuits, develop stronger relationships with others, be physically and mentally healthy, and be satisfied with their lives overall. In short, resilience is ordinary magic and can be learned. It does not necessarily mean that you have to be born resilient or get lucky in life.\nThe purpose of this course is to teach individuals the science behind becoming a resilient person. Stated simply, resilience is the ability to survive and thrive. Resiliency is not only about your ability to positively adapt in the face of adverse or challenging circumstances (that is, survive), but it is also about learning the positive skills, strategies and routines that enable you to live a happy, fulfilling, and meaningful life (in other words, thrive). This course gives you the permission to take care of yourself in order to effectively manage life stressors and do what matters most in life. \nBy the end of this course, you will have learned about the knowledge and skills that you can apply in your life now and in the future to be a resilient person.","tutor":"Clayton Cook","provider":"edX","language":"English","skills":["uwashingtonx"],"subject":"Nutrition \u0026 Wellness","studentsInterested":"3.4k","courseLink":"https://www.edx.org/course/becoming-resilient-person-science-stress-uwashingtonx-ecfs311x-0","classCentralLink":"https://www.class-central.com/course/edx-becoming-a-resilient-person-the-science-of-stress-management-1927"},{"title":"Clinical Terminology for International and U.S. Students","about":"Understanding the clinical terms and abbreviations commonly used during verbal or written communication in U.S. hospitals is challenging. This course is designed for U.S. health care profession students and for international students and practitioners who want to become more familiar with the language of the U.S. clinical setting. Others, such as caregivers and medical interpreters, who wish to develop a better understanding of terms and abbreviations used by health care providers will find this course helpful. The course provides visual and auditory learning experiences to enhance the understanding of terms and abbreviations commonly encountered on a general U.S. hospital unit. All content including quizzes are available at no cost to the learner. If you need a certificate, you can apply for financial aid or pay the fee. To find out more, click Learn more and apply next to the information about Financial Aid. (Use a computer, not a mobile device, for this step.)","tutor":"Michael Gold and Valerie Swigart","provider":"Coursera","language":"English","skills":["hospitals","clinical terminology","usa","north america"],"subject":"Health Care","studentsInterested":"2.5k","courseLink":"https://www.coursera.org/learn/clinical-terminology","classCentralLink":"https://www.class-central.com/course/coursera-clinical-terminology-for-international-and-u-s-students-839"},{"title":"The Science of Nutrition","about":"Explore the nutritional science behind what you eat\nHave you ever looked at a food label and wondered what kilocalories really mean? Would you like to know more about fat, protein or carbohydrates, and how our bodies process them? This online nutrition course provides the answers. You’ll explore biology, finding out how our digestive system and bloodstream process and transport food. You’ll use physics to work out how much energy food contains. And through chemistry, you’ll discover the role that acid and enzymes play in digestion.\nFinally, you’ll consider the science behind dietary advice and why we’re facing an obesity epidemic worldwide.\nThis course is intended for anyone with a general interest in science or nutrition and does not require any prior experience of studying this subject.","tutor":"Audrey Brown","provider":"FutureLearn","language":"English","skills":["nutrition","europe","uk"],"subject":"Nutrition \u0026 Wellness","studentsInterested":"1.2k","courseLink":"https://www.futurelearn.com/courses/the-science-of-nutrition","classCentralLink":"https://www.class-central.com/course/futurelearn-the-science-of-nutrition-3822"},{"title":"更年期综合管理","about":"更年期是女性必经生理过程。大约50%的女性在此时会遇到多种不适，影响生活工作质量，并因反复、多科就诊而增加家庭和社会负担；更年期也是多种老年疾病萌发的时期，是预防并延缓这些疾病进展的关键时期。本课程提供更年期综合管理方案，包括改善生活方式、合理用药等，并对相关知识进行系统讲解，突出精华和实用性。","tutor":"白文佩","provider":"Coursera","language":"Chinese","skills":["china","asia","menopause"],"subject":"Health Care","studentsInterested":"3","courseLink":"https://www.coursera.org/learn/geng-nian-qi","classCentralLink":"https://www.class-central.com/course/coursera--4242"},{"title":"Anatomy of the Abdomen and Pelvis; a journey from basis to clinic.","about":"In this anatomy course you will explore the organs involved in our food digestion and discover the common causes of abdominal and pelvic pain. The latest graphics and animations will help you to find new insights and understanding of this part of the body, that has been the focus of anatomical research for centuries and presently arouses renewed scientific interest.\n\nYou will explore the 3D anatomy of the organs from a basic level, providing thorough anatomical understanding, to its advanced application in surgical procedures. This course will challenge you to discover and help you to understand the anatomy of the abdomen and pelvis in all its aspects, ranging from its embryological underpinnings, via digital microscopy to gross topography and its clinical applications.\n\nThe course is unique in that it continuously connects basic anatomical knowledge from the lab with its medical applications and current diagnostic techniques. You’ll get the chance to discuss anatomical and clinical problems with peers and experts in forum discussions and you will receive guidance in exploring the wealth of anatomical information that has been gathered over the centuries. Follow us on an exciting journey through the abdomen and pelvis where you digest your food but also where new life starts!","tutor":"Marco de Ruiter, Paul Gobée, Daniel Jansma and Beerend Hierck","provider":"Coursera","language":"English","skills":["human anatomy","europe","diagnostic techniques","netherlands"],"subject":"Health Care","studentsInterested":"366","courseLink":"https://www.coursera.org/learn/abdomen-anatomy","classCentralLink":"https://www.class-central.com/course/coursera-anatomy-of-the-abdomen-and-pelvis-a-journey-from-basis-to-clinic-4420"},{"title":"Global Health Policy","about":"In this course, learners will become familiar with principles and theories of global health problems, and major challenges and controversies in improving global population health as well as practical applications of quantitative methods to analyze and interpret issues and challenges for policy. Topics will include health and foreign policy, health governance, acute disease surveillance, non-communicable diseases, burden of disease, universal health coverage, health systems strengthening, health financing, and human resources for health and ageing.","tutor":"Hiroshi Nishiura, Stuart Gilmour and Kenji Shibuya","provider":"Coursera","language":"English","skills":["japan","asia"],"subject":"Health Care","studentsInterested":"128","courseLink":"https://www.coursera.org/learn/global-health-policy","classCentralLink":"https://www.class-central.com/course/coursera-global-health-policy-7652"},{"title":"Science of Exercise","about":"Learners who complete Science of Exercise will have an improved physiological understanding of how your body responds to exercise, and will be able to identify behaviors, choices, and environments that impact your health and training. You will explore a number of significant adjustments required by your body in order to properly respond to the physical stress of exercise, including changes in carbohydrate, fat and protein metabolism, nutritional considerations, causes of muscle soreness \u0026 fatigue, and the effectiveness and dangers of performance enhancing drugs. Active learning assessments will challenge you to apply this new knowledge via nutrition logs, heart rate monitoring, calculations of your total daily caloric expenditure and body mass index (BMI). Finally, learners will examine the scientific evidence for the health benefits of exercise including the prevention and treatment of heart disease, diabetes, cancer, obesity (weight loss), depression, and dementia.","tutor":"Robert Mazzeo, Ph.D.","provider":"Coursera","language":"English","skills":["new-moocs-2017"],"subject":"Health \u0026 Medicine","studentsInterested":"259","courseLink":"https://www.coursera.org/learn/science-exercise","classCentralLink":"https://www.class-central.com/course/coursera-science-of-exercise-8679"},{"title":"Violence Against Healthcare","about":"At the global level, there are many countries marked by violence affecting health care. The \u0027Health care in danger\u0027 project aims to establish practical measures and recommendations that can be implemented on the ground by policy-makers, humanitarian organizations and health professionals. In view of the multiplicity of actors and latitudes concerned, it is essential to be able to make available the tools needed to make informed decisions, guide behaviour in high-risk areas and provide everyone the means to create and optimize the dialogue between humanitarian professionals and health on the one hand and relevant authorities or other armed actors. This course covers various topics such as ethics, rights and responsibilities of the staff of health and pre-hospital personnel, issues related to international law and humanitarian law, international human rights, caregivers and patient safety as well as the role of communities to address and reduce violence against health care.","tutor":"Frederik Siem, Jamie Williamson, Bruce Eshaya-Chauvin, Luigi Fratini, Esperanza Martinez, Beat Stoll, Alexander Breitegger and Angela Gussing","provider":"Coursera","language":"English","skills":["public health","policy-making","new-moocs-2017"],"subject":"Public Health","studentsInterested":"56","courseLink":"https://www.coursera.org/learn/violence-against-healthcare","classCentralLink":"https://www.class-central.com/course/coursera-violence-against-healthcare-8713"},{"title":"Alimentación y dietética para una vuelta al mundo a vela","about":"Comer bien en una vuelta al mundo no es tarea fácil . Aprenda cómo equilibrar alta nutrición con practicidad mientras navega alrededor del mundo.\n\nEste curso pretende introducirte en el mundo de la preparación de los deportistas que participan en regatas de navegación transoceánica, como la Barcelona World Race.\n\nVer que los proyectos son a largo plazo, que existe un periodo importante que dedican a su preparación física, la cual esta supervisada por una serie de pruebas en las que se va confirmando los logros en su rendimiento físico. Y luego también, como planifican su dieta.\n\nEn este curso aprenderás cuáles son los alimentos que se embarcan en la Barcelona World Race, cómo se diseñan los menús incorporando en ellos alimentos liofilizados que contribuyen a mantener las características organolépticas, a pesar de haber sido manipulados para conseguir un menor peso y mayor duración y estabilidad.\n\nEn el curso también se plantea el método de cálculo de las necesidades nutricionales y cómo se planifica una dieta para rendir al máximo en los periodos de preparación y de navegación en la vuelta al mundo.","tutor":"Pere Castells and Victòria Pons","provider":"Coursera","language":"Spanish","skills":["spain","europe"],"subject":"Nutrition \u0026 Wellness","studentsInterested":"33","courseLink":"https://www.coursera.org/learn/alimentacion-vuelta-al-mundo","classCentralLink":"https://www.class-central.com/course/coursera-alimentacion-y-dietetica-para-una-vuelta-al-mundo-a-vela-7417"},{"title":"Planning a Patient Safety or Quality Improvement Project (Patient Safety III)","about":"This course provides students with a set of tools and methodologies to plan and initiate a Problem Solving or Quality Improvement project. The first module presents methods for selecting, scoping and structuring a project before it is even initiated. It also introduces the project classifications of implementation and discovery. The second module describes the A3 problem solving methodology and the tool itself. Further in that same module, the student is shown tools to identify problems in flow, defects, and waste and to discover causes, brainstorm, and prioritize interventions. Module 3 shows a methodology within the implementation class. These methods are designed to overcome emotional and organizational barriers to translating evidence-based interventions into practice. The fourth and last module looks at one more way to approach improvement projects in the discovery class. These tools are specifically for new, out-of-the-box design thinking.","tutor":"Bob Hody","provider":"Coursera","language":"English","skills":["patient safety","new-moocs-2017"],"subject":"Health Care","studentsInterested":"67","courseLink":"https://www.coursera.org/learn/patient-safety-project-planning","classCentralLink":"https://www.class-central.com/course/coursera-planning-a-patient-safety-or-quality-improvement-project-patient-safety-iii-9610"},{"title":"Foundations for Assisting in Home Care","about":"This course is intended as a self-study course for those interested in exploring a career as a Home Health Aide or Personal Care Aide.","tutor":", Andrea Wade and Tera Doty-Blance","provider":"Coursera","language":"English","skills":["personal care","health aide","usa","north america"],"subject":"Health Care","studentsInterested":"753","courseLink":"https://www.coursera.org/learn/home-care","classCentralLink":"https://www.class-central.com/course/coursera-foundations-for-assisting-in-home-care-3726"},{"title":"营养与健康","about":"《营养与健康》介绍营养学基础知识，主要内容包括：人体所需的七大营养素的化学结构、主要生理功能、食物来源、人体每天的参考摄入量等；主要食物种类包括谷物类、薯类、豆类、坚果类、蔬菜类、水果类、肉类、水产品类、蛋类、乳制品类的营养价值；营养与疾病特别是一些慢性、高发性疾病如高血糖、高血脂、高血压、癌症等的关系。内容简单，适合无营养学基础、但希望了解一般的营养学知识，改善日常膳食质量的人选修。","tutor":"郑伟娟","provider":"Coursera","language":"Chinese","skills":["nutrition","health","china","asia"],"subject":"Nutrition \u0026 Wellness","studentsInterested":"15","courseLink":"https://www.coursera.org/learn/yingyang-jiankang","classCentralLink":"https://www.class-central.com/course/coursera--4344"},{"title":"Implant Dentistry","about":"Implant Dentistry is one of the most dynamic and rapidly developing areas within oral health care. In spite of increasing popularity of implantology, it is a relatively new discipline within dental education and remains limited to post-graduate courses offered by dental schools in many parts of the world today.\n\nWith the vision to help dental practitioners gain clinical understanding of implantology and an opportunity to provide implant treatments to their patients, the Faculty of Dentistry of HKU (ranked No. 1 dental school in the World in 2016) developed this MOOC to provide a world-class quality, unbiased, evidence-based and clinically-oriented course in this discipline.\n\nWatch course trailer: https://youtu.be/ZZMLyy2EwEo\n\nWho are the faculties?\nThe course teachers include more than 20 implant experts from 10 countries. Among others, you will learn from Professor NP Lang (Switzerland / Hong Kong), Professor Christoph Hämmerle (Switzerland), Professor Rino Burkhardt (Switzerland), Professor Paul Weigl (Germany), Professor Saso Ivanovski (Australia), Professor Man Yi (China), Professor Vasilios Chronopoulos (USA/ Greece), Dr Richard Chan (Australia), Dr Martin Janda (Sweden), Dr Chatchai Kunavisarut (Thailand), Dr Ian HS Yip (Hong Kong) , Dr Michael Ho (Hong Kong), Dr Irina-Florentina Dragan (USA), Dr Adam Siu (Hong Kong), Dr James Chow (Hong Kong), Dr Alfred Lau (Hong Kong), Dr Coral Yao (China), Dr Nikos Mattheos (Hong Kong) and more.\n\nWhat are the contents covered in the course?\nThe MOOC includes 5 modules and runs over a period of 5 weeks. We will begin the journey of Implant Dentistry by exploring how discoveries in biology and technological developments lead to the current practice of dental implants. Then, we will examine clinical cases, diagnose our patients’ needs and expectations and learn the principles of treatment planning. We will learn step-by-step surgical procedures for placing implants and various restorative techniques, directed by current evidence and best practices. Finally, we will investigate major threats and complications of implant procedures and ways to ensure successful treatments and long serving implants.\n\nWhat is the aim of the course?\nThis MOOC has a strong clinical focus and is especially designed to enhance professional learning among dental practitioners and dental students. The course aims to help the students LEARN the fundamentals of implant dentistry, UNDERSTAND the treatment procedures and protocols, and APPLY the competences gained through interactive peer and case based learning.\n\nWho is the course for?\nThe course is specially designed to serve multiple groups of learners: From intermediate and experienced general dental practitioners who want to establish and deepen their knowledge in implant dentistry and advance towards implementing implant treatment and restorative procedures, to dental students and recent graduates who wish to gain understanding of implant dentistry and increase their competence in related practice.\n\nThe course makes good use of evidenced-based education, sound eLearning pedagogies and 21st century “live” resources to engage and create the best learning experience for our students.","tutor":"Nikos Mattheos","provider":"Coursera","language":"English","skills":["asia","hong kong"],"subject":"Health \u0026 Medicine","studentsInterested":"48","courseLink":"https://www.coursera.org/learn/implant-dentistry","classCentralLink":"https://www.class-central.com/course/coursera-implant-dentistry-7191"},{"title":"Setting the Stage for Success: An Eye on Safety Culture and Teamwork (Patient Safety II)","about":"Safety culture is a facet of organizational culture that captures attitudes, beliefs, perceptions, and values about safety. A culture of safety is essential in high reliability organizations and is a critical mechanism for the delivery of safe and high-quality care. It requires a strong commitment from leadership and staff. In this course, a safe culture is promoted through the use of identifying and reporting patient safety hazards, accountability and transparency, involvement with patients and families, and effective teamwork.","tutor":"Eileen Kasda","provider":"Coursera","language":"English","skills":["teamwork","patient safety","new-moocs-2017"],"subject":"Health Care","studentsInterested":"53","courseLink":"https://www.coursera.org/learn/patient-safety-culture","classCentralLink":"https://www.class-central.com/course/coursera-setting-the-stage-for-success-an-eye-on-safety-culture-and-teamwork-patient-safety-ii-9611"},{"title":"EDIVET: Do you have what it takes to be a veterinarian?","about":"This course is for anyone interested in learning more about Veterinary Medicine, giving a “taster” of courses covered in the first year of a veterinary degree and an idea of what it is like to study Veterinary Medicine.","tutor":"Jo-Anne Murray, Jessie Paterson, Susan Rhind, Gurå Bergkvist, Andrew Gardiner, Catriona Bell, Kay Aitchison and Rachel Whittington","provider":"Coursera","language":"English","skills":["veterinarian medicine","europe","scotland"],"subject":"Health Care","studentsInterested":"601","courseLink":"https://www.coursera.org/learn/becoming-a-veterinarian","classCentralLink":"https://www.class-central.com/course/coursera-edivet-do-you-have-what-it-takes-to-be-a-veterinarian-1675"},{"title":"Introduction to Household Water Treatment and Safe Storage","about":"It is well known that water treatment at the household level can lead to dramatic improvements in drinking water quality. But does Household Water Treatment and Safe Storage (HWTS) also have global relevance? What are the potential treatment solutions and how do they function? Is there a standard strategy for successful HWTS implementation, or can we identify key components which make programs more likely to succeed?\n\nIn this course you will learn about the most important water treatment methods at household level, successful implementation strategies and about assessing the impact of HWTS.\n\nMOOC SERIES “SANITATION, WATER AND SOLID WASTE FOR DEVELOPMENT” : This course is one of four in the series “Sanitation, Water and Solid Waste for Development\".\n\nFRANçAIS: Dans ce MOOC, vous allez apprendre les plus importantes méthodes de traitement de l\u0027eau au niveau des ménages, les stratégies pour une mise en œuvre réussie et l’évaluation de l’impact du traitement et stockage sûr de l\u0027eau à domicile.\n\nESPAñOL: Aprende acerca de los métodos más importantes de tratamiento de agua a nivel domiciliario, de estrategias de implementación eficientes y de la evaluación del impacto del tratamiento doméstico y almacenamiento seguro del agua.","tutor":"Rick Johnston","provider":"Coursera","language":"English","skills":["europe","switzerland"],"subject":"Nutrition \u0026 Wellness","studentsInterested":"349","courseLink":"https://www.coursera.org/learn/water-treatment","classCentralLink":"https://www.class-central.com/course/coursera-introduction-to-household-water-treatment-and-safe-storage-1721"},{"title":"The Meat We Eat","about":"The Meat We Eat is a course designed to create a more informed consumer about the quality, safety, healthfulness and sustainability of muscle foods and address current issues in animal agriculture in developed and developing countries.","tutor":"Chad Carr","provider":"Coursera","language":"English","skills":["usa","north america"],"subject":"Nutrition \u0026 Wellness","studentsInterested":"443","courseLink":"https://www.coursera.org/learn/meat-we-eat","classCentralLink":"https://www.class-central.com/course/coursera-the-meat-we-eat-1808"},{"title":"社会调查与研究方法 （上）Methodologies in Social Research (Part I)","about":"社会调查与研究方法，\n首先，是一套观察社会现象、测量社会现象的工具；\n其次，是一套分析和运用社会现象数据的科学方法；\n最高境界，则是一套针对社会、经济、教育、政治、法律、管理、公共卫生、新闻报道等人类的生产与生活现象，进行科学沟通的思维逻辑与表达方式。","tutor":"邱泽奇 （Qiu Zeqi）","provider":"Coursera","language":"Chinese","skills":["china","asia"],"subject":"Health Care","studentsInterested":"13","courseLink":"https://www.coursera.org/learn/shehu-yanjiu-fangfa","classCentralLink":"https://www.class-central.com/course/coursera---methodologies-in-social-research-part-i-2387"},{"title":"Introduction to Dental Medicine","about":"The mouth is the window into human health. This course provides an overview of dental medicine to engage, educate, excite and assist you in improving the oral health of your patients and members of your community. We will review topics in dental medicine including scope of the field, what to expect in function, and some of the many ways that dysfunction may present for different patients. This will include discussions of mouth, jaw, and tooth anatomy, pathology, and treatment. We will talk about differences between patients and the unique roles that different members of the dental field may play in treatment depending on the patient and condition. This course starts from basic concepts and proceeds to review trends in current research and technology. We offer scientific background, some skills for patient evaluation and interview, and some suggestions for further learning for those interested in or involved in dental education.","tutor":"Thomas Sollecito, Eric Stoopler and Uri Hangorsky","provider":"Coursera","language":"English","skills":["usa","north america"],"subject":"Health Care","studentsInterested":"763","courseLink":"https://www.coursera.org/learn/dental-medicine-penn","classCentralLink":"https://www.class-central.com/course/coursera-introduction-to-dental-medicine-2902"},{"title":"Bacteria and Chronic Infections","about":"This course will give you an introduction to bacteria and chronic infections. Leading experts in the field will make you familiar with the fundamental concepts of microbiology and bacteriology such as single cell bacteria, biofilm formation, and acute and chronic infections.","tutor":"Thomas Bjarnsholt","provider":"Coursera","language":"English","skills":["denmark","north america"],"subject":"Disease \u0026 Disorders","studentsInterested":"2.3k","courseLink":"https://www.coursera.org/learn/bacterial-infections","classCentralLink":"https://www.class-central.com/course/coursera-bacteria-and-chronic-infections-3203"},{"title":"Systems Thinking In Public Health","about":"This course provides an introduction to systems thinking and systems models in public health. Problems in public health and health policy tend to be complex with many actors, institutions and risk factors involved. If an outcome depends on many interacting and adaptive parts and actors the outcome cannot be analyzed or predicted with traditional statistical methods. Systems thinking is a core skill in public health and helps health policymakers build programs and policies that are aware of and prepared for unintended consequences.\n\nAn important part of systems thinking is the practice to integrate multiple perspectives and synthesize them into a framework or model that can describe and predict the various ways in which a system might react to policy change. Systems thinking and systems models devise strategies to account for real world complexities.\n\n\nThis work was coordinated by the Alliance for Health Policy and Systems Research, the World Health Organization, with the aid of a grant from the International Development Research Centre, Ottawa, Canada. Additional support was provided by the Department for International Development (DFID) through a grant (PO5467) to Future Health Systems research consortium.\n\n© World Health Organization 2014\nAll rights reserved. The designations employed and the presentation of the material in this publication do not imply the expression of any opinion whatsoever on the part of the World Health Organization concerning the legal status of any country, territory, city or area or of its authorities, or concerning the delimitation of its frontiers or boundaries. Dotted and dashed lines on maps represent approximate border lines for which there may not yet be full agreement. The mention of specific companies or of certain manufacturers’ products does not imply that they are endorsed or recommended by the World Health Organization in preference to others of a similar nature that are not mentioned. Errors and omissions excepted, the names of proprietary products are distinguished by initial capital letters. All reasonable precautions have been taken by the World Health Organization to verify the information contained in this publication. However, the published material is being distributed without warranty of any kind, either expressed or implied. The responsibility for the interpretation and use of the material lies with the reader. In no event shall the World Health Organization be liable for damages arising from its use. Johns Hopkins University Bloomberg School of Public Health has a non-exclusive license to use and reproduce the material.","tutor":"Ligia Paina, PhD and David Bishai, MD, PhD","provider":"Coursera","language":"English","skills":["public health","statistics","systems thinking","health policy","usa","north america"],"subject":"Public Health","studentsInterested":"2.1k","courseLink":"https://www.coursera.org/learn/systems-thinking","classCentralLink":"https://www.class-central.com/course/coursera-systems-thinking-in-public-health-5723"},{"title":"Healthcare Delivery Providers","about":"Welcome to the exciting world of Healthcare Delivery Providers!\n\nThis second course in the Healthcare Marketplace Specialization will help you understand the various providers of healthcare across the U.S. delivery continuum. We will explore the unique value proposition of the various providers- from hospitals and clinics to physicians to community based providers. We will dissect this important value chain using various lenses such as- site of care delivery, people who provide the care and payers who pay for care. You will also learn about the challenges facing these providers and the innovations they are creating in order to help transform this important industry.\n\nI will use readings such as a case study and videos to make this learning more experiential for you, so that you can see and feel the world of healthcare delivery. I will also explain the various acronyms and specialized terms used in healthcare, so that you become more proficient and familiar with the language.\n\nGiven the fact that Healthcare is one of the largest industries in the U.S. and growing at an rapid pace, it is critical that current and future leaders understand the internal and external drivers that are shaping this industry. Current and future leaders will need to constantly innovate in order to sustain this industry into the future- by creating value for the end customer and the entire population, as well as increasing engagement of the humans who work within this industry.\n\nGet ready to take a deep dive into the complex ocean that is U.S. healthcare delivery- and make sure your oxygen tank is securely fastened!","tutor":"Rahul Koranne","provider":"Coursera","language":"English","skills":["healthcare","healthcare marketplace","usa","north america"],"subject":"Public Health","studentsInterested":"118","courseLink":"https://www.coursera.org/learn/healthcare-delivery-providers","classCentralLink":"https://www.class-central.com/course/coursera-healthcare-delivery-providers-5533"},{"title":"Essentials of Global Health","about":"Essentials of Global Health is a comprehensive introduction to global health. It is meant to introduce you to this topic in well-structured, clear and easy to understand ways. Much of the course will focus on five questions: What do people get sick, disabled and die from; Why do they suffer from these conditions? Which people are most affected? Why should we care about such concerns? What can be done to address key health issues, hopefully at least cost, as fast as possible, and in sustainable ways? The course will be global in coverage but with a focus on low- and middle-income countries, the health of the poor, and health disparities. Particular attention will be paid throughout the course to health systems issues, the linkages between health and development, and health matters related to global interdependence. The course will cover key concepts and frameworks but be practical in orientation.\n\n-------------------------------------------------------------------------------------------------------------------------------------------------------\n\nCourse Learning Objectives\n\nBy the end of the course, learners should be able to:\n\n• Articulate key public health concepts related to global health;\n• Analyze the key issues in global health from a number of perspectives;\n• Discuss with confidence the burden of disease in various regions of the world; how it varies by sex, age, and location; key risk factors for this burden; and how the disease burden can be addressed in cost-effective ways;\n• Assess key health disparities, especially as they relate to the health of low-income and marginalized people in low- and middle-income countries;\n• Outline the key actors and organizations in global health and the manner in which they cooperate to address critical global health concerns;\n• Review key global health challenges that are likely to arise in the coming decades.\n\n\n-------------------------------------------------------------------------------------------------------------------------------------------------------\n\nValue Added of the Course\n\nThe course seeks to add special value by being comprehensive, by handling each topic in a consistent framework, and by helping learners gain an understanding of well grounded approaches to assessing global health issues and what can be done to address them.\n\n\n-------------------------------------------------------------------------------------------------------------------------------------------------------\n\nThe Readings and other materials for Essentials of Global Health\n\nFor almost every session of Essentials of Global Health, you will see:\n\n- Required readings\n- Recommended readings\n- Recommended videos\n\nWe have selected a small number of readings for each session that are central to understanding the content of the session. We have put these under “required readings”.\n\nFor each required reading, we have also indicated how carefully you should read the material and on what parts of the material you should focus your attention.\n\nIn addition, we have selected some additional readings that would be very helpful to your understanding the content of each session.\n\nThe first is a textbook, Global Health 101, third edition. This is a comprehensive introductory textbook that closely follows the content of this Essentials of Global Health course. We have indicated for each session what part of the book you should read. Using this textbook can be very valuable to your mastering the content of the course.\n\nThe second set of “recommended readings” is some additional readings, mostly from journal articles and reports. For these, too, we have indicated how carefully you should read the material and on what parts of the material you should focus your attention.\n\nLearners should note that to access articles from The Lancet they will have to register with the Lancet, if they do not have online access to a library that has The Lancet. Once they are registered, they will be able to sign into The Lancet and access all of its free articles.\n\nWe have also indicated for most sessions one or two videos that relate to the topic of the session. These are meant to help the learner get a better feel for the topic which is being covered. Most learners will find the videos brief, easy and enjoyable to watch, and very enlightening.","tutor":"Richard Skolnik","provider":"Coursera","language":"English","skills":["usa","north america"],"subject":"Health Care","studentsInterested":"417","courseLink":"https://www.coursera.org/learn/essentials-global-health","classCentralLink":"https://www.class-central.com/course/coursera-essentials-of-global-health-7337"},{"title":"The Oral Cavity: Portal to Health and Disease","about":"This course will focus on the interprofessional realtionship of dentistry and medicine. For each session, the medical specialist will present a broad overview of specific disease entity which will be followed by a dental educator discussing the relevant oral manifestations and implications. The final module of each session will be devoted to the interaction between the dental and other health care professionals.","tutor":"Dr. Thomas P. Sollecito, Dr. Eric Stoopler and Dr. Uri Hangorsky","provider":"Coursera","language":"English","skills":["oral health","dentistry","new-moocs-2017"],"subject":"Health Care","studentsInterested":"128","courseLink":"https://www.coursera.org/learn/oralcavity","classCentralLink":"https://www.class-central.com/course/coursera-the-oral-cavity-portal-to-health-and-disease-9263"},{"title":"Understanding and Strengthening Health Systems","about":"Welcome to our course on Understanding and Strengthening Health Systems for Global Health. During the course we will provide you with an overview of the main elements or building blocks of a health system based on the World Health Organization’s guidance. You will have the opportunity to explore four main areas of health systems in global health with particular reference to low and middle income countries. The first area focuses on understanding health service organizations, the challenges. Our second module looks at WHO’s six major building blocks or health systems components with particular reference to primary health care and the need for community participation in planning, delivery and assessment of these systems components. in our third module we examine the specific systems component of human resource development and capacity building. The fourth area consists of health policy making and advocacy with stakeholders. This course is geared toward learners who are already involved in managing health and development programs on the ground in low and middle income countries or who are preparing for such a management role. The main lectures will span a four-week period with approximately 2-4 hours of viewing learning materials per week. We have one peer graded essay wherein you will use skills in ‘organizational’ diagnosis to better understand a challenge in an organization where you are or have worked. There are also quizzes. We hope you will engage with your fellow learners in discussion forums to learn from each other.","tutor":"William Brieger, DrPH","provider":"Coursera","language":"English","skills":["global health","health systems"],"subject":"Public Health","studentsInterested":"78","courseLink":"https://www.coursera.org/learn/health-systems","classCentralLink":"https://www.class-central.com/course/coursera-understanding-and-strengthening-health-systems-10756"},{"title":"Health Care Innovation","about":"In this course, you’ll learn the foundational economic theories behind health care innovation and how to optimize your own health care practice or organization. Designed to help you gain a practical understanding of the theoretical frameworks of behavioral economics and operations management in the health care setting, this course will help you apply these frameworks to assess health care practices and apply innovation while managing risk. You’ll also explore the best practices for evaluating one’s innovative practices, using real-life examples of success to see the concepts in action. By the end of this course, you’ll have honed your skills in optimizing health care operations, and be able to develop the right set of evaluations and questions to achieve best innovative practices within your organization.","tutor":"Amol S. Navathe, MD, PhD, Kevin Volpp, MD, PhD, Christian Terwiesch, Roy Rosin, MBA and David A. Asch, MD, MBA","provider":"Coursera","language":"English","skills":["healthcare","innovation","economics"],"subject":"Health Care","studentsInterested":"144","courseLink":"https://www.coursera.org/learn/wo-pmo-healthcareinnovation","classCentralLink":"https://www.class-central.com/course/coursera-health-care-innovation-10802"},{"title":"Liver Disease: Looking after Your Liver","about":"##\nWe are currently experiencing an international explosion of liver disease that continues to have enormous impact upon healthcare systems and global health. In the UK we have seen a 20% increase in deaths related to liver disease since 2000 and this pattern reflects the global situation.\nContrary to expectations, this dramatic increase in liver disease is not restricted to patients who drink alcohol, and liver cancer is the third most common cause of cancer related death. Many inherited conditions and acquired infections can also cause liver disease, and liver disease as a consequence of obesity and diet is becoming especially significant.\nThis course will teach you about the amazing roles the liver fulfils to keep you healthy and will show you how these functions are compromised when the liver is damaged. We will highlight the reasons why liver disease is on the increase and show you some of the amazing new treatment options available to address the global challenge of liver disease. Finally we will also show you some simple steps you can take to look after your liver to prevent liver disease.\nYou can see what the tutors are up to by following their Twitter feed @BirminghamLiver. You can also find out more in Patricia Lalor’s blog post: “What can you do to look after your liver?”\nThe course will be of relevance to those who enjoy the study of biology and are interested in medicine. Secondary or High school-level knowledge of science is sufficient to complete this course. There will also be optional, additional materials for those already educated to undergraduate level and those who would like to challenge themselves and explore beyond the core material.","tutor":"Patricia Salinas Martínez","provider":"FutureLearn","language":"English","skills":["europe","uk"],"subject":"Disease \u0026 Disorders","studentsInterested":"308","courseLink":"https://www.futurelearn.com/courses/liver-disease","classCentralLink":"https://www.class-central.com/course/futurelearn-liver-disease-looking-after-your-liver-2251"},{"title":"Rethinking Ageing: Are we prepared to live longer?","about":"Population ageing is occurring in nearly every country around the world. This MOOC takes a multidisciplinary approach to explore the impact of living longer and takes into account the technological advancements, the built environment, economics and ethics to rethink what it means to \u0027age well\u0027 now and in the future.\n\nRethinking Ageing is a uniquely designed course to give you a broad overview of the many complex issues involved as we as individuals get older and on the macro-level for population ageing. You may already have a particular interest in one discipline, such as mental health and ageing or age-friendly design. We encourage you, though, to use this course to explore the other perspectives on population ageing as the modules build on each other.\n\nView the MOOC promotional video here: http://tinyurl.com/j7lz8q8","tutor":"R Moodie, T Sklar, S Biggs, R Kippen, L Remedios, D Virtue, E , F Sanchez, A Pert, C Newton, C Pettit, J , I McDonald, B Dow and D Martin","provider":"Coursera","language":"English","skills":["australia"],"subject":"Nutrition \u0026 Wellness","studentsInterested":"241","courseLink":"https://www.coursera.org/learn/ageing","classCentralLink":"https://www.class-central.com/course/coursera-rethinking-ageing-are-we-prepared-to-live-longer-3317"},{"title":"Introduction to Breast Cancer","about":"Welcome to an Introduction to Breast Cancer! In this course, we’ll learn a bit about the leading cause of cancer in women worldwide – from the basic biology of the disease, to risk factors and prevention, to treatment modalities to survivorship. We’ll talk to leading experts, explore some of the milestone studies that have pushed this field forward, and have interactive discussions on discussion boards and social media. You’ll even have an opportunity to let us know what topics you want to cover on tweetchats, so we can try to make the content fit your interests.\n\nThere is something in this course for everyone – if you’re a breast cancer survivor or the friend/family member of someone with this disease, this course will help you to better understand this disease, and give you ideas for questions you may want to ask your doctor. Maybe you’re a healthcare provider or studying to be the same, this course is a great refresher on where the state of the science is. If you’re a healthcare administrator wondering about how the interdisciplinary components of breast cancer care fit together, or an entrepreneur thinking about unmet needs in this space, or someone in public health interested in prevention, this course is also for you!\n\nAre you ready to learn a lot, and have some fun while we’re at it? If so, I hope you’ll join us! Let’s get started!!!","tutor":"Anees B. Chagpar, MD, MSc, MPH, MA, MBA, FRCS(C), FACS","provider":"Coursera","language":"English","skills":["epidemiology","breast cancer","usa","north america"],"subject":"Disease \u0026 Disorders","studentsInterested":"2.1k","courseLink":"https://www.coursera.org/learn/breast-cancer-causes-prevention","classCentralLink":"https://www.class-central.com/course/coursera-introduction-to-breast-cancer-6044"},{"title":"Seguridad agroalimentaria","about":"La seguridad agroalimentaria es uno de los mayores problemas a nivel mundial debido a que existen millones de personas que no tienen acceso diario a los alimentos. Por ello, es necesario revisar el concepto y analizar su importancia, elementos para la construcción de políticas para generar seguridad alimentaria, así como los riesgos e implicaciones de no implementar estas políticas. Al hacerlo, puede contribuirse al reto global actual, el cual, requiere tomar conciencia de estos aspectos mejorar las condiciones de acceso, disponibilidad, estabilidad y utilización de alimentos.\n\nEste curso, desarrollado por el Instituto Interamericano de Cooperación para la Agricultura (IICA) y la Universidad Nacional Autónoma de México (UNAM), es una introducción a los elementos teórico-prácticos sobre la situación e importancia de la seguridad agroalimentaria en las Américas y a los elementos básicos para desarrollar e implementar estrategias nacionales de seguridad agroalimentaria.\n\nEl curso comprende cuatro módulos. Cada uno con una duración de 10 horas por semana. Estos cuatro módulos, abordan:\n\n1. El concepto de la seguridad agroalimentaria.\n\n2. La importancia de la seguridad agroalimentaria para el bienestar de los países.\n\n3. Elementos para la construcción e implementación de estrategias nacionales de seguridad agroalimentaria.\n\n4. Riesgos e implicaciones de no adoptar e implementar una estrategia de seguridad alimentaria a nivel país.\n\nSi eres un experto en el sector agropecuario y agroindustrial o eres novato en estos temas pero son de tu interés, este curso es para ti.\n\n¡Únete a este curso!","tutor":"Mtro. Emmanuel Picado Mata","provider":"Coursera","language":"Spanish","skills":["mexico","north america"],"subject":"Nutrition \u0026 Wellness","studentsInterested":"24","courseLink":"https://www.coursera.org/learn/seguridad-alimentaria","classCentralLink":"https://www.class-central.com/course/coursera-seguridad-agroalimentaria-6917"},{"title":"Healthcare Marketplace","about":"In this course in the Healthcare Marketplace specialization you will identify, define, and describe potential business and public policy solutions to the challenges facing society’s growing demand for health services. Students will master a body of knowledge on the health care sectors major components through reading and reflection.\n\nHealthcare has many different cultural components that will be discussed as historic trends as well as future demographic challenges. You will understand diverse philosophies and cultures within and across societies as they relate to healthcare. This outcome is particularly critical because of the tradeoffs needed to be assessed as medical technology advances faster than budgets and perhaps cultures are sometimes willing to tolerate.\n\nAt the end of the day, you will gain an appreciation for the role of creativity, innovation, discovery, and expression across disciplines in the development of new medical care solutions through and examination of the physician, medical technology and financing sub-sectors of the health economy.","tutor":"Stephen T Parente","provider":"Coursera","language":"English","skills":["public policy","healthcare marketplace","usa","north america"],"subject":"Public Health","studentsInterested":"152","courseLink":"https://www.coursera.org/learn/healthcare-marketplace","classCentralLink":"https://www.class-central.com/course/coursera-healthcare-marketplace-5508"},{"title":"Drug Discovery","about":"The University of California San Diego, Skaggs School of Pharmacy and Pharmaceutical Sciences Drug Discovery course brings you lectures from both faculty and industry experts. With this course, recorded on campus at UCSD, we seek to share our access to top people in the field who bring an unprecedented range of expertise on drug discovery.\n\nIn this course you will learn the drug discovery process up to the filing of an Initial New Drug Application or IND. Each week you will learn the steps that a pharmaceutical or biotech company goes through to discover a new therapeutic drug. In this course you will be able to:\n\n* Understand the pharmaceutical and biotechnology market a changing landscape\n* Learn the major aspects of the drug discovery process, starting with target selection, to compound screening to designing lead candidates.\n* Recognize current modern drug discovery based on the lock-and-key theory, which attempts to use one single compound to hit one target to combat the related disease.\n* Increase understanding of the various drug discovery tools and methods that are used for finding, identifying and designing a new drug.\n* Define and understand the regulatory responsibilities for drug discovery to file an Investigational New Drug Application (IND).\n\nThis course is intended as part 1 of a series: Drug Discovery, Drug Development (https://www.coursera.org/learn/drug-development) and Drug Commercialization (https://www.coursera.org/learn/drug-commercialization). We would highly recommend that you take the courses in order since it will give you a better understanding on how a drug is discovered in the lab before being tested in clinical trials and then launched in the market place.","tutor":"Williams S. Ettouati and Joseph D. Ma","provider":"Coursera","language":"English","skills":["drug discovery","clinical trials","drug commercialization","pharmaceuticals","usa","north america"],"subject":"Health Care","studentsInterested":"1.2k","courseLink":"https://www.coursera.org/learn/drug-discovery","classCentralLink":"https://www.class-central.com/course/coursera-drug-discovery-654"},{"title":"社会调查与研究方法 （下）Methodologies in Social Research (Part 2)","about":"社会调查与研究方法， 首先，是一套观察社会现象、测量社会现象的工具； 其次，是一套分析和运用社会现象数据的科学方法； 最高境界，则是一套针对社会、经济、教育、政治、法律、管理、公共卫生、新闻报道等人类的生产与生活现象，进行科学沟通的思维逻辑与表达方式。","tutor":"邱泽奇 （Qiu Zeqi）","provider":"Coursera","language":"Chinese","skills":["china","asia"],"subject":"Health Care","studentsInterested":"17","courseLink":"https://www.coursera.org/learn/shehui-diaocha-yanjiu-fangfa","classCentralLink":"https://www.class-central.com/course/coursera---methodologies-in-social-research-part-2-2783"},{"title":"Tropical Parasitology: Protozoans, Worms, Vectors and Human Diseases","about":"This course provides students an understanding of important human parasitic diseases, including their life cycles, vectors of transmission, distribution and epidemiology, pathophysiology and clinical manifestations, treatment, and prevention and control. Tropical Parasitology is taught by faculty from an area highly impacted by tropical parasites- the Kilimanjaro Christian Medical University College in Moshi, Tanzania. The faculty include Drs. Frank Mosha and Mramba Nyindo (and two lecturers, Drs. Johnson Matowo and Jovin Kitau). Dr. John Bartlett, Professor of Medicine, Global Health and Nursing at Duke University, joins his faculty colleagues in this effort.","tutor":"John Bartlett, Franklin Mosha and Mramba Nyindo","provider":"Coursera","language":"English","skills":["usa","north america"],"subject":"Disease \u0026 Disorders","studentsInterested":"1.1k","courseLink":"https://www.coursera.org/learn/parasitology","classCentralLink":"https://www.class-central.com/course/coursera-tropical-parasitology-protozoans-worms-vectors-and-human-diseases-3154"},{"title":"Clinical Supervision with Confidence","about":"Develop your confidence in supervising medical students and trainees\nThis online course will help you become a more effective clinical supervisor or educator. It is mapped to competences within the Academy of Medical Educators’ framework for professional development, as used by the General Medical Council and Health Education England.\nYou’ll improve your confidence in supervising undergraduate or postgraduate learners.\nYou’ll also develop your knowledge and skills in two challenging areas: how to provide regular, timely and effective feedback; and how to identify concerns around performance early, and raise them with sensitivity, tact and firm action.\nThis course is suitable for all post-registration doctors and healthcare professionals, especially those holding supervisory responsibility for pre-registration health professional students and postgraduate medical trainees in hospital or community settings.\nIt is one of a series of Clinical Supervision courses developed by a multidisciplinary group of clinical educators from Norwich Medical School. Healthcare professionals might find the the Certificate of Achievement for this course useful for providing evidence of Continuing Professional Development (CPD), or commitment to their career.\nAfter this course, you can go on to take:","tutor":"Veena Rodrigues","provider":"FutureLearn","language":"English","skills":["healthcare","europe","uk"],"subject":"Health Care","studentsInterested":"524","courseLink":"https://www.futurelearn.com/courses/clinical-supervision-with-confidence","classCentralLink":"https://www.class-central.com/course/futurelearn-clinical-supervision-with-confidence-3161"},{"title":"eHealth: Combining Psychology, Technology and Health","about":"##\neHealth refers to the use of technologies to improve well-being, health, and healthcare. It is an umbrella term that captures concepts about the health context, technology, and people.\nIn this free online course, we will provide you with insight into the domain of eHealth, describe methods to develop eHealth, and explain theories that enable behaviour change and facilitate implementation. You will also understand how eHealth technologies are developed and used in practice, by means of a variety of case studies, assignments and examples.\nAll videos have subtitles available in Portuguese (Brazil) and Russian.\nThis course pays attention to the perspectives of the eHealth developers, patients, healthcare professionals and healthy people who want to improve or maintain their health and wellbeing. These perspectives are applied to the three main topics of this course:\nDuring Weeks 1 and 2, we will introduce eHealth and show you how eHealth technologies are used to enable or improve self-care and prevention, supportive care, and societal health.\nWeeks 3 and 4 will focus on design. You will learn how to design eHealth that fits the user and the context, and is able to seduce or support people into changing their behaviour.\nIn Weeks 5 and 6, we focus on the diffusion and evaluation of eHealth technologies within the intended context, and among users and other relevant stakeholders.","tutor":"Hanneke Kip, Floor Sieverink, Saskia Kelders and Lisette van Gemert-Pijnen","provider":"FutureLearn","language":"English","skills":["healthcare","europe","technology","ehealth","netherlands"],"subject":"Health Care","studentsInterested":"725","courseLink":"https://www.futurelearn.com/courses/ehealth","classCentralLink":"https://www.class-central.com/course/futurelearn-ehealth-combining-psychology-technology-and-health-5876"},{"title":"Acute and Chronic Rhinosinusitis: A Comprehensive Review","about":"Welcome to Acute and Chronic Rhinosinusitis: A Comprehensive Review\n\nThis course, offered by the Department of Otolaryngology – Head and Neck Surgery at the Icahn School of Medicine at Mount Sinai, is designed to inform primary care physicians and general otolaryngologists, as well as nurses, physician assistants and medical assistants, about the differences between acute and chronic rhinosinusitis and how to distinguish and treat them. It is also applicable to individuals who wish to broaden their knowledge and vernacular about this disease process, especially those who may suffer from this condition. The course has been divided into four modules, each of which is followed by multiple choice questions to help attendees further understand this condition:\n\nWeek 1 - CME Information, Accreditation and Introduction\nWeek 2 - Module 1: Normal Sinus Anatomy and Function (15 min. + quiz)\nWeek 3 - Module 2: Acute Rhinosinusitis: Diagnosis and Treatment (17 min. + quiz)\nWeek 4 - Module 3: Chronic Rhinoinusitis: Diagnosis and Treatment (18 min. + quiz)\nWeek 5 - Module 4: The Role of Surgery for Sinusitis and Activity Evaluation (36 min. + 2 quizzes)\n\nThe primary objective of this course is to provide physicians with a thorough understanding of how to better diagnose and treat patients who suffer from acute and chronic rhinosinusitis.\n\nThose participating in this course have the option to receive CME credit.\nPlease review the CME Information and Accreditation prior to proceeding with the course modules.\n\nRelease Date: January 16, 2018\nExpiration Date: January 16, 2020\nEstimated Time to Complete: One Hour and Forty Five Minutes\nCME Fee: $30.00\nCME Credits Offered: 1.75\n\nCME Reviewer: Marita S. Teng, MD\n\nFor physicians who are interested in earning CME credits and other allied health professions who wish to receive a Verification of Attendance certificate, you must:\n\na. Complete Signature Track (details to follow after enrolling in this course)\nb. Complete registration process through the Icahn School of Medicine at Mount Sinai, CME Office using the following link:\nhttp://bit.ly/Acute_Chronic\n(You will be required to pay an additional non-refundable fee of $30.00 in addition to the $49.00 fee for signature track.)\n\nTo obtain your CME/CE certificate: Email an attached copy of your Verified Certificate from Coursera to the CME office at the Icahn School of Medicine at cme@mssm.edu and request your CME certificate. Please make sure the subject line reads: Coursera CME\n\nTechnical Design and Development\nLynette Bobbitt\nLisa Chase\nJill Gregory\nPaul Lawrence\nCharles Psarreas\nRory Sacks","tutor":"Satish Govindaraj, MD","provider":"Coursera","language":"English","skills":["surgery","rhinosinusitis","sinusitis","usa","north america"],"subject":"Disease \u0026 Disorders","studentsInterested":"461","courseLink":"https://www.coursera.org/learn/icahn-school-of-medicine-at-mount-sinai-acute-and-chronic-rhinosinusitis","classCentralLink":"https://www.class-central.com/course/coursera-acute-and-chronic-rhinosinusitis-a-comprehensive-review-5035"},{"title":"Medical Technology and Evaluation","about":"Innovations in medical technologies are one of the leading areas of economic growth in the world. Whether new technologies take the form of pharmaceutical, medical device, biotechnology, information technology of some combination of these innovations, the opportunities for both private enterprise and social welfare are substantial. However, these innovations are not without cost, and require reimbursement from either a privately or publicly financed health care delivery system to enter the marketplace.\n\nThis course aims to provide knowledge of the concepts, data, and methodology required to critically evaluate new medical technologies in order to secure financial investment, reimbursement, and regulatory compliance objectives, such as FDA approval. The course is designed to provide understanding of the analytic tools needed to evaluate medical technologies. After completing this course, students will have the skills needed to:\n\n- Understand the reimbursement systems financing medical technology use.\n\n- Understand the role of government and regulatory agencies in the development and use of new medical technologies.\n\n- Identify a population to be served by a medical technology.\n\n- Use health care data to evaluate a medical technology.\n\n- Perform cost/benefit and cost/effectiveness analysis of a new technology.","tutor":"Eric Barrette","provider":"Coursera","language":"English","skills":["biotechnology","medical technology","medical devices","usa","north america"],"subject":"Health Care","studentsInterested":"1.1k","courseLink":"https://www.coursera.org/learn/healthcare-medical-technology","classCentralLink":"https://www.class-central.com/course/coursera-medical-technology-and-evaluation-5472"},{"title":"Talking About Cancer: Reducing Risk, Early Detection and Mythbusting","about":"Gain the tips, tools and confidence to have conversations that could save lives\nTalking about cancer can be tough. You might be worried that you’ll say the wrong thing or that you simply don’t know enough about the subject.\nThis course draws on the knowledge of Cancer Research UK experts. Learning is through quizzes, articles, discussion and videos demonstrating conversational dos and don’ts.\nOver the course of 3 weeks you will find out how to encourage people to make healthy lifestyle changes, access local services or visit their doctor promptly if they notice changes to their body.\nThe course is particularly relevant for those working or volunteering in the following areas: advocacy, care and support work, community health centres and services, dentistry, GP surgeries, mental health, nursing, occupational therapy, oncology, osteopathy, pharmacy, physiotherapy, public health, radiotherapy, sexual health, social work, or any other health and social care.\nHowever, it is suitable for anyone with an interest in the topic, and may help with both personal and professional conversations about cancer and health.\nThe course does not require any previous experience of this subject.","tutor":"Gillian Kilgour","provider":"FutureLearn","language":"English","skills":["cancer","diagnosis","cancer treatment"],"subject":"Disease \u0026 Disorders","studentsInterested":"99","courseLink":"https://www.futurelearn.com/courses/talking-about-cancer","classCentralLink":"https://www.class-central.com/course/futurelearn-talking-about-cancer-reducing-risk-early-detection-and-mythbusting-5662"},{"title":"Epidemiology in Public Health Practice","about":"Epidemiology is often described as the cornerstone science in public health. Epidemiology in public health practice uses study design and analyses to identify causes in an outbreak situation, guides interventions to improve population health, and evaluates programs and policies.\n\nIn this course, we\u0027ll define the role of the professional epidemiologist as it relates to public health services, functions, and competencies. With that foundation in mind, we\u0027ll introduce you to the problem solving methodology and demonstrate how it can be used in a wide variety of settings to identify problems, propose solutions, and evaluate interventions. This methodology depends on the use of reliable data, so we\u0027ll take a deep dive into the routine and public health data systems that lie at the heart of epidemiology and then conclude with how you can use that data to calculate measures of disease burden in populations.","tutor":"Keri Althoff","provider":"Coursera","language":"English","skills":["public health","epidemiology","new-moocs-2017"],"subject":"Public Health","studentsInterested":"393","courseLink":"https://www.coursera.org/learn/epidemiology-public-health","classCentralLink":"https://www.class-central.com/course/coursera-epidemiology-in-public-health-practice-8921"},{"title":"食品安全與風險分析（Food Safety＆Risk Analysis）","about":"何謂「食品安全」?\n\n目前食品安全相關議題儼然已經成為我國學術研究、媒體關注的顯學。所謂食品安全可從兩方面觀察，一方面是傳統意義之安全，即現在現有科技與環境條件之基礎上，人類已經認識並得到公示之安全界定；另一方面，伴隨科學發展與技術進步，當人類認識又提高一個層次而對安全性提出新要求時，必須重新界定看似安全但卻存在值得研究之問題，如補充維生素對人體作用之爭議、油炸食品對健康之影響等。\n\n何謂「風險分析」?\n\n食品科技日新月異，人類對飲食條件日益增高，如麵條口感必須Q彈、茶飲料要有回甘喉韻，食品業者為添增食品風味，在食品製造過程中，往往摻入較以往更加繁雜且多樣化之技術或添加物，在滿足消費者味蕾同時，也帶來諸多食品安全之相關風險。伴隨科技逐漸蓬勃與行銷全球化之趨勢，食品科學領域因而蘊含更多對健康俱為之隱憂之不確定性，行政管制於新興風險社會下面臨前所未見的挑戰，傳統「危險防止」的國家任務被要求提升至「風險預防」。因此，在現今食安事件一再發生，而污染源又極為多元的情況下，與食品安全相關之風險管理措施，已經逐漸受到世界各國之關注，許多國家紛紛透過立法及建立專責機構，強化對現代食品之監督管理。\n\n風險分析其實是進入食品安全生活以及保障我們安全最重要的一個課題，延續過去在食品安全與毒理的概念並加入風險分析的架構，制定一套完整的食品安全系統：以科學為基礎，制定政策上的管理，同時應該公開積極與大眾溝通。食品安全資訊需要客觀的安全和主觀的安心並存，安全是科學、安心是人性，中間的轉換需要消費者、媒體、政府和食品界一起努力，花時間改善。\n食品安全與風險分析蘊藏著哪些箇中奧妙，讓我們一起跟隨著姜老師的腳步，一探究竟！","tutor":"姜至剛 Chih-Kang Chiang","provider":"Coursera","language":"Chinese","skills":["food safety","new-moocs-2017"],"subject":"Health \u0026 Medicine","studentsInterested":"8","courseLink":"https://www.coursera.org/learn/foodsafety2","classCentralLink":"https://www.class-central.com/course/coursera--food-safety-risk-analysis-8863"},{"title":"口腔种植学 （Implant Dentistry）","about":"口腔种植学是口腔教育中较新的学科。虽然现在我们都有共识，种植⽛相关的理论知识，⽆论是治疗⽅案的规划，还是后期的随访和维护，对于每⼀个职业⽛医都⾮常重要。然⽽，在当下全球的口腔医学本科培养体系中，它的覆盖程度还远远落后于其重要性。\n\n在此背景下，香港大学口腔医学院联合⾹港⼤学的线上教育专业团队，历时⼀年有余，设计并制作了这门为期五周的⽹络公开课，旨在传播以循证医学为基础的，客观、全⾯的⽛种植学相关知识。这门课程⾯向全球，双语教学，完全免费。学员将在20 多位全球领先的种植学专家的带领下，完成五个模块，系统地学习⽛种植学。","tutor":"Nikos Mattheos","provider":"Coursera","language":"Chinese","skills":["dentistry","oral implantology","new-moocs-2017"],"subject":"Health Care","studentsInterested":"10","courseLink":"https://www.coursera.org/learn/implant-dentistry-chinese","classCentralLink":"https://www.class-central.com/course/coursera--implant-dentistry-9265"},{"title":"Patient Safety and Quality Improvement: Developing a Systems View (Patient Safety I)","about":"In this course, you will be able develop a systems view for patient safety and quality improvement in healthcare. By then end of this course, you will be able to: 1) Describe a minimum of four key events in the history of patient safety and quality improvement, 2) define the key characteristics of high reliability organizations, and 3) explain the benefits of having strategies for both proactive and reactive systems thinking.","tutor":"Melinda Sawyer","provider":"Coursera","language":"English","skills":["patient care","patient safety","new-moocs-2017"],"subject":"Health Care","studentsInterested":"117","courseLink":"https://www.coursera.org/learn/patient-safety-systems-view","classCentralLink":"https://www.class-central.com/course/coursera-patient-safety-and-quality-improvement-developing-a-systems-view-patient-safety-i-9582"},{"title":"The Economics of Health Care Delivery","about":"In this course, you’ll learn about the key components of health care, and the economics behind their principles and pricing strategies. Professors Ezekiel Emanuel of Penn Medicine and Guy David of the Wharton School have designed this course to help you understand the complex structure of the health care system and health insurance. Through study and analysis of providers and insurance through an economic lens, you’ll learn how basic economic principles apply to both principles and payment methods. By the end of this course, you’ll be able to identify different types of health care providers and understand the dynamic between the providers and patient so you can employ best practices and maximize profit for your health care organization.","tutor":"Ezekiel J. Emanuel, MD, PhD and Guy David, PhD","provider":"Coursera","language":"English","skills":["healthcare","economics","pricing strategy"],"subject":"Health Care","studentsInterested":"76","courseLink":"https://www.coursera.org/learn/health-economics-us-healthcare-systems","classCentralLink":"https://www.class-central.com/course/coursera-the-economics-of-health-care-delivery-10796"},{"title":"Introduction to Biomedical Imaging","about":"Imaging technologies form a significant component of the health budgets of all developed economies, and most people need advanced imaging such as MRIs, X-Rays and CT Scans (or CAT Scans) during their life. Many of us are aware of the misinformation sometimes offered in TV dramas, which either exaggerates the benefits or overemphasizes the risks.\nThis medical imaging course provides an introduction to biomedical imaging and modern imaging modalities. The course also covers the basic scientific principals behind each modality, and introduces some of the key applications, from neurological diseases to cancers. This course includes modules specially designed for the general public, whilst also providing some advanced modules which could contribute to professional development in health, engineering and IT industries.","tutor":"Graham Galloway","provider":"edX","language":"English","skills":["uqx"],"subject":"Health Care","studentsInterested":"245","courseLink":"https://www.edx.org/course/introduction-to-biomedical-imaging","classCentralLink":"https://www.class-central.com/course/edx-introduction-to-biomedical-imaging-1648"},{"title":"食品安全與毒理 (Food Safety \u0026 Toxicology)","about":"「民以食為天！」\n歷史的發展伴隨著糧食資源豐富的區域，古中國流傳至今的這句話說明了「吃」是多麼重要的一件事，求得三餐溫飽遂成為那個時代的人的生活中心。但相較於遠古時代，現今的人們較少為了「吃飽」而煩惱，而自此衍生而出的是「不只吃飽，更要吃好」，開始追求大魚大肉、滿漢全席；開始改變烹調方法，煎煮炒炸、煙燻、醃製；開始利用食品加工的技術為食物加上各式各樣的顏色與味道。\n導致在食品加工業蓬勃發展的現代，「吃」這件事變成了一個疑問詞，重視養生的我們開始對吃進去的東西產生疑問，「我吃進去的食物有哪些成分？」、「食品添加物是什麼？」、「食品的檢驗標準是怎麼訂定的？」、「檢驗超標會對人體產生什麼危害？」，這些各式各樣對於吃的疑問加上媒體的渲染下，對「吃」的恐懼油然而生。\n\n「吃得飽不如吃得巧！」\n對應這些問題，其實科學家們發展出了多套嚴謹的毒理機制來評斷食品安全性。而我們將在本課程中以深入淺出的概念將毒理學應用在食品安全評估，介紹這些機制運作的方法和實際應用的例子，希望使同學了解看到擺在架上的食品，其背後許多不為人知的故事，並在面對層出不窮的食安問題時，能具有相當的基本概念，與對這些問題的思辨能力。","tutor":"姜至剛 Chih-Kang Chiang","provider":"Coursera","language":"Chinese","skills":["asia","taiwan"],"subject":"Nutrition \u0026 Wellness","studentsInterested":"64","courseLink":"https://www.coursera.org/learn/shipin-anquan","classCentralLink":"https://www.class-central.com/course/coursera--food-safety-toxicology-2941"},{"title":"The Science of Health Care Delivery","about":"The Mayo Clinic and Arizona State University Alliance for Health Care has developed innovative Science of Health Care Delivery training programs which introduce scientific approaches to quality improvement for patient care and population health, while also examining ways to reduce health costs. The full training, which explores key concepts in the Science of Health Care Delivery and why it is critically important to future patient care, can be used by health care professionals or as curriculum for aspiring care providers.\n\nBy the end of this introductory course, learners will recognize the how education in the Science of Health Care Delivery can improve and enhance the quality of provider care, health care systems and patient health. The overview course consists of a multimedia introduction to Science of Health Care Delivery domains, followed by video segments where learners meet a patient and caregivers who embody or apply new knowledge, skills and attitudes learned from the Science of Health Care Delivery. An expert reflection after each video presentation reinforces the domain’s concepts. Learners can seek more information into this dynamic field with the additional resources provided at the end of the course.","tutor":"C. Dan Johnson, M.D.","provider":"Coursera","language":"English","skills":["healthcare","new-moocs-2017"],"subject":"Health Care","studentsInterested":"118","courseLink":"https://www.coursera.org/learn/science-healthcare-delivery","classCentralLink":"https://www.class-central.com/course/coursera-the-science-of-health-care-delivery-8862"},{"title":"Pharmaceutical and Medical Device Innovations","about":"This course in the Healthcare Marketplace specialization gives the learner an in-depth view of the intellectual property creation that is vital to creating breakthrough technologies. Included is an understanding of the strategy deployed for pricing drugs and new technologies as well as the market sizing exercise to identify where future research and development investments should be made.","tutor":"Bryana Mayer","provider":"Coursera","language":"English","skills":["pharmaceutical industry","medical devices","usa","north america"],"subject":"Health Care","studentsInterested":"1.3k","courseLink":"https://www.coursera.org/learn/pharma-medical-device-innovations","classCentralLink":"https://www.class-central.com/course/coursera-pharmaceutical-and-medical-device-innovations-5485"},{"title":"Understanding NHS Values: Becoming a Nurse or Midwife","about":"##\nIf you are thinking about becoming a registered nurse or midwife, understanding NHS values is important.\nYou’ll want to be as confident as possible that you are making the right career choice. Being fully informed about working within healthcare environments is an important step in this process.\nBuilding an understanding of healthcare environments as early as possible helps to prepare you for being a nursing or midwifery student.\nThirdly the NHS values form a key part of the recruitment process for nurses and midwives.\nOn this course, you’ll use a mixture of articles, interviews with academics and students to explore the NHS Values which underpin healthcare delivery.\nUnderstand the NHS values and how they relate to nursing and midwifery\nOn the course you will get an overview of the NHS values and the implications they have for nursing and midwifery. You’ll review case studies and learn how the values apply in different situations.\nWe’ll look at:\nRespect and dignity - seeing how this relates to the importance of choice in maternity care\nCommitment to quality of care - evaluating the different factors that influence the quality of healthcare systems","tutor":"Julie Bliss","provider":"FutureLearn","language":"English","skills":["europe","uk"],"subject":"Nursing","studentsInterested":"41","courseLink":"https://www.futurelearn.com/courses/nhs-values-nursing-midwifery","classCentralLink":"https://www.class-central.com/course/futurelearn-understanding-nhs-values-becoming-a-nurse-or-midwife-7479"},{"title":"Fixing Healthcare Delivery 2.0: Advanced Lean","about":"Lean or Toyota Production System (TPS) is responsible for revolutionizing the auto industry by creating highly reliable and safe cars and trucks. In this course healthcare providers, administrators, engineers, and healthcare professional students will be taught how to apply the principles and tools of Lean to health care. They will learn how to identify and remove of waste, design standardized work, apply 5S, map Value streams, create process maps, conduct rapid improvement events (RIEs), level workflow, use A3 forms and Paredo charts, apply error proofing, and create effective visual controls. The instructional videos minimize Lean technical language, and include patient cases to make the lessons more appealing to students in healthcare. Acknowledging that patients are very different from cars we have carefully adapted Lean to health care and call our system: Patient-centered Healthcare Delivery System (PHDS). The name and abbreviation emphasize two key principles taught in our course: 1. Just like PhDs the scientific method must be continually applied when creating plans to improve our systems of care. 2. All improvements must be made looking through the eyes of patients. Armed with this new knowledge students will be able to design and implement sustainable healthcare delivery system improvements.","tutor":"Frederick S. Southwick, MD","provider":"Coursera","language":"English","skills":["healthcare","project management","lean","tps","new-moocs-2017"],"subject":"Health Care","studentsInterested":"56","courseLink":"https://www.coursera.org/learn/fixing-healthcare-delivery-advanced-lean","classCentralLink":"https://www.class-central.com/course/coursera-fixing-healthcare-delivery-2-0-advanced-lean-9139"},{"title":"Everyday Chinese Medicine","about":"This course aims to serve as an education platform on Chinese medicine (CM) for the general public. Our primary goal is to empower healthcare choices by promoting awareness and practical application on CM diagnostic and therapeutic approaches, as well as regulation on CM services and herbal products using international examples.\n\nIn the first part of this course, learners will develop skills in applying basic theory of Chinese medicine (CM) for understanding health and illnesses, and be able to compare and contrast views from Chinese and western medicine perspectives. In the second part, learners will be able to diagnose their own CM body constitution, and to apply appropriate CM self-care practice including food therapy, acupressure, Baduanjin and meditation. Learners will also be able to identify commonly used Chinese herbs, and to describe the core principle of acupuncture.\n\nSpecific competencies include:\n\n1. State the basic theory of Chinese medicine and compare it with the principle of western medicine.\n2. Apply the diagnostic approach of Chinese medicine and describe one’s body constitution.\n3. Describe the core principle of Chinese herbs and acupuncture, and to understand their role in promoting health and wellness.\n4. Develop self-care plan according to body constitution, using the practice of food therapy, acupressure, and Baduanjin.","tutor":"Lin Zhi-xiu, Wendy Wong, Liong Ching, Justin Che-Yuen WU and Vincent Chung","provider":"Coursera","language":"English","skills":["chinese medicine","new-moocs-2017"],"subject":"Health Care","studentsInterested":"314","courseLink":"https://www.coursera.org/learn/everyday-chinese-medicine","classCentralLink":"https://www.class-central.com/course/coursera-everyday-chinese-medicine-9386"},{"title":"An Introduction to the U.S. Food System: Perspectives from Public Health","about":"A food system encompasses the activities, people and resources involved in getting food from field to plate. Along the way, it intersects with aspects of public health, equity and the environment. In this course, we will provide a brief introduction to the U.S. food system and how food production practices and what we choose to eat impacts the world in which we live. We will discuss some key historical and political factors that have helped shape the current food system and consider alternative approaches from farm to fork. The course will be led by a team of faculty and staff from the Johns Hopkins Center for a Livable Future. Guest lecturers will include experts from a variety of disciplines, including public health, policy and agriculture.","tutor":"Keeve Nachman and Robert S. Lawrence","provider":"Coursera","language":"English","skills":["usa","north america"],"subject":"Public Health","studentsInterested":"275","courseLink":"https://www.coursera.org/learn/food-system","classCentralLink":"https://www.class-central.com/course/coursera-an-introduction-to-the-u-s-food-system-perspectives-from-public-health-396"},{"title":"Foundations for Global Health Responders","about":"Around the world, we are increasingly socially and economically interdependent. Health on one side of the globe affects people on the other. Global health, once merely an ethical consideration, now dominates discussions and policies of global security. A diverse team of experts in this emerging field has come together to help you contextualize your experiences as a new or seasoned global health responder.\n\nBy the end of this course, you will be enlightened about the changing world you live in, and have a much better understanding of the machinations on how organizations and governments are striving to improve health worldwide. You\u0027ll also learn how to keep yourself safe and be a savvy participant in the global health arena. You\u0027ll be prepared to travel and to take your skills to chronic/emergent situations and help respond to the pressing needs while participating in global health activities throughout the world.\n\nWeek one will serve as an introduction to global health concepts with a look at changing trends in the 21st century; urbanization, environmental stress and resource scarcity. During week two, we will dive into global health security: food, water, energy, and the threats of a changing climate. Week three will cover the global burden of disease, infectious disease, the rise of non-communicable diseases, mental health, and access to care. During week four, we will learn about the stakeholders in global health: NGOs, governments, non-state actors; understanding where the money comes from, how it is allocated and the challenges of measuring results; human rights: what are they and how are they protected? During week five, we move onto complex humanitarian emergencies: forced migrations, wars, response standards, and the legal basis for interventions. Finally, during week six, we will end our course by learning how to be an effective participant--caring for yourself: pre-travel preparation, understanding risks when traveling outside your home country, and physiologic vulnerability.\n\nThis course also serves as a prerequisite to the hands-on \u0027Global Health Responder\u0027 certification from the University of Colorado School of Medicine. If you\u0027re interested in taking this 3-day hands on course-- offered throughout the world-- please go to coloradoWM.org or email our administrator: marisa.burton@ucdenver.edu.","tutor":"Jay Lemery","provider":"Coursera","language":"English","skills":["usa","north america"],"subject":"Public Health","studentsInterested":"147","courseLink":"https://www.coursera.org/learn/ghresponder","classCentralLink":"https://www.class-central.com/course/coursera-foundations-for-global-health-responders-3283"},{"title":"Основы вирусологии (Introduction to Virology)","about":"Существует множество инфекционных заболеваний, причины которых долгие годы казались необъяснимыми. Только в последние десятилетия стало понятно: более 70% из них вызваны вирусами. Причина большинства случаев рака печени — вирусы гепатитов В и С, рака шейки матки – папилломавирусы, более половины случаев диабета 2-го типа обусловлено последствиями заражения вирусом краснухи и другими вирусами. Вирусы — это то, что касается каждого из нас.\nВ нашем курсе вы узнаете о том, как устроены вирусы, чем они отличаются от живых организмов и какие механизмы используют для того, чтобы поразить клетки человека. Это поможет вам понять, как работают противовирусные препараты и вакцины.\nОРВИ, кишечные инфекции, гепатиты, корь, краснуха, бешенство, СПИД — вот далеко не полный список заболеваний, которые имеют вирусную природу. Разобраться в многообразии вирусов вам помогут учёные, которые каждый день работают с ними в лабораториях. Они расскажут об актуальных проблемах и задачах современной вирусологии, которые у всех на слуху. Например, о том, зачем исследователи воссоздали вирус гриппа «испанки», унёсший в начале прошлого века десятки миллионов человеческих жизней, а также о том, что такое вирус Эбола, и почему он опасен.\nВы побываете в современной вирусологической лаборатории и увидите, как нужно работать с вирусами, чтобы исключить вероятность заражения персонала и выхода вируса за пределы лаборатории. И конечно же, вы узнаете, как можно использовать вирусы на благо человека.","tutor":"Sergey Netesov, Margarita Tarasova and Artem Tikunov","provider":"Coursera","language":"Russian","skills":["russia","virology","viruses"],"subject":"Disease \u0026 Disorders","studentsInterested":"57","courseLink":"https://www.coursera.org/learn/nsu-virology","classCentralLink":"https://www.class-central.com/course/coursera---introduction-to-virology-4452"},{"title":"Disease Screening in Public Health","about":"Current and future public health is characterized by the increase of chronic and degenerative diseases, corresponding to the worldwide ageing of the population. The increasing prevalence of these conditions together with the long incubation period of the chronic diseases and the continual technological innovations, offer new opportunities to develop strategies for early diagnosis.\n\nPublic Health has an important mandate to critically assess the promises and the pitfalls of disease screening strategies. This MOOC will help you understand important concepts for screening programs that will be explored through a series of examples that are the most relevant to public health today. We will conclude with expert interviews that explore future topics that will be important for screening.\n\nBy the end of this MOOC, students should have the competency needed to be involved in the scientific field of screening, and understand the public health perspective in screening programs.\n\nThis MOOC has been designed by the University of Geneva and the University of Lausanne.\nThis MOOC has been prepared under the auspices of the Ecole romande de santé publique (www.ersp.ch) by Prof. Fred Paccaud, MD, MSc, Head of the Institute of Social and Preventive Medicine in Lausanne (www.iumsp.ch), in collaboration with Professor Antoine Flahault, MD, PhD, head of the Institute of Global Health, Geneva (https://www.unige.ch/medecine/isg/en/) and Prof. Gillian Bartlett-Esquilant (McGill University, Quebec/ Institute of Social and Preventive Medicine, Lausanne).","tutor":"Antoine Flahault and Fred Paccaud","provider":"Coursera","language":"English","skills":["europe","health screening","health policies","switzerland"],"subject":"Public Health","studentsInterested":"145","courseLink":"https://www.coursera.org/learn/screening","classCentralLink":"https://www.class-central.com/course/coursera-disease-screening-in-public-health-4793"},{"title":"International Hospitality \u0026 Healthcare Services Marketing","about":"As the fastest-growing sectors of the current global economy, both hospitality and healthcare services sector offer tremendous growth opportunities for incumbents and entrepreneurial opportunities for new entrants. To flourish on these opportunities, one must first understand each industry\u0027s unique characteristics. This course is designed to help those who are interested in career advancement opportunities in these industries or who want to be inspired by these industries to better equip themselves with enlightened and creative management capabilities.\n\nPeople who have successfully completed this course will be able to:\n\n(1) Identify the unique characteristics of service businesses and create successful management strategies to better manage the role of customers to gain desirable business outcomes, better market products than are intangible, and better manage customer expectations and perceptions.\n(2) Identify the unique characteristics of the hospitality industry, explain the process of balancing supply and demand in the hospitality industry, and implement optimal marketing and management strategies for this unique market.\n(3) Identify the unique characteristics of the healthcare industry, explain how this industry is evolving into the experience business, and better manage human interactions and facility to enhance the quality of customer experience.\n(4) Gain insights from the innovative approaches in the service industry overall, in hospitality and health industry in particular, and better develop innovative strategies in your industry.","tutor":"Sunmee Choi","provider":"Coursera","language":"English","skills":["healthcare","asia","hospitality industry","south korea"],"subject":"Health Care","studentsInterested":"108","courseLink":"https://www.coursera.org/learn/healthcare-marketing-hospitality-management","classCentralLink":"https://www.class-central.com/course/coursera-international-hospitality-healthcare-services-marketing-5549"},{"title":"eHealth: More than just an electronic record","about":"The MOOC, \"eHealth: More than just an electronic record!\", is multidisciplinary in nature, and aims to equip the global audience of health clinicians, students, managers, administrators, and researchers to reflect on the overall impact of eHealth on the integration of care. It explores the breadth of technology application, current and emerging trends, and showcases both local and international eHealth practice and research.\n\nThe entire eHealth Course consists of 5 modules and takes about 5 weeks to complete. Completion certificates are issued on the basis of participation in all 5 modules. Completing the health practice assignment in Module 5 entitles you to advanced standing in some of the eHealth courses run by the Faculty of Health Sciences, University of Sydney.\n\nWhat you\u0027ll learn\n- The fundamentals of eHealth and where it is heading\n- What kind of health data we are currently collecting and how it will transform healthcare in the future\n- How new technologies are helping health consumers participate in their own healthcare\n- How eHealth can improve the coordination and efficiency of healthcare and what the barriers might be\n\nLength: Self-paced 5 week course\nStudy time commitment: 3 hours per week\nAssessable components: Assignment 1 in Module 2 (40%) and Assignment 2 in Module 5 (60%).\n\nGuest presenters (listed in alphabetical order):\n* Jordan Andersen | The University of Sydney\n* Dr Teresa Andersen | Sydney Local Health District\n* Dr Robert Birnbaum | Harvard Medical School / Partners Healthcare\n* Melissa Brunner | The University of Newcastle \u0026 The University of Sydney\n* Professor Jane Burns | Young and Well Cooperative Research Centre \u0026 The University of Sydney\n* Professor Rafael A. Calvo | The University of Sydney\n* Dr Andrew Campbell | The University of Sydney\n* Dr Jelle Demeestere | John Hunter Hospital, Newcastle NSW\n* Professor Hugh Durrant-Whyte | The University of Sydney\n* Karen Finnin | Physios Online\n* Professor Afaf Girgis | UNSW Medicine\n* Anna Janssen | The University of Sydney\n* Professor Judy Kay | The University of Sydney\n* Dr Melanie Keep | The University of Sydney\n* A/Professor Jinman Kim | The University of Sydney\n* Dr John Lambert | eHealth NSW\n* Dr Melanie Keep | The University of Sydney\n* Dr Karen Luxford | Clinical Excellence Committee NSW\n* Michael Marthick | Chris O’Brien Lifehouse \u0026 The University of Sydney\n* A/ Professor Mark McEntee | The University of Sydney\n* Professor Kathryn Refshauge | The University of Sydney\n* Dr Ursula Sansom-Daly | Sydney Children\u0027s Hospital, Prince of Wales Hospital \u0026 UNSW Medicine\n* Dr Arran Schlosberg | The University of Sydney\n* Professor Stephen Simpson | The University of Sydney\n* Professor Leanne Togher | The University of Sydney\n* Josh Zadro | The University of Sydney","tutor":"Tim Shaw","provider":"Coursera","language":"English","skills":["australia"],"subject":"Health \u0026 Medicine","studentsInterested":"94","courseLink":"https://www.coursera.org/learn/ehealth","classCentralLink":"https://www.class-central.com/course/coursera-ehealth-more-than-just-an-electronic-record-6876"},{"title":"Introduction to the Biology of Cancer","about":"Over 500,000 people in the United States and over 8 million people worldwide are dying every year from cancer. As people live longer, the incidence of cancer is rising worldwide and the disease is expected to strike over 20 million people annually by 2030. This open course is designed for people who would like to develop an understanding of cancer and how it is prevented, diagnosed, and treated.\n\nThe course introduces the molecular biology of cancer (oncogenes and tumor suppressor genes) as well as the biologic hallmarks of cancer. The course also describes the risk factors for the major cancers worldwide, including lung cancer, breast cancer, colon cancer, prostate cancer, liver cancer, and stomach cancer. We explain how cancer is staged, the major ways cancer is found by imaging, and how the major cancers are treated.\n\nIn addition to the core materials, this course includes two Honors lessons devoted to cancers of the liver and prostate.\n\nUpon successful completion of this course, you will be able to:\n\n- Identify the major types of cancer worldwide. (Lecture 1)\n- Describe how genes contribute to the risk and growth of cancer. (Lecture 2)\n- List and describe the ten cellular hallmarks of cancer. (Lecture 3)\n- Define metastasis, and identify the major steps in the metastatic process. (Lecture 4)\n- Describe the role of imaging in the screening, diagnosis, staging, and treatments of cancer. (Lecture 5)\n- Explain how cancer is treated. (Lecture 6)\n\nWe hope that this course gives you a basic understanding of cancer biology and treatment. The course is not designed for patients seeking treatment guidance – but it can help you understand how cancer develops and provides a framework for understanding cancer diagnosis and treatment.","tutor":"Kenneth J. Pienta, M.D.","provider":"Coursera","language":"English","skills":["usa","north america"],"subject":"Disease \u0026 Disorders","studentsInterested":"2.4k","courseLink":"https://www.coursera.org/learn/cancer","classCentralLink":"https://www.class-central.com/course/coursera-introduction-to-the-biology-of-cancer-7994"},{"title":"Schizophrenia","about":"The main goal of this class are to gain an introductory exposure to the nature of the psychiatric disorder known as schizophrenia as revealed by the scientific method. We will discuss a broad range of findings from the scientific investigation of biological and psychological factors related to schizophrenia and its treatment. More specifically we will learn about: (1) key symptomatic features through discussion and enactments of interviews with actors portraying many of the cardinal features of the illness, (2) what brain imaging studies (MRI and fMRI) and neurochemistry have taught us about the neuroscience of the disorder, (3) scientific psychological data and theories concerning cognition, emotion and behavior in schizophrenia, and (4) current, evidence-based somatic and psychosocial approaches to treatment. A brief historical overview of the recent emergence of the psychiatric category of schizophrenia will be presented as well.","tutor":"Matt Kurtz","provider":"Coursera","language":"English","skills":["schizophrenia","brain imaging","new-moocs-2017"],"subject":"Disease \u0026 Disorders","studentsInterested":"290","courseLink":"https://www.coursera.org/learn/schizophrenia","classCentralLink":"https://www.class-central.com/course/coursera-schizophrenia-9387"},{"title":"Myocardial Infarction","about":"Cardiovascular diseases are – according to the (World Health Organization (WHO) – the number one cause of death globally. Myocardial infarction (heart attack) is the most prominent under the Cardiovascular diseases. In Switzerland alone, the risk to develop a coronary heart disease during life time is around 25% for men and 18% for women.\n\nMost cardiovascular diseases can be prevented by addressing behavioral risk factors, the understanding of these risk factors, their mechanisms and impact on the cardiovascular system.\n\nIn this context our course aims to approach the complex field of myocardial infarction in two respects: medical education and awareness of a broader audience.","tutor":"Prof. Thomas F. Lüscher","provider":"Coursera","language":"English","skills":["heart disease","myocardial infarction","new-moocs-2017"],"subject":"Disease \u0026 Disorders","studentsInterested":"114","courseLink":"https://www.coursera.org/learn/infarction","classCentralLink":"https://www.class-central.com/course/coursera-myocardial-infarction-9589"},{"title":"The Social Context of Mental Health and Illness","about":"Learn how social factors promote mental health, influence the onset and course of mental illness, and affect how mental illnesses are diagnosed and treated.\n\nThis course explores how our understanding of mental health and illness has been influenced by social attitudes and social developments in North America and around the world. The course begins by situating our contemporary mental health practices in historical context, then looks at different aspects of mental health, mental illness and mental health services and their connections to what’s going on in our social environment.","tutor":"Charmaine Williams","provider":"Coursera","language":"English","skills":["canada","north america"],"subject":"Disease \u0026 Disorders","studentsInterested":"2.1k","courseLink":"https://www.coursera.org/learn/mental-health","classCentralLink":"https://www.class-central.com/course/coursera-the-social-context-of-mental-health-and-illness-400"},{"title":"Interprofessional Healthcare Informatics","about":"Interprofessional Healthcare Informatics is a graduate-level, hands-on interactive exploration of real informatics tools and techniques offered by the University of Minnesota and the University of Minnesota\u0027s National Center for Interprofessional Practice and Education. We will be incorporating technology-enabled educational innovations to bring the subject matter to life. Over the 10 modules, we will create a vital online learning community and a working healthcare informatics network.\n\nWe will explore perspectives of clinicians like dentists, physical therapists, nurses, and physicians in all sorts of practice settings worldwide. Emerging technologies, telehealth, gaming, simulations, and eScience are just some of the topics that we will consider.\n\nThroughout the course, we’ll focus on creativity, controversy, and collaboration - as we collectively imagine and create the future within the rapidly evolving healthcare informatics milieu. All healthcare professionals and IT geeks are welcome!","tutor":"Karen Monsen","provider":"Coursera","language":"English","skills":["usa","north america"],"subject":"Health Care","studentsInterested":"362","courseLink":"https://www.coursera.org/learn/health-informatics-professional","classCentralLink":"https://www.class-central.com/course/coursera-interprofessional-healthcare-informatics-657"},{"title":"Diabetes - a Global Challenge","about":"Diabetes and obesity are growing health problems in rich and poor countries alike. With this course you will get updated on cutting-edge diabetes and obesity research including biological, genetic and clinical aspects as well as prevention and epidemiology of diabetes and obesity. All lectures are provided by high-profile scientists from one the world\u0027s leading universities in diabetes research.\n\nThis course is part of the EIT Health Campus programme.\n\nWe hope you will enjoy our course.\n\nBest Wishes\n\nJens Juul Holst, Signe Sørensen Torekov and Nicolai Wewer Albrechtsen\nDepartment of Biomedical Sciences Novo Nordisk Foundation Center for Basic Metabolic Research\nFaculty of Health and Medical Sciences University of Copenhagen","tutor":"Jens Juul Holst and Signe Sørensen Torekov","provider":"Coursera","language":"English","skills":["denmark","north america"],"subject":"Disease \u0026 Disorders","studentsInterested":"697","courseLink":"https://www.coursera.org/learn/diabetes","classCentralLink":"https://www.class-central.com/course/coursera-diabetes-a-global-challenge-664"},{"title":"Statistical Reasoning for Public Health 1: Estimation, Inference, \u0026 Interpretation","about":"A conceptual and interpretive public health approach to some of the most commonly used methods from basic statistics.","tutor":"John McGready","provider":"Coursera","language":"English","skills":["public health","epidemiology","usa","north america"],"subject":"Public Health","studentsInterested":"3.0k","courseLink":"https://www.coursera.org/learn/statistical-reasoning-1","classCentralLink":"https://www.class-central.com/course/coursera-statistical-reasoning-for-public-health-1-estimation-inference-interpretation-1036"},{"title":"Preventing Chronic Pain: A Human Systems Approach","about":"Chronic pain is at epidemic levels and has become the highest-cost condition in health care. This course uses evidence-based science with creative and experiential learning to better understand chronic pain conditions and how they can be prevented through self-management in our cognitive, behavioral, physical, emotional, spiritual, social, and environmental realms.\n\nThe goal of this course is to blend creative, experiential, and evidence-based teaching strategies to help participants understand chronic pain conditions and how a human systems approach can be applied to self-management strategies to reduce risk factors, enhance protective factors, and prevent chronic pain. There are four major objectives to the course;\n\n1. Describe the prevalence, personal impact, and health care dilemma associated with chronic pain.\n2. Recognize the clinical characteristics and underlying etiology of several common pain conditions and the peripheral, central, and genetic mechanisms of chronic pain\n3. Based on the literature associated with risk and protective factors in the seven realms of our lives, learn specific strategies in each realm that can be employed daily to prevent chronic pain and enhance wellness.\n4. Appreciate the value of a human systems approach to health care and how it can provide a basis for integrative, interdisciplinary, and individualized care to preventing pain and enhancing wellness.\n\nCONTINUING EDUCATION CREDIT OPTION\n\nAccreditation Statement:\nUniversity of Minnesota, Interprofessional Continuing Education is accredited by the Accreditation Council for Continuing Medical Education (ACCME), the Accreditation Council for Pharmacy Education (ACPE), and the American Nurses Credentialing Center (ANCC), to provide continuing education for the healthcare team.\n\nAmerican Medical Association (AMA)\nThe University of Minnesota, Interprofessional Continuing Education designates this enduring material for a maximum of 24.0 AMA PRA Category 1 Credits™. Physicians should claim only the credit commensurate with the extent of their participation in the activity.\n\nAmerican Nurses Credentialing Center (ANCC)\nThis activity is awarded up to 24.0 ANCC contact hours.\n\nOther Health Care Professionals\nOther health care professionals who participate in this CE activity may submit this certificate statement of participation to their appropriate accrediting organizations or state boards for consideration of credit. The participant is responsible for determining whether this activity meets the requirements for acceptable continuing education.\n\nRegistration and disclosure information is available here at http://z.umn.edu/chronicpain and pay the additional fee. Then, email your Coursera certificate statement of completion to cme@umn.edu.","tutor":"James Fricton","provider":"Coursera","language":"English","skills":["usa","north america"],"subject":"Nutrition \u0026 Wellness","studentsInterested":"2.4k","courseLink":"https://www.coursera.org/learn/chronic-pain","classCentralLink":"https://www.class-central.com/course/coursera-preventing-chronic-pain-a-human-systems-approach-1769"},{"title":"Autism Spectrum Disorder","about":"Understanding the characteristics of autism spectrum disorder (ASD) and their implications for behavior, learning and the ability to process information is critical for anyone working or interacting with those on the spectrum -- educators, clinicians, counselors, therapists, medical staff, family and employers. This course will give you a fundamental understanding of what ASD is, how it is diagnosed, the primary areas of impairment, and why prevalence is increasing.\n\nExamine the developmental and sensori-motor differences that may impact academic, play, social and self-help skills at different stages of life, including the transition to higher education and employment. Gain a clear understanding of how sensory regulation differs for individuals on the spectrum, and explore practical tools for identifying triggers and communicating feelings. Learn to use evidence-based practices to provide effective interventions and explore typical strengths and weaknesses of individuals on the spectrum in relation to identified impairments.\n\nThe course culminates with a description of the ASD system of care, an overview of the National Standards Report studies and treatments, and an explanation of how evidence-based practices are established and implemented.\n\nThose seeking a more in-depth, instructor-led experience are encouraged to check out the Professional Concentration in Autism offered by UC Davis Extension: https://extension.ucdavis.edu/certificate-program/professional-concentration-autism-spectrum-disorders","tutor":"Patricia Schetter","provider":"Coursera","language":"English","skills":["autism","asd","usa","north america"],"subject":"Disease \u0026 Disorders","studentsInterested":"2.5k","courseLink":"https://www.coursera.org/learn/autism-spectrum-disorder","classCentralLink":"https://www.class-central.com/course/coursera-autism-spectrum-disorder-5076"},{"title":"Exploring Cancer Medicines","about":"##\nThis course will introduce you to the topic of cancer chemotherapy, and how the development of effective medications for the treatment of cancer remains a significant challenge to scientists.\nYou will research the use and development of cancer medicines, focusing on chemotherapy. In addition, through an exploration of how science is communicated to the general public, you will also look at the skills you need to become an effective science writer.\nThis course is part of the Going to University collection which has been specifically designed for schools and colleges. The course can be used as a teachers’ classroom enrichment resource or can be studied independently by students.","tutor":"Richard Foster and Paul Taylor","provider":"FutureLearn","language":"English","skills":["europe","cancer","uk","cancer treatment","chemotherapy"],"subject":"Disease \u0026 Disorders","studentsInterested":"208","courseLink":"https://www.futurelearn.com/courses/exploring-cancer-medicines","classCentralLink":"https://www.class-central.com/course/futurelearn-exploring-cancer-medicines-6790"},{"title":"Drug Commercialization","about":"The University of California San Diego, Skaggs School of Pharmacy and Pharmaceutical Sciences Drug Commercialization course brings you lectures from both faculty and industry experts. With this course, recorded on campus at UCSD, we seek to share our access to top people in the field who bring an unprecedented range of expertise on drug commercialization.\n\nThis course will cover pharmacoeconomic, marketing strategy, intellectual property strategy, portfolio management, managed markets and strategic alliances. It will also have a lecture case study from startup to success.\n\nIn addition, the course will discuss post-marketing clinical trials or Phase 4 trials. These are conducted after a new drug has been approved by the regulatory agencies and launched. In these studies, the new drug is prescribed in an everyday healthcare environ­ment using a much larger group of patients. This enables new treat­ment uses for the new drug to be developed, comparisons with other treatments for the same indication to be made, and determination of the clinical effectiveness of the new drug in a wider variety of patient types, and more rare side effects, if any, may be detected .\n\nPre-marketing strategy should be instigated as early as Phase 1 clinical trials to ensure that the market\u0027s needs are incorporated into the new drug\u0027s overall develop­ment. Later phases when clinical results are presented at international medical conferences the marketing strategy is then refined in order to develop an awareness amongst the medical community who will be prescribing the new drug. In addition to the marketing strategy, pricing strategy and a tactical plan will be developed. Promotional material, and the sales force will be trained so that when the product is approved they can promote the drug to physician, pharmacist and nurses.\n\nThis course is intended as part 3 of a series: Drug Discovery (https://www.coursera.org/learn/drug-discovery), Drug Development (https://www.coursera.org/learn/drug-development) and Drug Commercialization. We would highly recommend that you take the courses in order since it will give you a better understanding on how a drug is discovered in the lab before being tested in clinical trials and then launched in the market place.","tutor":"Williams Ettouati and Joseph Ma","provider":"Coursera","language":"English","skills":["usa","north america"],"subject":"Health Care","studentsInterested":"93","courseLink":"https://www.coursera.org/learn/drug-commercialization","classCentralLink":"https://www.class-central.com/course/coursera-drug-commercialization-7255"},{"title":"HPV-Associated Oral and Throat Cancer: What You Need to Know","about":"Welcome to HPV-Associated Oral and Throat Cancers: What You Need to Know\n\nThis course, offered by the Department of Otolaryngology – Head and Neck Surgery at the Icahn School of Medicine at Mount Sinai, is designed to inform primary care physicians and otolaryngologists (general and head and neck surgeons), as well as medical students, residents, nurses, physician assistants, medical assistants, about HPV-associated oral and throat cancers. It is also applicable to individuals who wish to broaden their knowledge and vernacular about this disease process, especially those who may have been diagnosed with HPV and/or HPV-associated oropharyngeal cancers. The course has been divided into four modules, each of which is followed by multiple choice questions to help attendees further understand this condition:\n\nWeek 1 - CME Information, Accreditation and Introduction (2 min)\nWeek 2 - Module 1: HPV-associated Throat Cancer: An Epidemic (11 min. + quiz)\nWeek 3 - Module 2: HPV Risk Factors and Clinical Presentation (10 min. + quiz)\nWeek 4 - Module 3: Management of HPV-associated Oropharyngeal Cancer (13 min. + quiz)\nWeek 5 - Module 4: Prevention, Vaccination, and the Horizon (10 min. + quiz)\n\nThe primary objective of this course is to provide physicians with a thorough understanding of how to better diagnose and treat patients who have HPV-related oral and throat cancers.\n\nThose participating in this course have the option to receive CME credit. Please review the CME Information and Accreditation prior to proceeding with the course modules.\n\nRelease Date: November 15, 2016\nExpiration Date: November 15, 2018\nEstimated Time to Complete: 1 hour\nCME Fee: $30\nCME Credits Offered: 1.0\n\nCME Reviewer: Marita S. Teng, MD\n\nHow to Receive CME Credit:\nFor physicians who are interested in earning CME credits and other allied health professions who wish to receive a Verification of Attendance certificate, you must:\n\na. Complete Signature Track (details to follow after enrolling in this course)\n\nb. Complete registration process through the Icahn School of Medicine at Mount Sinai, CME Office using the following link: http://cmetracker.net/MSSMCMEB/Login?formname\u003dRegLoginLive\u0026EventID\u003d201115 (You will be required to pay an additional non-refundable fee of $30.00 in addition to the $49.00 fee for signature track.)\n\nTo obtain your CME/CE certificate: Email an attached copy of your Verified Certificate from Coursera to the CME office at the Icahn School of Medicine at cme@mssm.edu and request your CME certificate. Please make sure the subject line reads: Coursera CME\n\nCourse Planners\nLynette Bobbitt\nLisa Chase\nEric M. Genden, MD\nJill Gregory\nGale Justin\nPaul Lawrence\nCarter Lim\nErik Popil","tutor":"Eric M. Genden, MD","provider":"Coursera","language":"English","skills":["usa","north america"],"subject":"Disease \u0026 Disorders","studentsInterested":"87","courseLink":"https://www.coursera.org/learn/hpv-oral-throat-cancer","classCentralLink":"https://www.class-central.com/course/coursera-hpv-associated-oral-and-throat-cancer-what-you-need-to-know-7584"},{"title":"Organ Donation: From Death to Life","about":"Considering someone for organ and tissue donation at the end of life is complicated. The boundary between life and death is more complex than ever before and it falls to medical professionals to help clarify a situation at an often confusing and emotionally stressful time.\n\nIn this course you will learn about the science behind death determination and when it is possible for deceased organ donation take place. The lectures will cover medical standards at the end of life - from brain death testing, to requesting informed consent from a grieving family. By improving knowledge of good ethical practices, cultural and religious considerations and the logistics of the organ donation process this course will empower the interactions and discussions of medical professionals and the general public at an often confusing time.\n\nThis course will help you to ensure that the option of organ donation is compassionately explored in all appropriate situations at the end of life in the best way possible.\n\nWatch the course trailer here https://www.youtube.com/watch?v\u003dAk-kVtmZGRs\n\nThe course is certified for continuing professional development (CPD) points in South Africa. Send your completion certificate to organdonation@uct.ac.za together with your HPCSA number for 25 general and 5 ethics points.\n\nFor another interesting course on organ donation and transplantation, see Clinical Kidney, Pancreas and Islet Transplantation from Leiden University https://www.coursera.org/learn/clinical-kidney-transplantation","tutor":"David Thomson","provider":"Coursera","language":"English","skills":["new-moocs-2017"],"subject":"Health Care","studentsInterested":"662","courseLink":"https://www.coursera.org/learn/organ-donation","classCentralLink":"https://www.class-central.com/course/coursera-organ-donation-from-death-to-life-8708"},{"title":"Food as Medicine: Food and our Genome","about":"Discover the relationship between food and genetics\nHow does our genome affect our health? Should patients adjust their diets according to their genes? Answer these questions and more with this course designed to give healthcare professionals the latest information on food and genetics.\nOn the course you’ll explore topics including epigenetics and nutrigenetics, the human genome and the ethical issues surrounding genetic healthcare. You should leave the course with a greater understanding out the impact of genetics on nutritional requirements, and you should feel more confident in answering common nutrition and gene related questions.\nPlaces in this course are limited to 100, so please register early to avoid disappointment.\nThis course has been designed for healthcare professionals, specifically medical specialists, general practitioners and nurses.\nHowever, the course may be of benefit to healthcare professionals such as dietitians and nutritionists with a background in nutrition, who may like a ‘refresher’ in this area of study.\nYou should have a good knowledge of science, medicine and healthcare practice.\nThis course is recognised by:","tutor":"Helen Truby","provider":"FutureLearn","language":"English","skills":["food","nutrition","genetics"],"subject":"Nutrition \u0026 Wellness","studentsInterested":"119","courseLink":"https://www.futurelearn.com/courses/fam-genome","classCentralLink":"https://www.class-central.com/course/futurelearn-food-as-medicine-food-and-our-genome-9148"},{"title":"Food as Medicine: Food, Exercise and the Gut","about":"Improve your knowledge of the gut and how it’s affected by food and exercise\nThe gut is a complex part of the human body, and can be affected by many different factors. It’s vital healthcare professionals have a solid understanding of how the gut works, and what can exacerbate or improve gut problems.\nOn this course you will grow your understanding of gut health and learn current information on food, exercise and its effects on the gastrointestinal tract. You will explore subjects like exercise-induced gastrointestinal syndrome and nutritional intervention - leaving the course with an improved understanding that you can apply in your practice.\nPlaces in this course are limited to 100, so please register early to avoid disappointment.\nThis course is designed for healthcare professionals, specifically sports physicians and dietitians. It assumes knowledge of science, medicine and healthcare practice.\nThis course is recognised by:\nSports Dietitian Australia (SDA): Successful completion of this course will attract 20 SDA CPD Points for members.\nSports Nutrition Exercise Register (SENr)/British Dietetic Association (BDA): endorsement applies only to the educational content of the learning activity.","tutor":"Helen Truby","provider":"FutureLearn","language":"English","skills":["food","nutrition","exercise"],"subject":"Nutrition \u0026 Wellness","studentsInterested":"220","courseLink":"https://www.futurelearn.com/courses/fam-exercise-gut","classCentralLink":"https://www.class-central.com/course/futurelearn-food-as-medicine-food-exercise-and-the-gut-9124"},{"title":"Business Models for Innovative Care for Older People","about":"Aging has been coined as one of the major societal challenges. The fact that we simply live longer, is in itself not a problem but rather a triumph. However, this unprecedented demographic change significantly affects individual life histories through an increased number of e.g. lifestyle related chronic diseases. These extra life years, also have a massive imprint on the organization of welfare institutions and the financial sustainability of the welfare system.\n\nThis course will introduce you to healthcare innovation within the field of healthy living and active aging. By following two specific cases on diabetes and rehabilitation, this interdisciplinary course will provide you with key theories, tools and concepts for analyzing and developing viable innovative solutions for aging populations. The lectures will cover demographic, biological, economic, social and cultural aspects of active aging and healthy living, along with lectures on current innovation theories and methods.\n\nDuring the course you will meet leading researchers and experts from among others: University of Copenhagen, Copenhagen Business School, Steno Diabetes Center in Copenhagen and Erasmus University of Rotterdam.\n\nThey work with very different aspects of active aging and healthy living, from biomedicine to digital design, but what ties them together is the belief that an interdisciplinary approach to healthcare innovation will benefit the aging population.\n\nThe course is part of the EIT Health Campus programme https://www.eithealth.eu/campus.\n\nWe hope you will enjoy this course and equip yourself to take a more professional approach to healthcare innovation.","tutor":"Rudi Westendorp and Finn Valentin","provider":"Coursera","language":"English","skills":["healthcare","aging","elderly"],"subject":"Health Care","studentsInterested":"36","courseLink":"https://www.coursera.org/learn/business-models-innovative-care","classCentralLink":"https://www.class-central.com/course/coursera-business-models-for-innovative-care-for-older-people-9799"},{"title":"Global Health and Disability","about":"##\nAround 15% of the world’s population, or 1 billion people, live with some form of disability, with numbers continuing to rise over the coming decades.\nPeople with disabilities are often overlooked in national and international development, and can face widespread barriers in accessing services, including health and rehabilitation services, even though simple initiatives are available to enable access.\nOur three week course aims to raise awareness about the importance of health and well-being of people with disabilities in the context of the global development agenda: Leaving no one behind.\nThis course is designed for anyone with a professional or personal interest in disability as it relates to health, rehabilitation, international development and humanitarian assistance.\nThere is a particular focus on low and middle income countries – both in the content of the course and the target learners.\nCover photo: © Photo Robin Wyatt 2014: see www.robinwyatt.org","tutor":"Hannah Kuper","provider":"FutureLearn","language":"English","skills":["global health","disabilities"],"subject":"Public Health","studentsInterested":"31","courseLink":"https://www.futurelearn.com/courses/global-disability","classCentralLink":"https://www.class-central.com/course/futurelearn-global-health-and-disability-9826"},{"title":"Data Management for Clinical Research","about":"This course presents critical concepts and practical methods to support planning, collection, storage, and dissemination of data in clinical research.\n\nUnderstanding and implementing solid data management principles is critical for any scientific domain. Regardless of your current (or anticipated) role in the research enterprise, a strong working knowledge and skill set in data management principles and practice will increase your productivity and improve your science. Our goal is to use these modules to help you learn and practice this skill set.\n\nThis course assumes very little current knowledge of technology other than how to operate a web browser. We will focus on practical lessons, short quizzes, and hands-on exercises as we explore together best practices for data management.","tutor":"Paul A. Harris, Stephany Duda and Firas Wehbe","provider":"Coursera","language":"English","skills":["usa","north america"],"subject":"Health Care","studentsInterested":"1.4k","courseLink":"https://www.coursera.org/learn/clinical-data-management","classCentralLink":"https://www.class-central.com/course/coursera-data-management-for-clinical-research-540"},{"title":"The Challenges of Global Health","about":"An introduction to key challenges and concepts important to understanding the current status and determinants of global health.","tutor":"David Boyd","provider":"Coursera","language":"English","skills":["global health","usa","north america"],"subject":"Public Health","studentsInterested":"877","courseLink":"https://www.coursera.org/learn/global-health","classCentralLink":"https://www.class-central.com/course/coursera-the-challenges-of-global-health-2376"},{"title":"Case Studies in Personalized Medicine","about":"Learn how advances in biomedicine hold the potential to revolutionize drug development, drug treatments, and disease prevention: where are we now, and what does the future hold? This course will present short primers in genetics and mechanisms underlying variability in drug responses. A series of case studies will be used to illustrate principles of how genetics are being brought to bear on refining diagnoses and on personalizing treatment in rare and common diseases. The ethical and operational issues around how to implement large scale genomic sequencing in clinical practice will be addressed.\n\nAfter completing this course, learners will understand\n1. The ways in which genetic variants can contribute to human disease susceptibility\n2. How to choose among drug therapies based on genetic factors\n3. That the functional consequences of the vast majority of genetic variants discovered by modern sequencing are unknown.\n\nThis course is targeted primarily at physicians 5+ years out of training. Other healthcare providers, medical/health sciences students, and members of the public may also be interested.\n\nCourse launches January 15, 2016.\n\n* The information presented in “Case Studies in Personalized Medicine” is offered for educational and informational purposes only, and should not be construed as personal medical advice. If you have questions or concerns about a medical matter, please consult your doctor or other professional healthcare provider.","tutor":"Dan Roden","provider":"Coursera","language":"English","skills":["usa","north america"],"subject":"Health \u0026 Medicine","studentsInterested":"908","courseLink":"https://www.coursera.org/learn/personalizedmed","classCentralLink":"https://www.class-central.com/course/coursera-case-studies-in-personalized-medicine-2573"},{"title":"Feeding the World","about":"This course will explore the concepts driving current food production science (population growth, urbanization, emerging affluence, resource constraints, and underlying biological limits) with the main focus on livestock production. Each of the major food animal species (dairy, swine, beef, and poultry) will be covered in terms of their universal life cycles, constraints to production and emerging societal issues.\n\nThroughout the course, we will tackle some difficult and important questions:\nWhat are the major health benefits and potential concerns regarding the production and consumption of animal products?\nHow does animal production affect the efficient use of resources and impact our environment?\nCan cost of production be reduced to meet growing demand for animal products around the globe while maintaining health and safety for both animals and consumers?\nWhat are the different types of animal food production systems?\n\nMyths and misconceptions surrounding the animal food systems will be discussed. We’ll also look closely at some of the global issues, problems, and challenges in these food systems which scientists, farmers, and veterinarians, are attempting to solve through collaboration.\n\nLectures will be delivered by several experts from the University of Pennsylvania, School of Veterinary Medicine who are intimately involved in the study and advancement of animal production systems. The course is geared towards learners who seek a greater understanding of animal food systems as well as those who might have never visited an animal farm, but have a desire to learn more about where some of our food comes from and issues surrounding sustainability.","tutor":"David Galligan and James Ferguson","provider":"Coursera","language":"English","skills":["food production","usa","north america"],"subject":"Nutrition \u0026 Wellness","studentsInterested":"232","courseLink":"https://www.coursera.org/learn/feedingtheworld","classCentralLink":"https://www.class-central.com/course/coursera-feeding-the-world-3913"},{"title":"İnfertilite Hemşireliği (Infertility Nursing)","about":"İnfertilite tanı ve tedavi aşamasında bireylere verilecek hemşirelik bakım sürecinin uygulaması aşamasında ihtiyaç duyulan temel bilgiyi sağlar. İnfertilitenin nedenleri, tanı ve tedavi yöntemleri, bu süreçlerde çiftlerin yaşadıkları fiziksel ve psikososyal sorunları ve önlemeye yönelik hemşirelik girişimlerini içerir.","tutor":"Aygül Akyüz","provider":"Coursera","language":"Turkish","skills":["nursing","asia","infertility nursing","turkey"],"subject":"Nursing","studentsInterested":"24","courseLink":"https://www.coursera.org/learn/infertilite","classCentralLink":"https://www.class-central.com/course/coursera-infertilite-hemsireligi-infertility-nursing-4858"}]