[{"title":"What Is a Mind?","about":"##\nThis free online course will bring together learners and practitioners interested in how the mind works. It aims to build bridges between traditionally antagonistic approaches to understanding the mind.\nWhat is a mind?\nThis question has perplexed philosophers, scientists, historians and ordinary people across time and cultures.\nWhile advances in the medical understanding of how the brain functions can shed light on neurological functions and disorders, the essential question of what the mind is speaks to a different problem.\nThis problem cannot be answered by a purely scientific understanding of the brain, nor by a purely philosophical or psychological approach. Many disciplines have attempted to address the question, resulting in multiple and sometimes antithetical answers.\nNew understandings of the mind\nOn this course, Professor Mark Solms, Chair of Neuropsychology at the University of Cape Town, will adopt a multidisciplinary approach.\nHe will bring in perspectives from a range of disciplines, to explore four specific aspects of the mind- subjectivity, intentionality, consciousness and agency. Together, these will help us think about the fundamental questions: what it is to be a mind, why we have a mind and what it feels like to have a mind.","tutor":"Mark Solms","provider":"FutureLearn","language":"English","skills":["africa","south africa"],"subject":"Psychology","studentsInterested":"11.6k","courseLink":"https://www.futurelearn.com/courses/what-is-a-mind","classCentralLink":"https://www.class-central.com/course/futurelearn-what-is-a-mind-3314"},{"title":"Model Thinking","about":"We live in a complex world with diverse people, firms, and governments whose behaviors aggregate to produce novel, unexpected phenomena. We see political uprisings, market crashes, and a never ending array of social trends. How do we make sense of it? Models. Evidence shows that people who think with models consistently outperform those who don\u0027t. And, moreover people who think with lots of models outperform people who use only one. Why do models make us better thinkers? Models help us to better organize information - to make sense of that fire hose or hairball of data (choose your metaphor) available on the Internet. Models improve our abilities to make accurate forecasts. They help us make better decisions and adopt more effective strategies. They even can improve our ability to design institutions and procedures. In this class, I present a starter kit of models: I start with models of tipping points. I move on to cover models explain the wisdom of crowds, models that show why some countries are rich and some are poor, and models that help unpack the strategic decisions of firm and politicians.\n\nThe models covered in this class provide a foundation for future social science classes, whether they be in economics, political science, business, or sociology. Mastering this material will give you a huge leg up in advanced courses. They also help you in life. Here\u0027s how the course will work. For each model, I present a short, easily digestible overview lecture. Then, I\u0027ll dig deeper. I\u0027ll go into the technical details of the model. Those technical lectures won\u0027t require calculus but be prepared for some algebra. For all the lectures, I\u0027ll offer some questions and we\u0027ll have quizzes and even a final exam. If you decide to do the deep dive, and take all the quizzes and the exam, you\u0027ll receive a Course Certificate. If you just decide to follow along for the introductory lectures to gain some exposure that\u0027s fine too. It\u0027s all free. And it\u0027s all here to help make you a better thinker!","tutor":"Scott E. Page","provider":"Coursera","language":"English","skills":["usa","north america"],"subject":"Sociology","studentsInterested":"14.1k","courseLink":"https://www.coursera.org/learn/model-thinking","classCentralLink":"https://www.class-central.com/course/coursera-model-thinking-317"},{"title":"Game Theory","about":"Popularized by movies such as \"A Beautiful Mind,\" game theory is the mathematical modeling of strategic interaction among rational (and irrational) agents. Beyond what we call `games\u0027 in common language, such as chess, poker, soccer, etc., it includes the modeling of conflict among nations, political campaigns, competition among firms, and trading behavior in markets such as the NYSE. How could you begin to model keyword auctions, and peer to peer file-sharing networks, without accounting for the incentives of the people using them? The course will provide the basics: representing games and strategies, the extensive form (which computer scientists call game trees), Bayesian games (modeling things like auctions), repeated and stochastic games, and more. We\u0027ll include a variety of examples including classic games and a few applications.\n\nYou can find a full syllabus and description of the course here: http://web.stanford.edu/~jacksonm/GTOC-Syllabus.html\n\nThere is also an advanced follow-up course to this one, for people already familiar with game theory: https://www.coursera.org/learn/gametheory2/\n\nYou can find an introductory video here: http://web.stanford.edu/~jacksonm/Intro_Networks.mp4","tutor":"Matthew O. Jackson and Yoav Shoham","provider":"Coursera","language":"English","skills":["canada","usa","north america"],"subject":"Economics","studentsInterested":"1.2k","courseLink":"https://www.coursera.org/learn/game-theory-1","classCentralLink":"https://www.class-central.com/course/coursera-game-theory-308"},{"title":"Introductory AP® Microeconomics","about":"Want to learn how individuals and businesses make the decisions that drive our economy - and use those skills to ace the Microeconomics AP® exam? This is the course for you!\nThis economics course is an introduction to basic microeconomic principles. You will learn how individuals make decisions ranging from what type of goods to buy to how many hours to work, and how firms make decisions ranging from how many workers to hire to what prices to charge. You will study how to evaluate economic outcomes from the perspective of efficiency and fairness, and discuss the proper role of the government in determining these outcomes.\nThis course will cover all material that is required for the Microeconomics AP® exam. It will cover this material through a mix of intuitive explanations, real-world applications, and graphical and mathematical supplements that explore the content in more depth. By the end of the course, not only will you have an understanding of the most important principles of microeconomics, but you’ll be able to use these principles to better understand the workings of the real world around you!\n*Advanced Placement® and AP® are trademarks registered and/or owned by the College Board, which was not involved in the production of, and does not endorse, these offerings.","tutor":"Jonathan Gruber","provider":"edX","language":"English","skills":["mitx"],"subject":"Economics","studentsInterested":"1k","courseLink":"https://www.edx.org/course/introductory-apr-microeconomics-mitx-14-01x","classCentralLink":"https://www.class-central.com/course/edx-introductory-ap-microeconomics-8630"},{"title":"Justice","about":"HarvardX is proud to relaunch this introduction to Justice with new videos and discussion forums in multiple languages!\nTaught by lauded Harvard professor Michael Sandel, Justice explores critical analysis of classical and contemporary theories of justice, including discussion of present-day applications. Topics include affirmative action, income distribution, same-sex marriage, the role of markets, debates about rights (human rights and property rights), arguments for and against equality, dilemmas of loyalty in public and private life. The course invites learners to subject their own views on these controversies to critical examination.\nThe principal readings for the course are texts by Aristotle, John Locke, Immanuel Kant, John Stuart Mill, and John Rawls. Other assigned readings include writings by contemporary philosophers, court cases, and articles about political controversies that raise philosophical questions.\nClosed Captioning and discussion forums are available in Chinese, German, Portuguese, and Spanish.\nHarvardX requires individuals who enroll in its courses on edX to abide by the terms of the edX honor code. HarvardX will take appropriate corrective action in response to violations of the edX honor code, which may include dismissal from the HarvardX course; revocation of any certificates received for the HarvardX course; or other remedies as circumstances warrant. No refunds will be issued in the case of corrective action for such violations. Enrollees who are taking HarvardX courses as part of another program will also be governed by the academic policies of those programs.","tutor":"Michael J. Sandel","provider":"edX","language":"English","skills":["harvardx"],"subject":"Law","studentsInterested":"15.1k","courseLink":"https://www.edx.org/course/justice-harvardx-er22-1x-2","classCentralLink":"https://www.class-central.com/course/edx-justice-610"},{"title":"Psychological First Aid","about":"Learn to provide psychological first aid to people in an emergency by employing the RAPID model: Reflective listening, Assessment of needs, Prioritization, Intervention, and Disposition.\n\nUtilizing the RAPID model (Reflective listening, Assessment of needs, Prioritization, Intervention, and Disposition), this specialized course provides perspectives on injuries and trauma that are beyond those physical in nature. The RAPID model is readily applicable to public health settings, the workplace, the military, faith-based organizations, mass disaster venues, and even the demands of more commonplace critical events, e.g., dealing with the psychological aftermath of accidents, robberies, suicide, homicide, or community violence. In addition, the RAPID model has been found effective in promoting personal and community resilience.\n\nParticipants will increase their abilities to:\n- Discuss key concepts related to PFA\n- Listen reflectively\n- Differentiate benign, non-incapacitating psychological/ behavioral crisis reactions from more severe, potentially incapacitating, crisis reactions\n- Prioritize (triage) psychological/ behavioral crisis reactions\n- Mitigate acute distress and dysfunction, as appropriate\n- Recognize when to facilitate access to further mental health support\n- Practice self-care\n\nDeveloped in collaboration with Johns Hopkins Open Education Lab.","tutor":"George Everly","provider":"Coursera","language":"English","skills":["usa","north america"],"subject":"Psychology","studentsInterested":"4.1k","courseLink":"https://www.coursera.org/learn/psychological-first-aid","classCentralLink":"https://www.class-central.com/course/coursera-psychological-first-aid-2900"},{"title":"Positive Psychology","about":"This course discusses research findings in the field of positive psychology, conducted by Barbara Fredrickson and her colleagues. It also features practical applications of this science that you can put to use immediately to help you live a full and meaningful life.","tutor":"Barbara Fredrickson","provider":"Coursera","language":"English","skills":["usa","north america"],"subject":"Psychology","studentsInterested":"1.4k","courseLink":"https://www.coursera.org/learn/positive-psychology","classCentralLink":"https://www.class-central.com/course/coursera-positive-psychology-2943"},{"title":"Buddhism and Modern Psychology","about":"The Dalai Lama has said that Buddhism and science are deeply compatible and has encouraged Western scholars to critically examine both the meditative practice and Buddhist ideas about the human mind. A number of scientists and philosophers have taken up this challenge. There have been brain scans of meditators and philosophical examinations of Buddhist doctrines. There have even been discussions of Darwin and the Buddha: Do early Buddhist descriptions of the mind, and of the human condition, make particular sense in light of evolutionary psychology?\n\nThis course will examine how Buddhism is faring under this scrutiny. Are neuroscientists starting to understand how meditation “works”? Would such an understanding validate meditation—or might physical explanations of meditation undermine the spiritual significance attributed to it? And how are some of the basic Buddhist claims about the human mind holding up? We’ll pay special attention to some highly counterintuitive doctrines: that the self doesn’t exist, and that much of perceived reality is in some sense illusory. Do these claims, radical as they sound, make a certain kind of sense in light of modern psychology? And what are the implications of all this for how we should live our lives? Can meditation make us not just happier, but better people?","tutor":"Robert Wright","provider":"Coursera","language":"English","skills":["usa","north america"],"subject":"Psychology","studentsInterested":"8.0k","courseLink":"https://www.coursera.org/learn/science-of-meditation","classCentralLink":"https://www.class-central.com/course/coursera-buddhism-and-modern-psychology-1355"},{"title":"Terrorism and Counterterrorism: Comparing Theory and Practice","about":"Terrorism has arguably been one of the defining factors of our age. It frequently makes headlines, threatening or attacking governments, private business and ordinary citizens. And in many parts of the world, it has been one of the most important threats to peace, security and stability. But what does this exactly mean? What is the nature of this threat? Who or what is threatened, how, by whom and why? What can be done about it or how can we at least limit the impact of terrorism and make sure that terrorists do not make headlines and manage to scare us?\n\nThese are just a handful of questions that will be addressed in this course that consists of three parts. First it focuses on the essence of terrorism as an instrument to achieve certain goals, in addition to an exploration of this phenomenon and the difficulties in defining it.\n\nThe second part provides an overview of the state of the art in (counter) terrorism studies. Since ‘9/11’ terrorism studies have grown exponentially, reflecting the rise in perceived threats. But what has academia come up with? What theories, assumptions and conventional wisdom has it produced that could be of help in understanding terrorism and dealing with it? The most interesting results are examined and compared with empirical evidence with the aim to either stress their importance or to debunk them as myths.\n\nThe final part looks into the implications and possibilities for policy making. The course ends with a module specifically designed to address one of today\u0027s most topical issue: the foreign fighter phenomenon.","tutor":"Edwin Bakker","provider":"Coursera","language":"English","skills":["international conflics","terrorism","europe","netherlands"],"subject":"Political Science","studentsInterested":"5.7k","courseLink":"https://www.coursera.org/learn/terrorism","classCentralLink":"https://www.class-central.com/course/coursera-terrorism-and-counterterrorism-comparing-theory-and-practice-701"},{"title":"Miracles of Human Language: An Introduction to Linguistics","about":"Everywhere, every day, everybody uses language. There is no human society, no matter how small or how isolated, which does not employ a language that is rich and diverse. This course introduces you to linguistics, featuring interviews with well-known linguists and with speakers of many different languages. Join us to explore the miracles of human language!\n\nThe Miracles of Human Language introduces you to the many-faceted study of languages, which has amazed humans since the beginning of history. Together with speakers of many other languages around the world, as well as with famous linguists such as Noam Chomsky and Adele Goldberg, you will learn to understand and analyse how your native tongue is at the same time similar and different from many other languages. You will learn the basic concepts of linguistics, get to know some of the key features of big and small languages and get insight into what linguists do.\n\nThis course gives an introduction into the study of languages, the field of linguistics. With the support of the basic linguistic terminology that is offered in the course, you will soon be able to comment both on variety between languages, as well as on a single language’s internal structure. Anyone who wishes to understand how languages work, and how they can give us insight into the human mind is very welcome to join.\n\nThe course is useful if you want to get a fairly quick introduction into linguistics, for instance because you are considering studying it further, or because you are interested in a neighbouring discipline such as psychology, computer science or anthropology. Furthermore, the course will help you develop analytical skills.\n\nIf you are curious to understand how language works and how it gives insight into the human mind, this course is definitely for you!","tutor":"Marc van Oostendorp","provider":"Coursera","language":"English","skills":["europe","netherlands"],"subject":"Sociology","studentsInterested":"8.0k","courseLink":"https://www.coursera.org/learn/human-language","classCentralLink":"https://www.class-central.com/course/coursera-miracles-of-human-language-an-introduction-to-linguistics-2940"},{"title":"Understanding the GDPR","about":"Understand what the GDPR means for you as data subject, controller or processor.\nIn 2018, the General Data Protection Regulation (GDPR), aiming to improve data protection for individuals across the EU, will become directly applicable. Organisations will need to be compliant with the new rules and should act immediately.\nBy developing good knowledge of the GDPR and understanding how it will affect you, you will learn about the first steps for making your organisation compliant and can immediately start taking them. You will explore data subjects’ rights, data controllers’ and processors’ obligations, and enforcement and compliance notions in the context of the Regulation.\nThe course is specifically developed for professionals working for companies, public authorities and bodies, students, and anyone who wishes to know more about data protection and the GDPR, especially those handling personal data.","tutor":"Evgeni Moyakine","provider":"FutureLearn","language":"English","skills":["eu","data protection","regulation","new-moocs-2017"],"subject":"Law","studentsInterested":"144","courseLink":"https://www.futurelearn.com/courses/general-data-protection-regulation","classCentralLink":"https://www.class-central.com/course/futurelearn-understanding-the-gdpr-9403"},{"title":"Introduction to Neuroeconomics: How the Brain Makes Decisions","about":"Economics, psychology, and neuroscience are converging today into a unified discipline of Neuroeconomics with the ultimate aim of creating a single, general theory of human decision-making.\n\nNeuroeconomics provides biologists, economists, psychologists and social scientists with a deeper understanding of how they make their own decisions and how others decide. Neuroscience, when allied with psychology and economics, creates powerful new models to explain why we make decisions. Neurobiological mechanisms of decision-making, decisions under risk, trust and cooperation will be central issues in this course. You will be provided with the most recent evidence from brain-imaging techniques (fMRI, TMS, etc.) and introduced to the explanatory models behind them.\n\nThe course does not require any prior study of economics and neuroscience; however, it might require you to study novel interdisciplinary materials. The course provides an introduction to the methodology, assumptions, and main findings of Neuroeconomics. Our students have different backgrounds; therefore, I have adapted and simplified the course to allow all students to understand the interdisciplinary content. This course will help you to start your progress in the field of Neuroeconomics and to further develop your skills during other more advanced courses and trainings in the future. For some topics, the course will also provide supplementary videos to reveal the opinions of leading experts in the field. Each module provides optional reading material.\n\nThe course structure is as follows: During each video, you will have to answer some relevant questions. Your answers will not affect your final grade. At the end of each module, you must complete a quiz consisting of 15 questions. To pass the course, you must reach a satisfactory standard in all the course modules by completing all graded quizzes and the final exam. In addition to watching video lectures and taking quizzes, you will receive an invitation to join our forum. We plan to join the discussions in the forum on a weekly basis.\n\nWelcome to Neuroeconomics World!","tutor":"Vasily Klucharev","provider":"Coursera","language":"English","skills":["russia"],"subject":"Psychology","studentsInterested":"2.0k","courseLink":"https://www.coursera.org/learn/neuroeconomics","classCentralLink":"https://www.class-central.com/course/coursera-introduction-to-neuroeconomics-how-the-brain-makes-decisions-1387"},{"title":"Introduction to Psychology","about":"This course will highlight the most interesting experiments within the field of psychology, discussing the implications of those studies for our understanding of the human mind and human behavior. We will explore the brain and some of the cognitive abilities it supports like memory, learning, attention, perception and consciousness. We will examine human development - both in terms of growing up and growing old - and will discuss the manner in which the behavior of others affect our own thoughts and behavior. Finally we will discuss various forms of mental illness and the treatments that are used to help those who suffer from them.\n\nThe fact of the matter is that humans routinely do amazing things without appreciating how interesting they are. However, we are also routinely influenced by people and events without always being aware of those influences. By the end of this course you will have gained a much better understanding and appreciation of who you are and how you work. And I can guarantee you that you\u0027ll learn things that you\u0027ll be telling your friends and family about, things that will fundamentally change the way you think of yourself and others. How can you resist that?!","tutor":"Steve Joordens","provider":"Coursera","language":"English","skills":["canada","north america"],"subject":"Psychology","studentsInterested":"10.2k","courseLink":"https://www.coursera.org/learn/introduction-psych","classCentralLink":"https://www.class-central.com/course/coursera-introduction-to-psychology-647"},{"title":"Intro to Psychology","about":"Introduction to Psychology is a journey through all of the major psychological concepts and principles. The knowledge gained from this course will allow students to critically evaluate psychological research and have a more in-depth understanding of human thought and behavior.\n\n\nWhy Take This Course?\nStudents will be able to:\nidentify and analyze the social dimension of society as a context for human life, the processes of social change and social continuity, the role of human agency in those processes, and the forces that engender social cohesion and fragmentation.\nplace contemporary developments in cultural, historical, environmental, and spatial contexts.\nidentify the dynamics of ethnic, cultural, gender/sexual, age-based, class, regional, national, transnational, and global identities and the similarities, differences, linkages, and interactions between them.\nevaluate social science information, draw on different points of view, and formulate applications appropriate to contemporary social issues.\nrecognize the interactions of social institutions, culture, and environment with the behavior of individuals.","tutor":"Susan Snycerski and Greg Feist","provider":"Udacity","language":"English","skills":["usa","north america"],"subject":"Psychology","studentsInterested":"14.6k","courseLink":"https://www.udacity.com/course/intro-to-psychology--ps001","classCentralLink":"https://www.class-central.com/course/udacity-intro-to-psychology-830"},{"title":"English Common Law: Structure and Principles","about":"The Common Law of England and Wales is one of the major global legal traditions. In order to understand the common law, we need to deal with its history, and the development of its characteristic institutions like the jury, judge made law, parliamentary sovereignty and due process. We also need to ask some critical questions. What role does democracy play in the development of the common law? To what extent are human rights central to the modern common law? How does the common law of England and Wales relate to the law of the European Union? Answering these questions will give us insights into the current challenges the law faces and its possible futures.","tutor":"Dame Hazel Genn of UCL","provider":"Coursera","language":"English","skills":["europe","england"],"subject":"Law","studentsInterested":"509","courseLink":"https://www.coursera.org/learn/common-law","classCentralLink":"https://www.class-central.com/course/coursera-english-common-law-structure-and-principles-543"},{"title":"Moral Foundations of Politics","about":"When do governments deserve our allegiance, and when should they be denied it?\n\nThis course explores the main answers that have been given to this question in the modern West. We start with a survey of the major political theories of the Enlightenment: Utilitarianism, Marxism, and the social contract tradition. In each case, we begin with a look at classical formulations, locating them in historical context, but then shift to the contemporary debates as they relate to politics today.\n\nNext, we turn to the rejection of Enlightenment political thinking, again exploring both classical and contemporary formulations. The last part of the course deals with the nature of, and justifications for, democratic politics, and their relations to Enlightenment and Anti-Enlightenment political thinking.\n\nIn addition to exploring theoretical differences among the various authors discussed, considerable attention is devoted to the practical implications of their competing arguments. To this end, we discuss a variety of concrete problems, including debates about economic inequality, affirmative action and the distribution of health care, the limits of state power in the regulation of speech and religion, and difficulties raised by the emerging threat of global environmental decay.","tutor":"Ian Shapiro","provider":"Coursera","language":"English","skills":["usa","north america"],"subject":"Political Science","studentsInterested":"2.8k","courseLink":"https://www.coursera.org/learn/moral-politics","classCentralLink":"https://www.class-central.com/course/coursera-moral-foundations-of-politics-2986"},{"title":"Welcome to Game Theory","about":"This course provides a brief introduction to game theory. Our main goal is to understand the basic ideas behind the key concepts in game theory, such as equilibrium, rationality, and cooperation. The course uses very little mathematics, and it is ideal for those who are looking for a conceptual introduction to game theory.\n\nBusiness competition, political campaigns, the struggle for existence by animals and plants, and so on, can all be regarded as a kind of “game,” in which individuals try to do their best against others. Game theory provides a general framework to describe and analyze how individuals behave in such “strategic” situations.\n\nThis course focuses on the key concepts in game theory, and attempts to outline the informal basic ideas that are often hidden behind mathematical definitions. Game theory has been applied to a number of disciplines, including economics, political science, psychology, sociology, biology, and computer science. Therefore, a warm welcome is extended to audiences from all fields who are interested in what game theory is all about.","tutor":"Michihiro Kandori","provider":"Coursera","language":"English","skills":["japan","asia"],"subject":"Economics","studentsInterested":"3.9k","courseLink":"https://www.coursera.org/learn/game-theory-introduction","classCentralLink":"https://www.class-central.com/course/coursera-welcome-to-game-theory-2883"},{"title":"An Introduction to American Law","about":"This course will give you a glimpse into six different areas of American law: Tort Law, Contract Law, Property, Constitutional Law, Criminal Law, and Civil Procedure. You will gain insight into the complexities and dilemmas that arise from the application of law in different settings, and what is distinctive about American approaches.","tutor":"Anita Allen, Theodore Ruger, Tess Wilkinson-Ryan, Tobias Wolff, Shyam Balganesh and Stephen Morse","provider":"Coursera","language":"English","skills":["usa","north america"],"subject":"Law","studentsInterested":"6.0k","courseLink":"https://www.coursera.org/learn/american-law","classCentralLink":"https://www.class-central.com/course/coursera-an-introduction-to-american-law-2872"},{"title":"The Power of Macroeconomics: Economic Principles in the Real World","about":"In this course, you will learn all of the major principles of macroeconomics normally taught in a quarter or semester course to college undergraduates or MBA students.\n\nPerhaps more importantly, you will also learn how to apply these principles to a wide variety of situations in both your personal and professional lives. In this way, the Power of Macroeconomics will help you prosper in an increasingly competitive and globalized environment.\n\nThis course is also available in Portuguese. To join the fully translated Portuguese version, visit this page: https://www.coursera.org/learn/macroeconomia-pt/","tutor":"Peter Navarro","provider":"Coursera","language":"English","skills":["usa","north america"],"subject":"Economics","studentsInterested":"559","courseLink":"https://www.coursera.org/learn/principles-of-macroeconomics","classCentralLink":"https://www.class-central.com/course/coursera-the-power-of-macroeconomics-economic-principles-in-the-real-world-1050"},{"title":"The Psychology of Criminal Justice","about":"This course systematically explores the effectiveness of the law and justice system from a psychological perspective. By experiencing a fictional case first hand, you will learn about the psychology of law and some of the misconceptions commonly held about criminal justice. ","tutor":"Mark Horswill and Blake McKimmie","provider":"edX","language":"English","skills":["uqx"],"subject":"Psychology","studentsInterested":"10.4k","courseLink":"https://www.edx.org/course/psychology-criminal-justice-uqx-crime101x-4","classCentralLink":"https://www.class-central.com/course/edx-the-psychology-of-criminal-justice-2021"},{"title":"Introduction to Human Behavioral Genetics","about":"Behavioral genetic methodologies from twin and adoption studies through DNA analysis will be described and applied to address longstanding questions about the origins of individual differences in behavioral traits.","tutor":"Matt McGue","provider":"Coursera","language":"English","skills":["genetics","behavioral genetics","genes \u0026 behavior","usa","north america"],"subject":"Psychology","studentsInterested":"9.0k","courseLink":"https://www.coursera.org/learn/behavioralgenetics","classCentralLink":"https://www.class-central.com/course/coursera-introduction-to-human-behavioral-genetics-1765"},{"title":"Game Theory II: Advanced Applications","about":"Popularized by movies such as \"A Beautiful Mind\", game theory is the mathematical modeling of strategic interaction among rational (and irrational) agents. Over four weeks of lectures, this advanced course considers how to design interactions between agents in order to achieve good social outcomes. Three main topics are covered: social choice theory (i.e., collective decision making and voting systems), mechanism design, and auctions.\n\nIn the first week we consider the problem of aggregating different agents\u0027 preferences, discussing voting rules and the challenges faced in collective decision making. We present some of the most important theoretical results in the area: notably, Arrow\u0027s Theorem, which proves that there is no \"perfect\" voting system, and also the Gibbard-Satterthwaite and Muller-Satterthwaite Theorems. We move on to consider the problem of making collective decisions when agents are self interested and can strategically misreport their preferences. We explain \"mechanism design\" -- a broad framework for designing interactions between self-interested agents -- and give some key theoretical results. Our third week focuses on the problem of designing mechanisms to maximize aggregate happiness across agents, and presents the powerful family of Vickrey-Clarke-Groves mechanisms. The course wraps up with a fourth week that considers the problem of allocating scarce resources among self-interested agents, and that provides an introduction to auction theory.\n\nYou can find a full syllabus and description of the course here: http://web.stanford.edu/~jacksonm/GTOC-II-Syllabus.html\n\nThere is also a predecessor course to this one, for those who want to learn or remind themselves of the basic concepts of game theory: https://www.coursera.org/learn/game-theory-1\n\nAn intro video can be found here: http://web.stanford.edu/~jacksonm/Game-Theory-2-Intro.mp4","tutor":"Matthew Jackson, Kevin Leyton-Brown and Yoav Shoham","provider":"Coursera","language":"English","skills":["usa","north america"],"subject":"Economics","studentsInterested":"2.4k","courseLink":"https://www.coursera.org/learn/game-theory-2","classCentralLink":"https://www.class-central.com/course/coursera-game-theory-ii-advanced-applications-1469"},{"title":"Understanding Research Methods","about":"This MOOC is about demystifying research and research methods. It will outline the fundamentals of doing research, aimed primarily, but not exclusively, at the postgraduate level. It places the student experience at the centre of our endeavours by engaging learners in a range of robust and challenging discussions and exercises befitting SOAS, University of London\u0027s status as a research-intensive university and its rich research heritage.\n\nThe course will appeal to those of you who require an understanding of research approaches and skills, and importantly an ability to deploy them in your studies or in your professional lives. In particular, this course will aid those of you who have to conduct research as part of your postgraduate studies but do not perhaps have access to research methods courses, or for those of you who feel you would like additional support for self-improvement. No prior knowledge or experience in research is required to take this course and as such, the course is for everyone.\n\nThis MOOC draws on a wealth of existing course material developed to support research training across SOAS, University of London and particularly drawing from the Centre for International Studies and Diplomacy (CISD). In 2015, the course was nominated for the prestigious Guardian University Award for its innovative approach to online learning.\n\nParticipation in or completion of this online course will not confer academic credit for University of London programmes","tutor":"J Simon Rofe and Yenn Lee","provider":"Coursera","language":"English","skills":["europe","england"],"subject":"Social Sciences","studentsInterested":"4.3k","courseLink":"https://www.coursera.org/learn/research-methods","classCentralLink":"https://www.class-central.com/course/coursera-understanding-research-methods-1767"},{"title":"Classical Sociological Theory","about":"This Massive Open Online Course (MOOC) will offer the participants an introduction into the most important classical sociological readings between the 18th and 20th century. Highly influential social science scholars, such as Karl Marx, Max Weber and Emile Durkheim, will be discussed during 8 sessions. Combined with small tests, based on the video’s and recommended readings, the participants will be encouraged to dive deeply into the complex texts and get familiar with classical sociological concepts that are still very relevant today.","tutor":"Don Weenink and Bart van Heerikhuizen","provider":"Coursera","language":"English","skills":["europe","karl marx","max weber","emile durkheim","classical sociology","netherlands"],"subject":"Sociology","studentsInterested":"3.8k","courseLink":"https://www.coursera.org/learn/classical-sociological-theory","classCentralLink":"https://www.class-central.com/course/coursera-classical-sociological-theory-4298"},{"title":"Paradoxes of War","about":"The Paradoxes of War teaches us to understand that war is not only a normal part of human existence, but is arguably one of the most important factors in making us who we are. Through this course, I hope that you will come to appreciate that war is both a natural expression of common human emotions and interactions and a constitutive part of how we cohere as groups. That is, war is paradoxically an expression of our basest animal nature and the exemplar of our most vaunted and valued civilized virtues. You will learn some basic military history and sociology in this course as a lens for the more important purpose of seeing the broader social themes and issues related to war. I want you to both learn about war, but more importantly, use it as way of understanding your everyday social world. So, for example, the discussion of war and gender will serve to start you thinking about how expectations of masculinity are created and our discussion of nationalism will make clear how easy “us-them” dichotomies can be established and (ab)used. I will suggest some readings for you to complement the class and assign some activities through which you will be able to apply the theoretical insights from the course to your observations of everyday life. At the end of the course, you will start to see war everywhere and come to appreciate how much it defines our life.","tutor":"Miguel Centeno","provider":"Coursera","language":"English","skills":["usa","north america"],"subject":"Sociology","studentsInterested":"2.1k","courseLink":"https://www.coursera.org/learn/war","classCentralLink":"https://www.class-central.com/course/coursera-paradoxes-of-war-1361"},{"title":"Introduction to International Criminal Law","about":"-- About the Course --\n\nFrom the Nuremberg trial to the case against Saddam Hussein, from the prosecution of Al-Qaeda terrorists to the trial of Somali pirates – no area of law is as important to world peace and security as international criminal law. Taught by one of the world’s leading experts in the field, this course will educate students about the fundamentals of international criminal law and policy. We will explore the contours of international crimes such as genocide, war crimes, terrorism, and piracy. We will examine unique modes of international criminal liability and specialized defenses. And we will delve into the challenges of obtaining custody of the accused and maintaining control of the courtroom.\n\n-- Course Syllabus --\n\nThis course comprises eight units (or \"modules\"). Each will include an assigned reading, typically an article or book chapter, as well as a simulation designed to bring the readings to life.\n\nI will also offer video lectures on each of the topics, accompanied by slides. In addition, there will be online role-play exercises and debates, enabling the students to share their own insights.\n\nThe order of class sessions will be:\n\n(1) History: From Nuremberg to The Hague\n\n(2) International Crimes Part 1: War Crimes, Genocide, Crimes against Humanity, and Torture\n\n(3) International Crimes Part 2: Terrorism and Piracy\n\n(4) Special modes of liability: command responsibility, co-perpetration, and incitement\n\n(5) Special defenses: insanity, obedience to orders, duress, and head of state immunity\n\n(6) Gaining custody of the accused: extradition, luring, abduction, and targeted killing\n\n(7) Pre-Trial Issues: plea bargaining, self-representation, and exclusion of torture evidence\n\n(8) Maintaining control of the courtroom\n\n-- Recommended Background --\n\nYou don’t have to be a lawyer and there are no prerequisites for this course. However, the course will be conducted at the level expected of advanced undergraduate students. Therefore, for all participants, reading and writing comfortably in English at the undergraduate college level is desirable.\n\n-- Suggested Readings --\n\nStudents should read the assigned online materials for each unit in advance of the class session.\n\nIn addition, students are invited to subscribe to “War Crimes Prosecution Watch,” a free bi-weekly e-newsletter that summarizes the latest developments in the field of international criminal law.\n\n-- Course Format --\n\nThis course is made up of eight content units. Each unit is based on an online reading assignment, a video lecture of about one hour in length, and one or more role play exercises to stimulate on-line discussion. The course also offers in-video enrichment quizzes (ungraded) for each unit, a ten question multiple choice midterm diagnostics exam (ungraded), and a ten question True/False Final Exam.\n\n-- FAQ--\n\nHow will this course be graded?\n\nThis course is graded on completion. In order to complete the course each student must: (1) finish each module (or “lesson”); (2) write at least one essay response of 200 words or more for at least one simulation throughout the course; and (3) get a score of 6 out of 10 or better on the Final Exam.\n\nWhat resources will I need for this course?\n\nFor this course, all you need is an Internet connection, and the time to read and discuss the exciting materials available online.\n\nWhat is the coolest thing about this course?\n\nThe topics we will be discussing are ripped from the headlines. The topics are often controversial and thought-provoking, and always exciting.","tutor":"Michael Scharf","provider":"Coursera","language":"English","skills":["usa","north america"],"subject":"Law","studentsInterested":"3.3k","courseLink":"https://www.coursera.org/learn/international-criminal-law","classCentralLink":"https://www.class-central.com/course/coursera-introduction-to-international-criminal-law-712"},{"title":"EU policy and implementation: making Europe work!","about":"People have become more critical of European policy and often seem to prefer local policy solutions in response to globalisation problems. How do you experience EU policy? Does it help? And if not, how can we change this? In this course, we learn how EU policy is made, and how policy is transferred to member states and implemented by various authorities, including regional and local governments. We discuss the challenges of the European multi-level governance structure. We also focus on the main causes of policy failure or success. On this journey, we focus on actual policy and present the views of various experts: how easy is it to establish yourself in another EU-country? How do governments make sure that the air you breathe is clean? And who is responsible?\n\nYou will be able to do research together in your own local setting. Research on implementation in which you can make comparisons between different countries or areas. If you live outside the EU, this is not a problem. We have developed assignments in such a way that you can do research in your area and compare your findings with others.\n\nSo, are you curious? Please join: \u0027EU policy and implementation: making Europe work\u0027. Watch our trailer video at https://www.youtube.com/watch?v\u003dn3nSN9R3VR4","tutor":"Bernard Steunenberg","provider":"Coursera","language":"English","skills":["europe","netherlands","new-moocs-2017"],"subject":"Political Science","studentsInterested":"557","courseLink":"https://www.coursera.org/learn/eu-making-europe-work","classCentralLink":"https://www.class-central.com/course/coursera-eu-policy-and-implementation-making-europe-work-7408"},{"title":"Psychology of Popularity","about":"The level of popularity you experienced in childhood and adolescence is still affecting you today in ways that you may not even realize. Learn about how psychologists study popularity and how these same concepts can be used in adulthood to be more successful at work, become better parents, and have a happier life.","tutor":"Mitch Prinstein","provider":"Coursera","language":"English","skills":["psychology","usa","north america"],"subject":"Psychology","studentsInterested":"2.0k","courseLink":"https://www.coursera.org/learn/popularity","classCentralLink":"https://www.class-central.com/course/coursera-psychology-of-popularity-3541"},{"title":"Introduction to Environmental Law and Policy","about":"Environmental law may be the one institution standing between us and planetary exhaustion. It is also an institution that needs to be reconciled with human liberty and economic aspirations. This course considers these issues and provides a tour though existing legal regimes governing pollution, water law, endangered species, toxic substances, environmental impact analyses, and environmental risk.","tutor":"Don Hornstein","provider":"Coursera","language":"English","skills":["usa","north america"],"subject":"Law","studentsInterested":"3.9k","courseLink":"https://www.coursera.org/learn/environmental-law","classCentralLink":"https://www.class-central.com/course/coursera-introduction-to-environmental-law-and-policy-725"},{"title":"Rethinking International Tax Law","about":"In recent years, the international tax planning strategies of multinationals have become a source of – often heated – debate. This course provides learners with the tools to become fully informed participants in the debate by explaining the foundations and practice of international tax law as well as addressing current developments and the ethical aspects of tax planning.","tutor":"Sjoerd Douma, Frank Engelen, Kees Raad and Stefano Simontacchi","provider":"Coursera","language":"English","skills":["europe","netherlands"],"subject":"Law","studentsInterested":"2.6k","courseLink":"https://www.coursera.org/learn/international-taxation","classCentralLink":"https://www.class-central.com/course/coursera-rethinking-international-tax-law-3286"},{"title":"Understanding Memory: Explaining the Psychology of Memory through Movies","about":"Welcome to Understanding Memory. Someone once said that memory is fascinating because sometimes we forget what we want to remember, sometimes we remember what we want to forget, and sometimes we remember events that never happened or never happened the way we remember them. I want to show you how memory works, why it sometimes fails, and what we can do to enhance it. Based on my recent book – Memory and Movies: What Films Can Teach Us About Memory (MIT Press, 2015) – I will provide an introduction to the scientific study of human memory by focusing on a select group of topics that hold widespread appeal.\n\nTo facilitate your understanding, I will use clips from numerous films to illustrate different aspects of memory – describing what has been learned about memory in a nontechnical way for people with no prior background in psychology. Many of us love watching movies because they offer an unparalleled opportunity for entertainment, even if entertaining films are not always scientifically accurate. Still, I believe that we can learn a lot about memory from popular films, if we watch them with an educated eye. Welcome once more. I am looking forward to showing you what movies can teach us about memory.\n\nJohn Seamon\n\nProfessor of Psychology Emeritus\n\nWesleyan University","tutor":"John Seamon","provider":"Coursera","language":"English","skills":["human memory","usa","north america"],"subject":"Psychology","studentsInterested":"586","courseLink":"https://www.coursera.org/learn/memory-and-movies","classCentralLink":"https://www.class-central.com/course/coursera-understanding-memory-explaining-the-psychology-of-memory-through-movies-5254"},{"title":"Questionnaire Design for Social Surveys","about":"This course will cover the basic elements of designing and evaluating questionnaires. We will review the process of responding to questions, challenges and options for asking questions about behavioral frequencies, practical techniques for evaluating questions, mode specific questionnaire characteristics, and review methods of standardized and conversational interviewing.","tutor":"Frederick Conrad and Frauke Kreuter","provider":"Coursera","language":"English","skills":["survey design","market research","quantitative market research","questionnaire design","research surveys","usa","north america"],"subject":"Sociology","studentsInterested":"444","courseLink":"https://www.coursera.org/learn/questionnaire-design","classCentralLink":"https://www.class-central.com/course/coursera-questionnaire-design-for-social-surveys-2163"},{"title":"Deciphering Secrets: Unlocking the Manuscripts of Medieval Toledo (Spain)","about":"This course evaluates the medieval history of Toledo from the reign of King Alfonso “The Wise” (1252-1284) until the creation of the blood purity statutes in the 1450s.\nThis local history will concentrate on the relations of Jews, Old Christians, and converts to Christianity (conversos). We will study King Alfonso X’s efforts to characterize himself as the “king of three religions” via his legal codices, the creation of the Cantigas de Santa María, and his intellectual endeavor known as the Toledo School of Translators.\nWe evaluate the robust Jewish and converso noble families of the city and appreciate their intellectual, religious, and economic contributions to Castilian life. We will bear witness to the rise of anti-Jewish blood purity statutes, the creation of the Inquisition, and the expulsion of the Jews. We will virtually-tour the Cathedral of Toledo, El Transito Synagogue, Santa Maria la Blanca Synagogue, and several of its neighborhoods.\nWe also will study and transcribe manuscripts from the municipal, cathedral, and national historic nobility archives to make new scholarly breakthroughs.\nNo knowledge of Spanish is needed to participate in the course or in our transcription efforts.","tutor":"Roger L. Martínez-Dávila","provider":"edX","language":"English","skills":["uc3mx"],"subject":"Anthropology","studentsInterested":"325","courseLink":"https://www.edx.org/course/deciphering-secrets-unlocking-uc3mx-hga-2-2x","classCentralLink":"https://www.class-central.com/course/edx-deciphering-secrets-unlocking-the-manuscripts-of-medieval-toledo-spain-8090"},{"title":"Social and Economic Networks: Models and Analysis","about":"Learn how to model social and economic networks and their impact on human behavior. How do networks form, why do they exhibit certain patterns, and how does their structure impact diffusion, learning, and other behaviors? We will bring together models and techniques from economics, sociology, math, physics, statistics and computer science to answer these questions.\n\nThe course begins with some empirical background on social and economic networks, and an overview of concepts used to describe and measure networks. Next, we will cover a set of models of how networks form, including random network models as well as strategic formation models, and some hybrids. We will then discuss a series of models of how networks impact behavior, including contagion, diffusion, learning, and peer influences.\n\nYou can find a more detailed syllabus here: http://web.stanford.edu/~jacksonm/Networks-Online-Syllabus.pdf\n\nYou can find a short introductory videao here: http://web.stanford.edu/~jacksonm/Intro_Networks.mp4","tutor":"Matthew O. Jackson","provider":"Coursera","language":"English","skills":["usa","north america"],"subject":"Economics","studentsInterested":"4.2k","courseLink":"https://www.coursera.org/learn/social-economic-networks","classCentralLink":"https://www.class-central.com/course/coursera-social-and-economic-networks-models-and-analysis-744"},{"title":"Principles of Obesity Economics","about":"Economics motivates consumer behavior based on preferences, relative prices, and time and money constraints.  Economics motivates the role for government based on market failure.  Obesity has been deemed a critical public health problem.  This course explores how consumer choices lead to individuals being different weights and discusses whether there is an economic rationale for government intervention in the markets most closely related to food and activity choices. \n\nCourse Objectives\nDefine the concept of consumer sovereignty \nDescribe how consumers are thought to make choices based on a combination of preferences, relatively prices, and time and money constraints \nDescribe economic motivations for government action in markets \nConsider arguments regarding the appropriateness of a government role in markets that are related to obesity in adults and children","tutor":"Kevin Frick","provider":"Coursera","language":"English","skills":["usa","north america"],"subject":"Economics","studentsInterested":"140","courseLink":"https://www.coursera.org/course/obesityecon","classCentralLink":"https://www.class-central.com/course/coursera-principles-of-obesity-economics-387"},{"title":"Terrorism and Counterterrorism","about":"Terrorism has gone from a persistent yet marginal security concern to one of the most important security problems of our day. There are few countries that do not suffer from some form of terrorism. Though many attempts at terrorism fail, some groups wage lengthy and bloody campaigns and, in exceptional cases, kill hundreds or even thousands in pursuit of their ends.\nThis course on terrorism will explore the nuances involved in defining terrorism, the nature of Al Qaeda, Hamas, the Islamic State, and other important groups, the effectiveness of different counterterrorism tools, terrorist recruiting, counterterrorism and the rule of law, the political context in South Asia and the Middle East, and the terrorist use of technology.\nFor those interested in an abbreviated version of this course, the 3-section course Terrorism and Counterterrorism: An Introduction is available here.","tutor":"Jonathan Brown and Daniel Byman","provider":"edX","language":"English","skills":["georgetownx"],"subject":"Political Science","studentsInterested":"3.2k","courseLink":"https://www.edx.org/course/terrorism-counterterrorism-georgetownx-guix-501-03x-0","classCentralLink":"https://www.class-central.com/course/edx-terrorism-and-counterterrorism-1566"},{"title":"Anthropology of Current World Issues","about":"This course will allow you to better understand the world around you through utilising the anthropological lens. You will learn about the way in which anthropology as a discipline can shed new perspectives on current world issues, from indigeneity to migration and material culture.\nWe want to challenge you to reflect on your own perspective when thinking about these issues, how you see the world and how we all engage with difference and sameness on a daily basis.\nWe will interview notable anthropologists and follow some around the world and into their field to explore the issues, the people they work with and their place in the world.","tutor":"Gerhard Hoffstaedter","provider":"edX","language":"English","skills":["uqx"],"subject":"Anthropology","studentsInterested":"475","courseLink":"https://www.edx.org/course/anthropology-current-world-issues-uqx-world101x-4","classCentralLink":"https://www.class-central.com/course/edx-anthropology-of-current-world-issues-1928"},{"title":"America\u0027s Written Constitution","about":"An introduction to the main themes of the American Constitution—popular sovereignty, separation of powers, federalism, and rights.","tutor":"Akhil Amar","provider":"Coursera","language":"English","skills":["usa","north america"],"subject":"Law","studentsInterested":"1.6k","courseLink":"https://www.coursera.org/learn/written-constitution","classCentralLink":"https://www.class-central.com/course/coursera-america-s-written-constitution-2677"},{"title":"The Science of Happiness","about":"\"A free eight-week Science of Happiness course that will offer practical, research-backed tips on living a happy and meaningful life.\" - The Huffington Post\nWe all want to be happy, and there are countless ideas about what happiness is and how we can get some. But not many of those ideas are based on science. That’s where this course comes in.\n“The Science of Happiness” is the first MOOC to teach the ground-breaking science of positive psychology, which explores the roots of a happy and meaningful life. Students will engage with some of the most provocative and practical lessons from this science, discovering how cutting-edge research can be applied to their own lives. Created by UC Berkeley’s Greater Good Science Center, the course will zero in on a fundamental finding from positive psychology: that happiness is inextricably linked to having strong social connections and contributing to something bigger than yourself—the greater good. Students will learn about the cross-disciplinary research supporting this view, spanning the fields of psychology, neuroscience, evolutionary biology, and beyond.\nWhat’s more, “The Science of Happiness” offers students practical strategies for tapping into and nurturing their own happiness, including trying several research-backed activities that foster social and emotional well-being, and exploring how their own happiness changes along the way.\nThe course’s co-instructors, Dacher Keltner and Emiliana Simon-Thomas, are not only leading authorities on positive psychology but also gifted teachers skilled at making science fun and personal. They’ll be joined by world-renowned experts discussing themes like empathy, mindfulness, and gratitude—experts including Barbara Fredrickson, Paul Ekman, Sonja Lyubomirsky, and Jon Kabat-Zinn. Health professionals who register can earn continuing education units for their participation.","tutor":"Emiliana Simon-Thomas and Dacher Keltner","provider":"edX","language":"English","skills":["berkeleyx"],"subject":"Psychology","studentsInterested":"7.8k","courseLink":"https://www.edx.org/course/science-happiness-uc-berkeleyx-gg101x-6","classCentralLink":"https://www.class-central.com/course/edx-the-science-of-happiness-1781"},{"title":"Introduction to Psychology","about":"Psychology is the academic and applied study of the human mind and behavior. Perhaps there are no more salient topics in the information age and the global economy than a comprehensive understanding of how learning takes place and what predicts and determines human behavior. The course is a primer, meant to provide substantive content through which to understand the human condition and to inspire students to continue their learning and growth.\n \nStudents interested in the study of psychology are interested in why people do, say and think what they do. They have questions about how learning takes place, how genetics dictate certain traits but not others, how memories are formed, where to draw the line between normality and disorder, whether a damaged brain can regain function and the predictors of addiction.\n \nThrough this introductory course, students will have the opportunity to understand the science of psychology and how psychologists measure mental function and behavior and how the results are reported. They will better understand perception and consciousness and the mysteries of sleep and dreams. Through child development, they will understand how the brain is ready for learning and pre-wired for language. Motivation, cognition and personality will be analyzed through the lens of past and current psychological thought. Students will understand the statistical reality of the normal distribution and how that is relevant to most traits. They will review new research on the plasticity of the brain and consider whether intelligence is fixed or flexible. Lastly, the array of disorders and dysfunction will be analyzed and discussed and the line between normal and abnormal will be considered.","tutor":"Jeneen Graham","provider":"edX","language":"English","skills":["st. margaret’s episcopal school"],"subject":"Psychology","studentsInterested":"697","courseLink":"https://www.edx.org/course/introduction-psychology-st-margarets-episcopal-school-psych101x-0","classCentralLink":"https://www.class-central.com/course/edx-introduction-to-psychology-2520"},{"title":"Ignorance! | 无知！","about":"Ignorance! provides a comprehensive framework for understanding how people think about unknowns, how they deal with them, and even how certain kinds of ignorance are enshrined in cultures and social institutions. We’ll be taking you on a tour through ignorance in all its varieties and guises. Ignorance is everyone’s business. Ignorance is relevant to every discipline and profession, and to everyday life, both at work and at play.\nNo matter what domain you study or work in, this course will have something to offer to you.\nWe will explore questions about ignorance such as the following: Where does ignorance come from? How do we impose it on each other, and even on ourselves? And why? We usually think about ignorance as a bad thing, but when can it be preferable not to know something? What uses do people have for ignorance? What roles does ignorance play in social interaction, group relations, institutions, and law? Can ignorance sometimes be a virtue? When can ignorance be good or bad for us? How can we harness the unknown for learning, discovery, and creativity? How can we make good decisions under ignorance?\nYour understanding of ignorance will be expanded via online games, discussion forums, opportunities to find out what your own “ignorance profile” is, additional readings, and Wiki materials. There also will be discussion threads specifically for those of you who want to apply understandings about ignorance to complex social and environmental problems. Knowing more about ignorance will help you to manage it and work with it. It also will help you in dealing with the unexpected, with complex problems, and even wicked problems.\n“无知！”这门课提供了一个全面的框架以了解人们如何思考未知事物，如何处理未知事物，以及某些无知如何被纳入文化和社会制度。 我们将带你浏览所有种类和伪装下的无知。 无知和每个人都有关，与每一门学科、职业以及日常生活的工作和娱乐都息息相关。","tutor":"Gabriele Bammer and Michael Smithson","provider":"edX","language":"English","skills":["anux"],"subject":"Sociology","studentsInterested":"137","courseLink":"https://www.edx.org/course/ignorance-wu-zhi-anux-igno101x","classCentralLink":"https://www.class-central.com/course/edx-ignorance--3599"},{"title":"Contract Law: From Trust to Promise to Contract","about":"Learn about contracts from Harvard Law Professor Charles Fried, one of the world’s leading authorities on contract law. Contracts are promises that the law will enforce. But when will the law refuse to honor a promise? What happens when one party does not hold to their part of the deal? This version of the course adds new units on Interpretation, Agency, Partnerships, Corporations, and Government Regulation.\nWe are exposed to contracts in all areas of our life — agreeing to terms when downloading a new computer program, hiring a contractor to repair a leaking roof, and even ordering a meal at a restaurant. Knowing the principles of contracts is not just a skill needed by lawyers, it illuminates for everyone a crucial institution that we use all the time and generally take for granted.\nThis contract law course, with new materials and updated case examples, is designed to introduce the range of issues that arise when entering and enforcing contracts. It will provide an introduction to what a contract is and also analyze the purpose and significance of contracts. Then, it will discuss the intent to create legal relations, legality and morality, and the distinction between gifts and bargains. The course also investigates common pitfalls: one-sided promises, mistake, fraud, and frustration. With the knowledge of what makes contracts and how they can go wrong, Professor Fried will discuss remedies and specific performance. Finally, Professor Fried will introduce how contracts can create rights for third parties.\nThe course’s instructor, Charles Fried, has been teaching at Harvard Law School for more than 50 years and has written extensively on contracts. Not only is Professor Fried a leading authority on contract law, but he also utilizes a story-telling approach to explaining the topic, which creates a unique and interesting class experience.","tutor":"Charles Fried","provider":"edX","language":"English","skills":["harvardx"],"subject":"Law","studentsInterested":"2.4k","courseLink":"https://www.edx.org/course/contract-law-from-trust-to-promise-to-contract","classCentralLink":"https://www.class-central.com/course/edx-contract-law-from-trust-to-promise-to-contract-2633"},{"title":"Hadrian\u0027s Wall: Life on the Roman Frontier","about":"##\nExplore the archaeology of the most heavily fortified frontier in the Roman Empire, its people and their lives.\nHadrian’s Wall stretches over 73 miles (117 km), from coast to coast in what is now Northern England. The Wall, complemented by a sophisticated system of outposts and coastal watch stations, offers a remarkable glimpse of ancient society. In addition to housing one of the largest concentrations of Roman soldiers anywhere in the Empire’s provinces, Hadrian’s frontier system was home to an incredibly cosmopolitan array of civilians.\nThis six week course offers a comprehensive introduction to Hadrian’s Wall and its people and raises fascinating issues concerning colonisation, cultural transformation, immigration, integration and imperialism. We will explore life in the region before the construction of the Wall, the arrival of the Roman army and its impact on the local population. Detailed case studies will consider the different features of the Wall and its surroundings, considering the way in which the frontier system evolved throughout the Roman period. The changing face of both the Roman army and indigenous populations is richly illuminated through archaeological finds and reconstructions. To appreciate the range and character of native people, soldiers’ families, slaves, merchants and migrants, we will examine their homes, dress, diet, rituals and religious beliefs.\nDrawing on the very latest research, we will investigate how archaeologists interpret evidence, considering:\nthe factors that determine the survival of evidence\nthe different methods of archaeological prospection used to detect settlement locations and better understand their organisation","tutor":"Ian Haynes","provider":"FutureLearn","language":"English","skills":["europe","roman empire","roman history","hadrian","uk"],"subject":"Anthropology","studentsInterested":"182","courseLink":"https://www.futurelearn.com/courses/hadrians-wall","classCentralLink":"https://www.class-central.com/course/futurelearn-hadrian-s-wall-life-on-the-roman-frontier-2124"},{"title":"Microeconomics: The Power of Markets","about":"We make economics decisions every day: what to buy, whether to work or play, what to study. We respond to markets all the time: prices influence our decisions, markets signal where to put effort, they direct firms to produce certain goods over others. Economics is all around us.\n\nThis course is an introduction to the microeconomic theory of markets: why we have them, how they work, what they accomplish. We will start with the concept of scarcity and how specialization according to comparative advantage helps us achieve more than we could alone. Next we model a marked using the tools of Supply and Demand and learn what well working markets accomplish and what their limit are. We end by exploring the impact of government intervention on perfect markets. Examples are taken from everyday life, from goods and services that we all purchase and use. We will apply the theory to current events and policy debates through weekly exercises. These will empower you to be an educated, critical thinker who can understand, analyze and evaluate market outcomes.","tutor":"Rebecca Stein","provider":"Coursera","language":"English","skills":["usa","north america"],"subject":"Economics","studentsInterested":"713","courseLink":"https://www.coursera.org/learn/microeconomics-part1","classCentralLink":"https://www.class-central.com/course/coursera-microeconomics-the-power-of-markets-624"},{"title":"Introduction to Key Constitutional Concepts and Supreme Court Cases","about":"This course offers an introduction to the U.S. Constitution and landmark Supreme Court cases interpreting it. It explores the Constitution’s origins, its amendment over the years, and methods of constitutional interpretation. Topics include the nature and structure of the federal government, the powers of the federal government, and individual rights.","tutor":"Kermit Roosevelt","provider":"Coursera","language":"English","skills":["u.s. constitution","constitutional law","usa","north america"],"subject":"Law","studentsInterested":"2.5k","courseLink":"https://www.coursera.org/learn/constitution","classCentralLink":"https://www.class-central.com/course/coursera-introduction-to-key-constitutional-concepts-and-supreme-court-cases-2082"},{"title":"Metaliteracy: Empowering Yourself in a Connected World","about":"This course prepares learners to empower themselves through metaliteracy in a connected world. Metaliteracy promotes critical thinking and self-reflection to consume, create, and share information with others. Participants will learn how to critically navigate, evaluate and produce information in open, online, and social media settings.\n\nThis course features videos, readings, discussions, and learning activities that promote metaliteracy competencies. Participants will become active and collaborative digital citizens who locate and evaluate information in 21st century social environments, including Massive Open Online Courses (MOOCs), while making contributions to these spaces as self-reflective and empowered metaliterate learners.\n\nMetaliteracy is an empowering idea because it encourages individuals to be active and self-reflective participants in today’s expanding information environments. This approach is relevant to anyone who wants to be an informed consumer of digital information and active contributor to social settings mediated by technology. It is invaluable to learners in a variety of fields and disciplines that involve evaluating and managing information. Metaliteracy is also relevant to anyone in the workplace who wants to improve the ability to search, evaluate, produce, and distribute information. This approach supports college students who want to expand their critical thinking capabilities through research, writing, and adaptation to emerging technologies. It is also relevant to anyone taking a MOOC or pursuing social learning opportunities because it empowers users to be active and engaged digital citizens.","tutor":"Thomas Mackey, Trudi Jacobson, Kathleen Stone, Kelsey O\u0027Brien, Jenna Pitera, Allison Hosier, Michele Forte and Amy McQuigge","provider":"Coursera","language":"English","skills":["usa","north america"],"subject":"Sociology","studentsInterested":"194","courseLink":"https://www.coursera.org/learn/metaliteracy","classCentralLink":"https://www.class-central.com/course/coursera-metaliteracy-empowering-yourself-in-a-connected-world-3016"},{"title":"Understanding Financial Markets","about":"In this course, you will learn what the main financial markets and their characteristics are as well as how they are linked to the economy.\n\nOur very diversified team of experts will start by teaching you how the price of stocks and bonds are computed and why they move while you will become increasingly aware of the notion of risk and why it matters when measuring an investment\u0027s performance. The focus will then move to less popular markets such as gold, emerging markets, real estate, hedge funds and private markets. These will be analyzed with an emphasis on their particular risks and return opportunities as well as how they can help in building efficient portfolios. Finally, the policies of central banks and their impact on financial markets will be presented to you along with the link between the economy and the price of financial assets.\n\nAll along these different steps, experts from UBS, our corporate partner, will show you how the concepts you just acquired are effectively applied in a leading global bank. This focus on practicality means you will not only understand what is going on in global financial markets but also start to figure out how you can use them to achieve financial goals, be it a client\u0027s or your own.","tutor":"Martin Hoesli, Jonas Demaurex, Ines Chaieb, Michel Girardin, Olivier Scaillet, Philip Valta and Rajna Brandon Gibson","provider":"Coursera","language":"English","skills":["europe","financial markets","economy","switzerland"],"subject":"Economics","studentsInterested":"2.4k","courseLink":"https://www.coursera.org/learn/understanding-financial-markets","classCentralLink":"https://www.class-central.com/course/coursera-understanding-financial-markets-5480"},{"title":"Making Sense of the News: News Literacy Lessons for Digital Citizens","about":"Never before has the need for News Literacy been more urgent. As news consumers are bombarded with a constant stream of fake news, propaganda, hoaxes, rumors, satire, and advertising — that often masquerade as credible journalism — it is becoming more and more difficult to distinguish fact from fiction. While the public’s faith in the news media erodes, purveyors of misinformation have helped give rise to troubling cultural trends and alarming political movements.\n\nThis six-week course will help learners develop their critical thinking skills to enable them to better identify reliable information in news reports and to become better informed about the world in which we live. The course will discuss the key elements of journalism from the viewpoint of the news audience.\n\nThe language of instruction is English, but Chinese and Spanish subtitles will be available. Each week will tackle a challenge unique to the digital era:\n\nWeek 1: The power of information is now in the hands of consumers.\nWeek 2: What makes journalism different from other types of information?\nWeek 3: Where can we find trustworthy information?\nWeek 4: How to tell what’s fair and what’s biased.\nWeek 5: How to apply news literacy concepts in real life.\nWeek 6: Meeting the challenges of digital citizenship.","tutor":"Masato Kajimoto and Howard Schneider","provider":"Coursera","language":"English","skills":["asia","hong kong","usa","north america","new-moocs-2017"],"subject":"Sociology","studentsInterested":"921","courseLink":"https://www.coursera.org/learn/news-literacy","classCentralLink":"https://www.class-central.com/course/coursera-making-sense-of-the-news-news-literacy-lessons-for-digital-citizens-7330"},{"title":"Renewable Energy and Green Building Entrepreneurship","about":"Welcome to the course where you learn to launch a new business in the energy, finance, real estate, design, engineering, or environmental sectors, while also helping you create positive environmental and human health impacts around the world.\n\nWe will integrate tools, trends, and tips from the field of entrepreneurship as a career path for making a difference and generating wealth in the renewable energy and green building sectors.\n\nThis is not a course about theory. Instead, we focus on real world application, step-by-step advice, and case studies.\n\nAfter completing this course, students will be able to:\n\n- Define key business opportunities, challenges, and potential solutions in the renewable energy and green building sectors.\n- Analyze a successful business in renewable energy or green building.\n- Identify 2 to 3 problems you might solve with either renewable energy or green building products or services.\n- Plan for engaging with investors who might finance a new business.\n- Take real world first steps towards launching a new business or corporate initiative, by applying the 1-page business idea summary template and the Business Model Canvas to generating and refining your own new business ideas.","tutor":"Chris Wedding","provider":"Coursera","language":"English","skills":["entrepreneurship","renewable energy","new-moocs-2017"],"subject":"Urban Planning","studentsInterested":"105","courseLink":"https://www.coursera.org/learn/renewable-energy-entrepreneurship","classCentralLink":"https://www.class-central.com/course/coursera-renewable-energy-and-green-building-entrepreneurship-8744"},{"title":"Stochastic processes","about":"The purpose of this course is to equip students with theoretical knowledge and practical skills, which are necessary for the analysis of stochastic dynamical systems in economics, engineering and other fields.\nMore precisely, the objectives are\n1. study of the basic concepts of the theory of stochastic processes;\n2. introduction of the most important types of stochastic processes;\n3. study of various properties and characteristics of processes;\n4. study of the methods for describing and analyzing complex stochastic models.\nPractical skills, acquired during the study process:\n1. understanding the most important types of stochastic processes (Poisson, Markov, Gaussian, Wiener processes and others) and ability of finding the most appropriate process for modelling in particular situations arising in economics, engineering and other fields;\n2. understanding the notions of ergodicity, stationarity, stochastic integration; application of these terms in context of financial mathematics;\nIt is assumed that the students are familiar with the basics of probability theory. Knowledge of the basics of mathematical statistics is not required, but it simplifies the understanding of this course.\nThe course provides a necessary theoretical basis for studying other courses in stochastics, such as financial mathematics, quantitative finance, stochastic modeling and the theory of jump - type processes.","tutor":"Vladimir Panov","provider":"Coursera","language":"English","skills":["probability","economics","statisitics","analysis"],"subject":"Economics","studentsInterested":"51","courseLink":"https://www.coursera.org/learn/stochasticprocesses","classCentralLink":"https://www.class-central.com/course/coursera-stochastic-processes-10709"},{"title":"心理学与生活","about":"心理学很神秘？你会发现，只要有人的地方，就有心理学！\n心理学很深奥？你会发现，似乎每个人都是大众心理学家，谁都可以说点“心理学”。\n的确，我们生活中处处都是心理学！但这门课程却要告诉你，我们常常挂在嘴边的“心理学”绝大部分是错的，剩下的一小部分也是不全面的。\n在本课程中，我们会一起把看似复杂的心理学理论运用到简单的生活现象中，在理解和掌握心理规律和原理后，用独具的慧眼看到一个与原先完全不同的生活世界。","tutor":"陈 昌凯","provider":"Coursera","language":"Chinese","skills":["psychology","china","asia"],"subject":"Psychology","studentsInterested":"9","courseLink":"https://www.coursera.org/learn/xin-li-xue-sheng-huo","classCentralLink":"https://www.class-central.com/course/coursera--4180"},{"title":"Сравнительная политика (Comparative Politics)","about":"Как войны изменяли политические организации, ставшие в итоге «привычными» нам государствами? Почему и когда возникают гражданские войны и революции? Почему и как нужно разделять власть? Что такое современная демократия? Почему в современных демократиях политическое представительство реализуется через политические партии? Почему выборы – важнейший институт демократии? Какие политические режимы более устойчивы к внешним изменениям? Как главе государства стоит поступить в случае неизбежного демократического транзита? Таковы одни из ключевых вопросов, которыми задаются исследователи сравнительной политики, а ответы могут быть найдены в рамках данного курса.\n\nКурс дает Вам двойную выгоду. Вы научитесь ЧТО и КАК сравнивать. Вы сможете познакомиться с важнейшими институтами, режимами и практиками. Вы осваиваете целый ряд способов анализа от всеохватных до казусно-ориентированных сравнений.\n\nВы научитесь использовать надежные методы и достоверные научные технологии сравнения на основе тренировочных сравнений разнообразных государств и демократий мира. Вы сможете сравнивать различные виды власти и способы ее распределения в современных политиях или фактическое разделение властей.\n\nВы познакомитесь с различными способами представительства людей или корпуса граждан – осуществляется ли оно главами государств или законодателями; изучите, как выборы и партии могут помочь или помешать демократическому представительству в различных случаях. Наконец Вы научитесь сравнивать «ускользающие» предметы изучения, например, преобразования, кризисы и конфликты различных видов.\n\nСИСТЕМА ОЦЕНИВАНИЯ\nФинальная оценка за курс основана на 10 тестах, выполняемых в конце каждой недели, Экзамена, который выполняется в качестве тестового задания и 1 взаимно-оцениваемого задания. Подтверждение о выполнении курса доступно в двух формах: с отличием – балл по курсу должен составлять 80% или более; курс пройден – балл по курсу должен составлять от 65% до 80%.\n\nПРЕДВАРИТЕЛЬНЫЕ ТРЕБОВАНИЯ\nКурс рассчитан на слушателей, имеющих базовые представления о сфере политики и знакомых с набором основных понятий и концепций политической науки («власть», «государство» и его функции, «выборы», «политические партии»).","tutor":"Mikhail Ilyin and Mikhail Mironyuk","provider":"Coursera","language":"Russian","skills":["russia"],"subject":"Political Science","studentsInterested":"35","courseLink":"https://www.coursera.org/learn/politika-sravnitelnaja","classCentralLink":"https://www.class-central.com/course/coursera---comparative-politics-2836"},{"title":"Open Government","about":"How can governments become more open and transparent, while simultaneously dealing with various challenges, such as data sensitivity? How can open government data be used to improve policy making? Which technologies are available to make governments more open and to use open government data?\nGovernments all over the world aim to become more open and transparent in order to establish closer ties with their constituents. However, opening government involves complex challenges and poses two major areas of concerns. First, many different stakeholders are involved and there are various dependencies between them, and second, the technologies that support open government are fragmented. In addition, it is unclear how different contexts should alter the best practices for open government.\nThis course explores the foundations and objectives of Open Government and examines current developments, including the opening and reuse of governmental data such as the release of data by governments in America and Europe.\nThis course will empower you, by helping you grasp the key principles surrounding open government. The topics of the course are applied to concrete cases, which you will be asked to analyze and discuss with your peers.\nThis course may be of interest to the following:\nStudents interested in the basics of open government, in data-driven governance and data-driven research;\nProfessionals and researchers working on open government research and interested in strategies and challenges for opening governments","tutor":"Marijn Janssen and Anneke Zuiderwijk","provider":"edX","language":"English","skills":["delftx"],"subject":"Political Science","studentsInterested":"78","courseLink":"https://www.edx.org/course/open-government","classCentralLink":"https://www.class-central.com/course/edx-open-government-5020"},{"title":"Firm Level Economics: Consumer and Producer Behavior","about":"All goods and services are subject to scarcity at some level. Scarcity means that society must develop some allocation mechanism – rules to determine who gets what. Over recorded history, these allocation rules were usually command based – the king or the emperor would decide. In contemporary times, most countries have turned to market based allocation systems. In markets, prices act as rationing devices, encouraging or discouraging production and encouraging or discouraging consumption in such a way as to find an equilibrium allocation of resources. We will construct demand curves to capture consumer behavior and supply curves to capture producer behavior. The resulting equilibrium price “rations” the scarce commodity. Markets are frequent targets of government intervention. This intervention can be direct control of prices or it could be indirect price pressure through the imposition of taxes or subsidies. Both forms of intervention are impacted by elasticity of demand.\n\nAfter this course, you will be able to:\n• Describe consumer behavior as captured by the demand curve.\n• Describe producer behavior as captured by the supply curve.\n• Explain equilibrium in a market.\n• Explain the impact of taxes and price controls on market equilibrium.\n• Explain elasticity of demand.\n• Describe cost theory and how firms optimize given the constraints of their own costs and an exogenously given price.\n\nThis course is part of the iMBA offered by the University of Illinois, a flexible, fully-accredited online MBA at an incredibly competitive price. For more information, please see the Resource page in this course and onlinemba.illinois.edu.","tutor":"Larry Debrock","provider":"Coursera","language":"English","skills":["supply and demand","rationing","allocation systems","usa","north america"],"subject":"Economics","studentsInterested":"687","courseLink":"https://www.coursera.org/learn/firm-level-economics","classCentralLink":"https://www.class-central.com/course/coursera-firm-level-economics-consumer-and-producer-behavior-5246"},{"title":"Protecting Business Innovations via Patent","about":"This course assumes no prior knowledge in law, business or engineering. However, students with backgrounds in all three areas will find useful concepts or ideas in the course on how to protect business innovations using patents. The approach taken in this course is practical and commercial rather than theoretical. A combination of lectures and case studies help to illustrate the concepts and make the course more interesting.\n\nAfter completing this course, students should be able to understand how patents are issued and protect innovations, including: What is a patent? What do they protect? How do we get a patent? Where are patents valid? How much do they cost?\n\nIn addition to basic concepts the course also deals with advanced topics such as: software patents, business process patents, patenting life, patent trolls and multiple case examples of large and small companies using patents and patent lawsuits.\n\nWe also expect you to have fun in this course. So go forth and enjoy!","tutor":"Theodore Henry King CLARK","provider":"Coursera","language":"English","skills":["innovation","law","patents"],"subject":"Law","studentsInterested":"88","courseLink":"https://www.coursera.org/learn/protect-business-innovations-patent","classCentralLink":"https://www.class-central.com/course/coursera-protecting-business-innovations-via-patent-10382"},{"title":"Corporate governance. Mitos y realidades","about":"El corporate governance o gobierno corporativo es uno de los temas más relevantes de nuestro tiempo, tanto desde el punto de vista jurídico como económico. Se trata de una corriente universal, impulsada desde el ámbito anglosajón, pero fuertemente desarrollada en Europa y también en Iberoamérica, Asia o África.\nPartiendo de esta realidad, el curso pretende:\ni) seleccionar algunos de los temas que, dentro de un catálogo potencialmente muy amplio pueden tener más interés para los usuarios de los MOOCs, especialmente de España y América Latina;\nii) tratar de dar, por una parte, una visión teórica y práctica de cada cuestión y por otro lado, ilustrarlo de manera más didáctica mediante entrevistas con expertos o protagonistas de la materia analizada\n\nSe trata de determinar y analizar los temas realmente importantes que se están planteando y distinguirlos de otros que pueden un carácter más circunstancial o anecdótico, como sucede a menudo con cuestiones de gran actualidad. Por esa razón también se ha partido de un esquema en el que se cuestionan algunas ideas preconcebidas que puedan existir sobre el buen gobierno\nSe abordan con carácter específico temas clave de nuestro tiempo como el papel de los acreedores, la diversidad de género y el aspecto penal relacionado con las políticas de compliance.","tutor":"Francisco Mercadal Vidal, Inma Valeije Alvarez, Miriam Cugat Mauri, Jorge Miquel Rodríguez and Adoración Pérez Troya","provider":"Coursera","language":"Spanish","skills":["governance","corporate law","corporations"],"subject":"Law","studentsInterested":"37","courseLink":"https://www.coursera.org/learn/corporate-governance-mitos-realidades","classCentralLink":"https://www.class-central.com/course/coursera-corporate-governance-mitos-y-realidades-10750"},{"title":"Protecting Business Innovations via Copyright","about":"Protecting Business Innovations Via Copyright\n\nIntellectual property rights (IPR) has a great impact on innovation development and society. In Science, Engineering, and Business, we seek to create wealth through innovation in products, designs, manufacturing processes, and business systems or models. However, innovation leaders often FAIL to benefit from their discoveries and inventions when they are unable to adequately protect those innovations.\n\nThis course provides learners with an understanding of Copyright law and how it can be used to protect business innovation. The course focus is on protecting innovations with copyright as one of several tools that can be used by companies and individuals to protect creative innovations. In additional to learning about how copyright works in theory, we will also discuss situations in which copyright might not be effective in protecting innovations, and will focus on the legal issues involved from a practical business perspective rather than from a purely legal viewpoint. This course is one part of a four course series focusing on protection of business innovations using copyright, patent, trademark and strategy, and these four courses may be taken in any order that is most beneficial to students interested in learning about protecting innovation.\n\nWatch Course Overview: https://youtu.be/81adg1ZnbS4","tutor":"Theodore Henry King CLARK","provider":"Coursera","language":"English","skills":["copyright","intellectual property","ipr","new-moocs-2017"],"subject":"Law","studentsInterested":"746","courseLink":"https://www.coursera.org/learn/protect-business-innovations-copyright","classCentralLink":"https://www.class-central.com/course/coursera-protecting-business-innovations-via-copyright-8733"},{"title":"Federal Taxation II: Property Transactions of Business Owners and Shareholders","about":"This course examines the U.S. federal tax system as it relates to property transactions of business owners and shareholders. Topics include cost recovery, such as depreciation, amortization, and depletion; calculation of realized versus recognized gains and losses; evaluation of the potential tax effects of nontaxable exchanges; and the combining, or netting, gains and losses that are different in nature. Assignments facilitate self-discovery of knowledge and development of a variety of professional skills.","tutor":"Petro Lisowsky, PhD, CPA","provider":"Coursera","language":"English","skills":["business","tax law","federal tax","new-moocs-2017"],"subject":"Law","studentsInterested":"45","courseLink":"https://www.coursera.org/learn/federal-taxation-business","classCentralLink":"https://www.class-central.com/course/coursera-federal-taxation-ii-property-transactions-of-business-owners-and-shareholders-9445"},{"title":"Industrial Organization: Strategy and Competition in Business","about":"Industrial Organization is the area of economics that studies the markets as institutions, the state of competition and strategic interaction among firms, the industrial policy and the business decisions firms make within the market framework. The course looks at the markets from three different perspectives: the economic theory, the applied business perspective and the institutional and legal perspective. The focus of the course is split equally between the economic theory and business perspective but there is a significant legal component incorporated in various topics. The course includes economic modeling, game theory, numerous real life examples and several case studies. We explore interesting topics of market organization such as negotiations, antitrust, networks, platforms, electronic markets, intellectual property, business strategies, predation, entry deterrence and many others.\n\nThe basic objective of the course is to enable the student to understand the structure of markets and the nature of strategic competition. Knowledge in this course will be valuable for the students in acquiring managing and governance skills, enriching their understanding of the institutional framework of business, and improve their analytical ability in negotiations.\n\nPrerequisites: The course requires understanding of basic economic modeling, knowledge of intermediate microeconomics (especially production/cost theory), knowledge of basic concepts and methodologies of game theory, intermediate econometrics and basic calculus.","tutor":"Kosmas Marinakis","provider":"Coursera","language":"English","skills":["economics","business strategy","industrial organization"],"subject":"Economics","studentsInterested":"10","courseLink":"https://www.coursera.org/learn/industrial-organization","classCentralLink":"https://www.class-central.com/course/coursera-industrial-organization-strategy-and-competition-in-business-10130"},{"title":"Основы микроэкономики (Microeconomics Principles)","about":"В базовом курсе микроэкономики рассказывается об основных инструментах экономического анализа, которые позволяют изучать наиболее важные закономерности в поведении людей и фирм. У людей есть предпочтения относительно товаров и бюджетные ограничения, у фирм – производственные возможности и спрос на их продукцию со стороны людей. В результате взаимодействия людей и фирм складываются рынки, на которых определяется цена – важнейший канал передачи информации.\n\nЧтобы информации было больше, существуют рынки, на которых продаются и покупаются товары и услуги. Потребитель никогда не купит нужный ему товар, если не узнает, где и как его можно купить. Производитель не станет его изготавливать, если не будет уверен, что найдется покупатель, который его приобретет. Каждый человек и каждая фирма обладает какими-то сведениями – прежде всего о себе самом, о своих вкусах, интересах, потребностях и возможностях. Однако информации у всех становится во много раз больше, когда субъекты начинают взаимодействовать – производят и потребляют, продают, покупают и меняются. Поведение людей и фирм на рынках – основной предмет изучения в курсе микроэкономики.\n\nThe introductory course in Microeconomics describes the basic instruments of economic analysis, which allow us to study the most important patterns in behavior of people and firms. As a result of their interactions markets occur and prices are determined. Thus, microeconomics studies the behavior of people and firms in the markets.","tutor":"Konstantin Sonin","provider":"Coursera","language":"Russian","skills":["russia"],"subject":"Economics","studentsInterested":"33","courseLink":"https://www.coursera.org/learn/mikroekonomika","classCentralLink":"https://www.class-central.com/course/coursera---microeconomics-principles-1384"},{"title":"European Business Law: Understanding the Fundamentals","about":"The European Union is one of the world’s largest and most important economies. This five week course is the first in a series of three that will provide students with an insight into European Business Law. The series ranges from considering the basic structures and principles of the European Union to focusing on various specialized areas of law. Each course will give the students an understanding of the laws and policies that regulate the internal market of European Union, as well as relevant case law and useful inputs from leading practitioners in the field.\n\nAt the end of this course series, you will have a basic understanding of how to:\n\n• Navigate EU legal sources\n\n• Understand relevant laws and regulations governing the internal European Union market\n\n• Apply the fundamental principles of EU law within the EU legal framework\n\n• Utilize the rules of freedom of movement and their impacts on trade in the EU\n\n• Relate EU law with national laws\n\n• Understand EU policies and their influence on foreign trade and investment\n\n\nAbout the Series\n\nIn the first course, Understanding the Fundamentals, we will examine the core structures and principles of the European Union as well as the main sources of law. In the second course, Doing business in Europe, we will focus on the main laws that regulate various aspects of establishing and running a business within the European Union. In the final course, Competing in Europe, we will go into more depth about how to compete on the internal market and protect your brand, product or invention.\n\nTo keep up to speed on the course series, visit our Facebook page at:\n\nhttps://www.facebook.com/eblmooc/\n\n\nSyllabus and Format\n\nEach course consists of a number of modules where one module represents about one week of work. A module includes a number of lectures and readings, and finishes with a voluntary assessment – a quiz, a small peer graded assignment or a case law review. The assessments are intended to encourage learning and ensure that you understand the material of the course. Participating in forum discussions is voluntary.\n\nCourse I - Understanding the Fundamentals\n\nModule 1. Introduction to EU law\nModule 2. Legal Method and Sources\nModule 3. Constitutional Freedoms and Fundamental principles\nModule 4. Freedom of Movement\nModule 5. The External Dimension\n\nCourse II - Doing Business in Europe\n\nModule 1. Making Business Transactions\nModule 2. Establishing a Company\nModule 3. Employing and Working in Europe\nModule 4. Paying Taxes and Complying with Environmental Standards\nModule 5. Case Clinic\nModule 6. Resolving Cross-border Disputes\n\nCourse III - Competing in Europe\n\nModule 1. Trademarks as Essential Assets\nModule 2. Defending Patents\nModule 3. Competition: Illegal Agreements\nModule 4. Competition: Abuse of Dominance and Mergers\nModule 5. Advocacy and Legal Writing\nModule 6. Selling to the State and State Aid\n\n\nLund University\n\nLund University was founded in 1666 and has for a number of years been ranked among the world’s top 100 universities. The University has 47 700 students and 7 500 staff based in Lund, Sweden. Lund University unites tradition with a modern, dynamic, and highly international profile. With eight different faculties and numerous research centers and specialized institutes, Lund is the strongest research university in Sweden and one of Scandinavia\u0027s largest institutions for education and research. The university annually attracts a large number of international students and offers a wide range of courses and programmes taught in English.\n\nThe Faulty of Law is one of Lund University’s four original faculties, dating back to 1666. It is a modern faculty with an international profile, welcoming both international and Swedish students. Education, research and interaction with the surrounding community are the main focus of the Faculty’s work. The connection between the three is particularly apparent in the programmes and courses offered by the university, including the university’s MOOC course in European Business Law. The students get the chance to engross themselves in traditional legal studies, while interacting with both researchers and professionally active lawyers with qualifications and experience from various areas of law.\nThe faculty offers three international Masters: two 2-year Master’s programmes in International Human Rights Law and European Business Law, and a 1-year Master’s in European and International Tax Law. Students from around 40 countries take part in the programmes which offer a unique subject specialization within each field, with highly qualified researchers and professional legal practitioners engaged in the teaching.\n\nThe Master’s programme in European Business Law provides an in-depth understanding of both the practical and the theoretical aspects of business law within the European Union. The programme provides both general and specific knowledge of the European Union legal framework, which is necessary for students intending to work as legal advisors or business decision-makers. The programme is delivered in English and is open to students with at least a three year degree in Law (Bachelor, LL.B, or equivalent) who want to specialise in European economic and business law.\nThe MOOC course in European Business Law is a great course to start with for students intending to apply for the Master’s programme in European Business Law. Even though the MOOC course does not grant credits previous knowledge of the subject is considered upon admission to the master’s programme. For more information about the Master’s programme in European Business Law see https://www.law.lu.se/#!meb","tutor":"Jörgen Hettne, Cécile Brokelind, Sanja Bogojevi ć, Michael Bogdan, Anna Wiberg, Mia Rönnmar and Björn Lundqvist","provider":"Coursera","language":"English","skills":["europe","eu","european union","eu legal system","european law","sweden"],"subject":"Law","studentsInterested":"372","courseLink":"https://www.coursera.org/learn/european-law-fundamentals","classCentralLink":"https://www.class-central.com/course/coursera-european-business-law-understanding-the-fundamentals-2166"},{"title":"Теория игр (Game Theory)","about":"В течение жизни мы постоянно взаимодействуем с другими людьми. Маленькие дети, пытаясь добиться того, чтобы родители купили понравившуюся конфетку, часто шантажируют родителей своими слезами. Принимая решение заплакать, ребенок рискует — он не знает, как поведут себя папа с мамой. В чуть более взрослом возрасте абитуриенты, выбирающие вуз, принимают сложное решение о том, в какие университеты подать документы. Ошибка может стоить дорого: при неправильной стратегии можно оказаться в слабом университете или вообще остаться без заветного студенческого билета. Окончив вуз, юноши и девушки начинают искать работу. Перед интервью с работодателем они штудируют статьи в интернете о том, что можно и чего нельзя говорить на интервью, — они пытаются найти наилучшую стратегию своего поведения, исходя из ожиданий компании, в которую они устраиваются. Все эти ситуации объединяет то, что решения, которые принимают одни люди, оказывают влияние на других людей. Такие взаимодействия называются стратегическими. Именно их изучает теория игр.\n\nЧтобы проанализировать ту или иную реальную жизненную ситуацию стратегического взаимодействия и найти оптимальный вариант поведения в ней, необходимо сделать две вещи. Во-первых, необходимо формально записать ситуацию на языке теории игр, то есть создать модель (игру). Во-вторых, после того как модель (игра) составлена, ее необходимо решить. Этому мы будем учиться в течение курса. Мы разберем основные виды игр (одновременные и последовательные, с совершенной и несовершенной информацией, коалиционные и некоалиционные), приведем способы их решения и обсудим их на многочисленных примерах.\n\nКурс будет интересен желающим разобраться в том, как конкурируют друг с другом несколько компаний и можно ли гарантированно выиграть в шашки, есть ли смысл угрожать на переговорах и с кем стоит объединяться в коалиции в парламенте.\n\nFAQ\n\nВ: Требуется ли предварительная подготовка для прохождения курса?\nО: Курс является базовым, поэтому он не требует специальной подготовки. Для его успешного освоения достаточно уверенных знаний курса математики в объеме школьной программы. В одном-двух примерах могут пригодиться знания начал математического анализа (дифференцирование функций одной переменной, необходимое условие экстремума) и знания начал теории вероятностей (понятие математического ожидания случайной величины).\n\nВ: Что требуется для успешного окончания курса?\nО: Итоговая оценка за курс складывается из результатов 10 оцениваемых тестов. Для успешного окончания курса необходимо дать не менее 80 % правильных ответов на каждый из этих тестов.","tutor":"Dmitry Dagaev","provider":"Coursera","language":"Russian","skills":["russia"],"subject":"Economics","studentsInterested":"53","courseLink":"https://www.coursera.org/learn/game-theory","classCentralLink":"https://www.class-central.com/course/coursera---game-theory-2856"},{"title":"Women in Leadership: Inspiring Positive Change","about":"This course aims to inspire and empower women and men across the world to engage in purposeful career development and take on leadership for important causes---to lead change with more conviction and confidence---and improve our workplaces and communities for all. By offering more complex understandings of issues related to professional women and work, the course will help you increase self-knowledge about your own values and vision, as well as enhance your capabilities as a leader, manager, and team contributor. We will examine the opportunities, challenges, trade-offs, and organizational dynamics experienced by women in work organizations, as well as reflect on and practice effective individual behaviors.\n\nThe course aims at answering questions such as: What are the valued attributes and behaviors of women in the workplace? How does the gendered nature of organizations impact women? What derails our career advancement and what propels us upward? What are your leadership goals and aspirations? How can you best integrate your multiple family and work life commitments? How do you define career success? What can organizations do to provide women with opportunities to excel? What opportunities could our global economy harness by advancing women to leadership? How can the full talents of the workforce be tapped into and developed?\n\nThe course is about leadership and inspiring change, but at its core it is meant to inspire and empower women and men across the world to engage in purposeful career development and take on leadership for important causes, to lead change with more conviction and confidence, and improve our workplaces and communities for all. Your involvement in the course activities is essential to help you learn these concepts and develop the necessary skills to implement them. If you watch the videos and read the required articles you will be introduced to some intriguing ideas. If you do the personal reflective exercises and complete the final project you will convert those ideas into relevant experiences to enhance your life and work. Going beyond your personal relevance, your potential learning will expand to understanding and working with others more effectively through either the Discussion Forums in the course or through face-to-face discussions (some of you are taking the course in groups). Each week, we will post reminders, changes, and other relevant announcements.","tutor":"Diana Bilimoria","provider":"Coursera","language":"English","skills":["usa","north america"],"subject":"Sociology","studentsInterested":"370","courseLink":"https://www.coursera.org/learn/women-in-leadership","classCentralLink":"https://www.class-central.com/course/coursera-women-in-leadership-inspiring-positive-change-3448"},{"title":"Mastering bitumen for better roads and innovative applications","about":"During the four coming weeks, best experts in bitumen will bring you their knowledge and experience to build a strong understanding of today’s realities and new perspectives on the future of bitumen.\n\nTotal is the European leader on bitumen markets. Innovation has always been the key to sustainability and durability in the products they develop. Their main objective here is to share technical knowledge and experience to insure bitumen are being used in the most effective and efficient ways for their different applications in road works.\n\nEcole des Ponts, France oldest engineering school, remains very much in the present, as it has always been, in training engineers in order to meet the needs of our society and citizens in key areas such as transport housing and urban services, but also in fields like energy, environment, climate sciences, land-use planning and sustainable development.\n\nNineteen world recognized experts on bitumen are contributing to this MOOC.\n\nThe idea is to provide the broadest prism on this topic area with speakers coming from research, industry and end users.","tutor":"Sophie LIMBORG, Olivier GAMET, Mike SOUTHERN, Gilles GAUTHIER, Clémence QUEFFELEC, Armel de la BOURDONNAYE and Eric GOSSE","provider":"Coursera","language":"English","skills":["europe","sustainable development","bitumen","france"],"subject":"Urban Planning","studentsInterested":"39","courseLink":"https://www.coursera.org/learn/mastering-bitumen","classCentralLink":"https://www.class-central.com/course/coursera-mastering-bitumen-for-better-roads-and-innovative-applications-6036"},{"title":"Global Diplomacy – Diplomacy in the Modern World","about":"The Global Diplomacy course is a unique offering to the MOOC environment. Bringing together cutting edge research in the broad fields of Diplomatic and International Studies, award winning distance learning delivery and the instructors previous experience of delivering a successful MOOC. Please see the volume Global Diplomacy: Theories, Types and Models authored with Dr Alison Holmes, (Westview, 2016), and the Understanding Research Methods MOOC from Coursera.\n\nThe Global Diplomacy MOOC has a direct heritage in the University of London International Academy/SOAS Global Diplomacy MA Programme launched in April 2013 which have attracted hundreds of students from around the world. The Global Diplomacy MA Programme is provided by the Centre for International Studies and Diplomacy which has been teaching postgraduate courses in Diplomacy for over twenty five years.\nAfter completing the \u0027Global Diplomacy\u0027 MOOC, learners will have:\n1. The ability to demonstrate a critical understanding of the nature and development of global diplomacy, drawing on a variety of relevant contributing disciplines in the broad field of International Studies.\n2. An understanding of changes in diplomatic practices and procedures and the relationship of those changes to contemporary politics.\n3. A sound grounding in both theoretical and empirical approaches to debates in diplomacy so that students have been exposed to the and skills needed to analyse global diplomacy.\n4. knowledge of issues in global diplomacy in historical and contemporary contexts.","tutor":"Dr J. Simon Rofe, SOAS, University of London","provider":"Coursera","language":"English","skills":["politics","europe","uk","diplomat","global diplomacy","england"],"subject":"Political Science","studentsInterested":"415","courseLink":"https://www.coursera.org/learn/global-diplomacy","classCentralLink":"https://www.class-central.com/course/coursera-global-diplomacy-diplomacy-in-the-modern-world-5920"},{"title":"Sexualidad y educación","about":"La mayor parte de las personas tenemos inquietudes sobre cómo, cuándo y para qué educar a niñas, niños, jóvenes y adultos acerca de la sexualidad. Ya sea como madres, padres, cuidadores, profesores, profesionales de la salud, interesados en los medios de comunicación o en el tema de la sexualidad, con frecuencia nos planteamos preguntas como las siguientes: ¿Para qué educar sobre sexualidad, si existe abundante información al respecto? ¿La educación de la sexualidad debería brindarla la familia o la escuela? ¿A qué edad es adecuado iniciar la educación de la sexualidad? ¿La educación de la sexualidad aumenta la curiosidad sobre este tema? Para responder estos y otros interrogantes planteados por quienes participan en nuestras iniciativas de investigación y en los diferentes procesos educativos que llevamos a cabo, hemos diseñado este segundo curso con respecto a la educación de la sexualidad en diferentes ámbitos. De esta manera también queremos responder a las solicitudes de quienes ya tomaron nuestro primer Curso “Sexualidad… mucho más que sexo” de facilitar el acceso a otros cursos que profundicen en este tema.\n\nSi decides realizar este curso, esperamos que al final puedas reconocer claramente qué significa educar en el campo de la sexualidad así como identificar en qué contextos y en qué momentos ocurre esta labor. Igualmente, aspiramos que al terminar este curso, te sientas con mayor seguridad de tu capacidad para garantizar este derecho a otras personas en cualquier contexto en el que vivas o trabajes.\n\nEn el grupo de Investigación Familia y Sexualidad de la Universidad de los Andes en Colombia tenemos un sueño: Que a todas las personas, sin distinción de ningún tipo, se nos garantice el derecho a contar con información oportuna, útil, confiable y basada en evidencia sobre los diferentes aspectos que nos interesan de la sexualidad. Esperamos que decidas unirte a este desafío, si compartimos el mismo ideal podemos construir una red en la que gracias a tu complicidad y la de otras personas que toman nuestros cursos podemos lograr la transformación social que se requiere para que muy pronto el ejercicio del derecho a la educación de la sexualidad sea una realidad en tú país, en el nuestro y, por qué no, a nivel global.\n\nOrganizaciones aliadas:\n\nLa producción de este curso ha contado con el apoyo del Fondo de Población de las Naciones Unidas - UNFPA","tutor":"Carlos Hermosa Bosano - Departamento de Psicología, Ángela María Rojas Martínez - Departamento de Psicología, Marta Carolina Ibarra A. - Facultad de Educación, Eduardo Escallón - Facultad de Educación and Elvia Vargas Trujillo - Departamento de Psicología","provider":"Coursera","language":"Spanish","skills":["colombia","south america"],"subject":"Social Sciences","studentsInterested":"8","courseLink":"https://www.coursera.org/learn/sexualidad-y-educacion","classCentralLink":"https://www.class-central.com/course/coursera-sexualidad-y-educacion-7166"},{"title":"Children\u0027s Human Rights - An Interdisciplinary Introduction","about":"Drawing on the contributions of several academic disciplines including law, psychology, sociology, history, educational and health sciences, economy and anthropology, an interdisciplinary approach guides the student into a selection of critical issues concerning children’s rights. Participants will gain insight relative to the development of this specific human rights category, as well as to the evolution of the challenges faced by children over time and society’s efforts to respond. Successful international strategies and programs promoting children’s rights will be highlighted, as well as the role of key actors involved in international organizations working in this field. This open online course provides an overview of the most important features of children’s human rights. A central portion of the MOOC will consist of a presentation of the international and regional standards on children’s rights and the related international and regional judicial and quasi-judicial bodies designed to ensure their implementation.\n\nNo prerequisites or specific background is required to register for this MOOC. The course is conceived as an introductory level program, but participants, who wish to deepen their knowledge in the field of children’s rights, or already have some prior knowledge, will have access to additional reading material on a weekly basis. Participants who successfully complete the class activities and final assessment may request a Statement of Accomplishment signed by the Instructor and the main professors responsible for the program. However, no credits are awarded.\n\nThe course consists of seven topical modules distributed on 4 weeks. English is the only language of instruction.","tutor":"Roberta Ruggiero, Philip D. Jaffé and Jean Zermatten","provider":"Coursera","language":"English","skills":["europe","switzerland","new-moocs-2017"],"subject":"Human Rights","studentsInterested":"201","courseLink":"https://www.coursera.org/learn/childrens-rights","classCentralLink":"https://www.class-central.com/course/coursera-children-s-human-rights-an-interdisciplinary-introduction-7767"},{"title":"Chemerinsky on Constitutional Law – Individual Rights and Liberties","about":"Chemerinsky on Constitutional Law: Individual Rights and Liberties will highlight the construction and interpretation of the U.S. Constitution through the centuries with an emphasis on protections of individual liberties and the evolution of equal protection. You\u0027ll learn the history behind the Constitution, cases that formed important precedent, and how changes in interpretation have been dependent on shifts in cultural and political climate as well as the composition of the Supreme Court.\n\nIn this course we will investigate the protection of individual rights and liberties and take a look at what rights are and are not protected and investigate several important shifts in jurisprudence. We\u0027ll begin by examining the structure of the Constitution\u0027s protection of individual rights. We\u0027ll then examine the circumstances under which, various rights and liberties can be regulated by the federal, state, and local government. We\u0027ll examine when the government can permissibly treat people unequally and when it can\u0027t. In our final two lectures, we\u0027ll take a close look at what is probably the most famous amendment to the Constitution, the First Amendment.\n\nJoin me as we look at the questions both raised and answered by the Constitution and those that interpret it!\n\nBy the end of this course, you should be able to:\n\n- Describe the individual liberties protected by the Constitution and account for the history and structure of their protection\n\n- Illustrate compromises found in the Constitution by citing examples and historic background\n\n- Articulate the importance of key cases such as Brown v. Board, Lemon v. Kurtzman, and Lochner v. New York\n\n- Explain how the outcome of cases is often dependent upon the current cultural and political climate as well as the composition of the court by citing particular cases and important shifts in the court\u0027s jurisprudence\n\n- Assess the relative suitability of various approaches to constitutional interpretation and analysis","tutor":"Erwin Chemerinsky","provider":"Coursera","language":"English","skills":["usa","north america","new-moocs-2017"],"subject":"Law","studentsInterested":"486","courseLink":"https://www.coursera.org/learn/chemerinsky-individual-rights","classCentralLink":"https://www.class-central.com/course/coursera-chemerinsky-on-constitutional-law-individual-rights-and-liberties-7798"},{"title":"Positive Psychology: Character, Grit and Research Methods","about":"Learners discover how apply to research methods to their study of Positive Psychology. In this course, we study with Dr. Angela Duckworth and Dr. Claire Robertson-Kraft. Through an exploration their work \"True Grit\" and interviews with researchers and practitioners, you develop a research hypothesis and learn how to understand the difference between internal and external validity. You also begin to understand and apply the strengths and weaknesses associated with different types of measurements and evaluation designs. You then interpret the results in an empirical study. Suggested prerequisites: Positive Psychology: Martin E. P. Seligman’s Visionary Science and Positive Psychology: Applications and Interventions.","tutor":"Claire Robertson-Kraft and Angela Duckworth","provider":"Coursera","language":"English","skills":["new-moocs-2017"],"subject":"Psychology","studentsInterested":"247","courseLink":"https://www.coursera.org/learn/positive-psychology-methods","classCentralLink":"https://www.class-central.com/course/coursera-positive-psychology-character-grit-and-research-methods-8335"},{"title":"Stalin and Stalinism in Russian History","about":"The course presents the life and deeds of Joseph Stalin, the leader of the Soviet Union from 1924 till 1953. It analyses the reasons for his actions and their results, as well as the causes of his popularity in Russia today. It offers an analysis of the phenomenon of Stalinism and of its significance for Russia and beyond.\n\nIn the late 1920s – early 1930s Stalin directed the massive and rapid industrialisation of the country and the forced collectivisation of its agriculture. The industrialisation was based on forced labour, and collectivisation on repression, but both helped to create the material base for the Soviet defence industry. In the late 1930s Stalin unleashed mass terror against the Soviet people, in which millions perished. In his view this helped to rid the country of any potential internal enemies on the eve of the coming war.\n\nThe USSR, together with its allies, won the Second World War, but at the cost of dozens of millions of lives. Stalin was instrumental in creating the post-war order. The system which he created in the 1930s shaped the USSR as it was during his lifetime and for decades after his death. It also influenced the lives of millions of people beyond the Soviet borders.\n\nThe course will enable those who take it to develop an informed understanding of the Stalin era and of the phenomenon of Stalinism.","tutor":"Irina Filatova","provider":"Coursera","language":"English","skills":["soviet union","stalin","stalinism","new-moocs-2017"],"subject":"Political Science","studentsInterested":"136","courseLink":"https://www.coursera.org/learn/stalinism","classCentralLink":"https://www.class-central.com/course/coursera-stalin-and-stalinism-in-russian-history-8804"},{"title":"Налоговое право (Tax law)","about":"Курс предполагает изучение основ налогового права (общая часть), в том числе вопросов налогового законодательства; налоговой компетенции публичных субъектов; принципов налогообложения; понятия и системы налогов и сборов; элементного состава налога; правового статуса участников налоговых правоотношений; налогового обязательства и его исполнения; налогового контроля; производства о налоговых правонарушениях и налоговой ответственности.","tutor":"Шевелёва Наталья Александровна, Овсянников Сергей Вадимович, Килинкарова Елена Васильевна, Сосновский Сергей Анатольевич, Ногина Оксана Аркадьевна and Кустова Маргарита Валерьевна","provider":"Coursera","language":"Russian","skills":["tax law","new-moocs-2017"],"subject":"Law","studentsInterested":"7","courseLink":"https://www.coursera.org/learn/nalogovoye-pravo","classCentralLink":"https://www.class-central.com/course/coursera---tax-law-9612"},{"title":"Economics of Transition and Emerging Markets","about":"The course analyzes challenges faced by transition and emerging-market economies, i.e., those middle- and low-income countries, which have conducted market-oriented economic reforms and become integrated into the global economy since 1990s.\n\nIt starts from a brief history of communist economic system based on central planning in the former Soviet Union and Central and Eastern Europe, its evolution and collapse at the end of 1980s/ early 1990s and subsequent transition to a market system in 1990s and 2000s. Then it analyzes experience of market reforms in China, India, other Asian countries, Middle East and North Africa, Sub-Saharan Africa and Latin America at the same period. Finally, it discusses the problems of contemporary global economy and global and regional economic governance with the special focus given to emerging-market economies and their role.\nBy the end of the course you will be able to analyse emerging-market economies and economies in transition, taking into account their crucial characteristics and historical experience.\n\nParticipation in the course does not require any preconditions, however, basic economic knowledge would be an advantage.\n\nIn order to pass successfully this course you must score not less than 80% for each of six after module quizzes and complete the peer-assessed essay at the end of the course.","tutor":"Marek Dabrowski","provider":"Coursera","language":"English","skills":["russia"],"subject":"Economics","studentsInterested":"222","courseLink":"https://www.coursera.org/learn/economics-transition-emerging-markets","classCentralLink":"https://www.class-central.com/course/coursera-economics-of-transition-and-emerging-markets-2840"},{"title":"Sexualidad...mucho más que sexo","about":"La mayoría de las personas, en algún momento de la vida, hemos experimentado inseguridad para hablar acerca de sexualidad con niñas, niños, estudiantes, pareja o colegas. Al finalizar este curso serás capaz de hablar de la sexualidad de manera clara, directa, usando información actualizada y sin sentimientos de vergüenza. Además, podrás diferenciar la sexualidad de los conceptos de sexo, género, orientación sexual y genitalidad. También describirás con seguridad los procesos biológicos, psicológicos y socioculturales que intervienen en el desarrollo de la sexualidad a lo largo de la vida. Asimismo, vas a lograr establecer la relación de la sexualidad con las decisiones que toman las personas en diferentes áreas, al igual que con su bienestar físico, psicológico y social.\n\nEn síntesis, al terminar este curso habrás perfeccionado habilidades para tu trabajo y tu propia vida y podrás explicar por qué la sexualidad es mucho más que sexo.\n\nEste curso está dirigido a personas que trabajan en educación, promoción de la salud y procesos comunitarios. También es muy útil para madres y padres de familia, y para cualquier persona interesada en superar barreras para hablar acerca de la sexualidad.\n\n¡Te esperamos en nuestro curso!\n\n\nRequisitos o preparación previa recomendada\n\nTodas las personas interesadas en la temática son bienvenidas. No se necesita una preparación previa específica. El conocimiento que has adquirido a lo largo de la vida sobre la sexualidad es suficiente para avanzar en el proceso.\n\nFormato del curso\n\nCada lección consistirá en una serie de videos de 3 a 7 minutos de duración cada uno. En cada lección vas a encontrar actividades de evaluación formativas, es decir, actividades que favorecen la autoevaluación, la reflexión personal y el análisis crítico de información. Al finalizar cada una de las lecciones vas a encontrar una evaluación sumativa que te va a permitir verificar tu comprensión del tema y el cumplimiento de los objetivos que te proponemos. En algunas lecciones hemos incluido lecturas complementarias para reforzar o ampliar la información que te proporcionamos.\n\nOrganizaciones Aliadas\n\nLa producción de este curso ha contado con el apoyo del Fondo de Población de las Naciones Unidas - UNFPA","tutor":"Ángela María Rojas Martínez, Carlos Hermosa Bosano, Elvia Vargas Trujillo and Marta Carolina Ibarra A","provider":"Coursera","language":"Spanish","skills":["sexuality","colombia","south america"],"subject":"Sociology","studentsInterested":"48","courseLink":"https://www.coursera.org/learn/sexualidad","classCentralLink":"https://www.class-central.com/course/coursera-sexualidad-mucho-mas-que-sexo-4637"},{"title":"Data Collection: Online, Telephone and Face-to-face","about":"This course presents research conducted to increase our understanding of how data collection decisions affect survey errors. This is not a “how–to-do-it” course on data collection, but instead reviews the literature on survey design decisions and data quality in order to sensitize learners to how alternative survey designs might impact the data obtained from those surveys.\n\nThe course reviews a range of survey data collection methods that are both interview-based (face-to-face and telephone) and self-administered (paper questionnaires that are mailed and those that are implemented online, i.e. as web surveys). Mixed mode designs are also covered as well as several hybrid modes for collecting sensitive information e.g., self-administering the sensitive questions in what is otherwise a face-to-face interview. The course also covers newer methods such as mobile web and SMS (text message) interviews, and examines alternative data sources such as social media. It concentrates on the impact these techniques have on the quality of survey data, including error from measurement, nonresponse, and coverage, and assesses the tradeoffs between these error sources when researchers choose a mode or survey design.","tutor":"Frederick Conrad, Ph.D.","provider":"Coursera","language":"English","skills":["research surveys","data collection","usa","north america"],"subject":"Social Sciences","studentsInterested":"50","courseLink":"https://www.coursera.org/learn/data-collection-methods","classCentralLink":"https://www.class-central.com/course/coursera-data-collection-online-telephone-and-face-to-face-6087"},{"title":"Electric Vehicles and Mobility","about":"The purpose of Electric Vehicles and Mobility is to help you, whatever your profile, your training or your country, find your own answers to questions such as:\n- Will electric vehicles be the last to be allowed in megalopolises in the 21st century?\n- Does the environmental gain from vehicle electrification justify heavy investment in charging infrastructure?\n- Are electric vehicles only for wealthy people in developed countries?\n\nThis course will allow you to acquire elements from engineering science, sociology, environmental science, political science, economics, management science, in order to evaluate, analyze and implement the diffusion of electric vehicles where their use is relevant.\n\nThis MOOC is the English version of Mobilités et véhicules électriques; in the lecture videos, the teachers speak in French, nevertheless their presentation is in English and English subtitles are available.\n\nGroupe Renault and ParisTech schools have been working together for almost 15 years on topics related to sustainable mobility. Together, they created two Master programs (Transport and Sustainable Development in 2004, Mobility and Electric Vehicles in 2010) and the Sustainable Mobility Institute Renault-ParisTech in 2009, to support ongoing changes. Electric Vehicles and Mobility is the result of this shared history and was developed from a course delivered within the Master Mobility and Electric Vehicles, led by Arts et Métiers ParisTech in partnership with Ensta ParisTech, Mines ParisTech and École des Ponts ParisTech.","tutor":"Émeric FORTIN and Virginie BOUTUEIL","provider":"Coursera","language":"English","skills":["sustainability","electric cars","sustainable mobility"],"subject":"Sociology","studentsInterested":"13","courseLink":"https://www.coursera.org/learn/electric-vehicles-mobility","classCentralLink":"https://www.class-central.com/course/coursera-electric-vehicles-and-mobility-9909"},{"title":"Sustainable Agricultural Land Management","about":"This course will cover the agricultural and urban water quality issues in Florida, their bases, land and nutrient management strategies, and the science and policy behind the best management practices (BMPs). Students will learn to evaluate BMP research and analyze its role in determining practices and policies that protect water quality.","tutor":"George Hochmuth","provider":"Coursera","language":"English","skills":["usa","north america"],"subject":"Urban Planning","studentsInterested":"241","courseLink":"https://www.coursera.org/learn/sustainable-agriculture","classCentralLink":"https://www.class-central.com/course/coursera-sustainable-agricultural-land-management-539"},{"title":"Politics and Economics of International Energy","about":"Energy issues have always been important in international relations, but in recent years may have become even more important than in the past due to the widespread awareness of existing limits to energy sources and negative climate impacts. The course discusses global trends in energy consumption and production, various available scenarios for potential developments in the coming decades, the availability of oil reserves and the evolution of the oil industry. It then discusses natural gas and highlights the differences between oil and gas. It will also discuss renewable energy sources, nuclear energy and EU energy policy.\n\nThe course aims at providing students whose main interest is in international relations a background on energy resources, technology and economic realities to allow them to correctly interpret the political impact of current developments. It also aims at providing students, who already have a technical background in energy science or engineering, with the broad global view of energy issues that will allow them to better understand the social, economic and political impact of their technical knowledge.\n\n\nABOUT THE INSTRUCTOR :\n\nGiacomo Luciani\n\nScientific Advisor for the Master in International Energy at the Paris School of International Affairs (PSIA) Sciences Po, Giacomo Luciani is also Adjunct Professor at the Graduate Institute of International and Development Studies, Geneva and Director of the Executive Master in International Oil and Gas Leadership. For the period 2010-13 he was appointed Princeton University Global Scholar, attached to the Woodrow Wilson School and the Department of Near Eastern Studies. His research focuses on the political economy of the Middle East and North Africa and on global energy issues.\n\nRECOMMENDED BACKGROUND :\n\nThe course requires no special scientific, mathematical or economic background; all key concepts are clearly and elementarily explained. It is expected that it will be of interest to undergraduate and graduate students in schools where an equivalent course is not offered (this being the case for the vast majority of schools).\n\n\nUSPC\nSorbonne Paris Cité\nSupported by Université Sorbonne Paris Cité\n\n\nIDEX\nInvestissements d\u0027Avenir\nFunded by Investissements d\u0027Avenir - \u0027ANR.\n\nInfo :\nCourse content : Licence Creative Commons BY NC SA","tutor":"Giacomo Luciani","provider":"Coursera","language":"English","skills":["politics","europe","renewable energy","economics","energy resources","france"],"subject":"Economics","studentsInterested":"505","courseLink":"https://www.coursera.org/learn/global-energy","classCentralLink":"https://www.class-central.com/course/coursera-politics-and-economics-of-international-energy-6189"},{"title":"Russian Trademark Law in Global Perspective","about":"Learn about legal framework of trademark registration, protection and enforcement in Russia. You can also compare Russian approach with international standards enshrined in relevant treaties and discover problematic arears of trademark protection in the Russia.\n\nThis course is on legal regulation of trademark protection in Russia. It explains the process of acquiring trademark in Russia, alternatives to trademark protection (such as firm names, trade names, names of origins), requirements for trademark validity, conditions under which trademarks are protected in Russia, scope of excusive trademark rights protection, peculiarities of assignment and licensing practice in Russia. The course also focuses on issues of trademark infringement, criteria applied by the Russian courts and relevant practice of the Russian Intellectual Property Court. It describes different remedies available to the trademark holders, including calculation of statutory damages under the Russian law for trademark infringement.\n\nRussian trademark legislation and case law do not have long historical roots. This is the reason why this area of the Russian law may be characterized as very dynamic. Examples will be given to illustrate successful legal solutions (for example, trademark protection in domain names, exhaustion of trademark rights) and ongoing search for proper and balanced regulation (for example, regulation of parallel imports, antitrust regulation in trademark law, application of fair use doctrine o trademarks).","tutor":"Vladislav Starzhenetsky","provider":"Coursera","language":"English","skills":["russia","new-moocs-2017"],"subject":"Law","studentsInterested":"34","courseLink":"https://www.coursera.org/learn/russian-trademark-law","classCentralLink":"https://www.class-central.com/course/coursera-russian-trademark-law-in-global-perspective-7776"},{"title":"Mindware: Critical Thinking for the Information Age","about":"Most professions these days require more than general intelligence. They require in addition the ability to collect, analyze and think about data. Personal life is enriched when these same skills are applied to problems in everyday life involving judgment and choice. This course presents basic concepts from statistics, probability, scientific methodology, cognitive psychology and cost-benefit theory and shows how they can be applied to everything from picking one product over another to critiquing media accounts of scientific research. Concepts are defined briefly and breezily and then applied to many examples drawn from business, the media and everyday life.\n\nWhat kinds of things will you learn? Why it’s usually a mistake to interview people for a job. Why it’s highly unlikely that, if your first meal in a new restaurant is excellent, you will find the next meal to be as good. Why economists regularly walk out of movies and leave restaurant food uneaten. Why getting your picture on the cover of Sports Illustrated usually means your next season is going to be a disappointment. Why you might not have a disease even though you’ve tested positive for it. Why you’re never going to know how coffee affects you unless you conduct an experiment in which you flip a coin to determine whether you will have coffee on a given day. Why it might be a mistake to use an office in a building you own as opposed to having your office in someone else’s building. Why you should never keep a stock that’s going down in hopes that it will go back up and prevent you from losing any of your initial investment. Why it is that a great deal of health information presented in the media is misinformation.","tutor":"Richard E. Nisbett","provider":"Coursera","language":"English","skills":["new-moocs-2017"],"subject":"Social Sciences","studentsInterested":"1.1k","courseLink":"https://www.coursera.org/learn/mindware","classCentralLink":"https://www.class-central.com/course/coursera-mindware-critical-thinking-for-the-information-age-8128"},{"title":"Espaço Mundial: Perspectivas França-Brasil","about":"Na perspectiva da França e do Brasil explicam como a globalização reconstitui as políticas públicas e os comportamentos sociais. Nós estudamos os intercâmbios e as interações entre os atores políticos, econômicos e sociais – públicos e privados, individuais e coletivos – e o modo pelo qual redesenham as relações internacionais. Este curso fundamenta-se nas abordagens da sociologia e da história das relações internacionais.","tutor":"Bertrand Badie, Marie-Françoise Durand and Carlos Milani","provider":"Coursera","language":"Portuguese","skills":["new-moocs-2017"],"subject":"Social Sciences","studentsInterested":"2","courseLink":"https://www.coursera.org/learn/espaco-mundial","classCentralLink":"https://www.class-central.com/course/coursera-espaco-mundial-perspectivas-franca-brasil-8414"},{"title":"Positive Psychology: Martin E. P. Seligman’s Visionary Science","about":"Dr. Martin E.P. Seligman—renowned worldwide as the “father of Positive Psychology”—has led visionary leaps in the scientific research, empirical data and personal understandings of human flourishing. This course explores the past, present and future of positive psychology as a journey through the key scientific leaps led by Dr. Seligman and his colleagues at the University of Pennsylvania\u0027s Positive Psychology Center and Master of Applied Positive Psychology program.\n\nThere are no prerequisites.","tutor":"Martin E.P. Seligman, Ph.D.","provider":"Coursera","language":"English","skills":["new-moocs-2017"],"subject":"Psychology","studentsInterested":"493","courseLink":"https://www.coursera.org/learn/positive-psychology-visionary-science","classCentralLink":"https://www.class-central.com/course/coursera-positive-psychology-martin-e-p-seligman-s-visionary-science-8337"},{"title":"Everyday Parenting: The ABCs of Child Rearing","about":"Everyday Parenting gives you access to a toolkit of behavior-change techniques that will make your typical day in the home easier as you develop the behaviors you would like to see in your child. The lessons provide step-by-step instructions and demonstrations to improve your course of action with both children and adolescents. Among many techniques, you will learn how even simple modifications to tone of voice and phrasing can lead to more compliance. The course will also shed light on many parenting misconceptions and ineffective strategies that are routinely used.\n\nThe key to the course is practice. It is not enough to know the strategies; you have to do them to reap the rewards. Using the techniques on a temporary basis will lead to permanent change.\n\nChances are your parenting is perfectly fine and working the way you would like. But if you have any frustrations with your child or would like improve your effectiveness in changing your child’s behavior, these videos will be a very useful guide.\n\nSubtitles available in Chinese and Spanish.","tutor":"Alan E. Kazdin, PhD, ABPP","provider":"Coursera","language":"English","skills":["childhood behavior","parenting","new-moocs-2017"],"subject":"Social Sciences","studentsInterested":"534","courseLink":"https://www.coursera.org/learn/everyday-parenting","classCentralLink":"https://www.class-central.com/course/coursera-everyday-parenting-the-abcs-of-child-rearing-8875"},{"title":"Психология сознания (Psychology of consciousness)","about":"Сознание – самое ценное и самое загадочное достояние человека. Но до сих пор никто не знает, ни что такое сознание, ни как оно возникло, ни что оно делает. Курс представляет психологический взгляд на проблему сознания. Мы рассмотрим, как строятся теоретические гипотезы и как их нужно проверять в экспериментах. Слушателям будет предложен оригинальный подход к проблеме сознания, выводящий природу и законы работы сознания из логики процесса познания. В курсе рассматривается разнообразный круг поражающих воображение феноменов и экспериментальных результатов, которым дается единообразное объяснение. Указан путь, позволяющий приоткрыть завесу многих тайн, окружающих сознание, в том числе путь решения «вечных проблем», над которыми веками бьются мыслители (философы, психологи, физиологи, лингвисты и др.). Первые две лекции вводят слушателя в проблематику психологии сознания и знакомят с историей исследований. Основное содержание курса представлено в виде законов работы сознания, которые позволяют обобщить накопленный исследователями материал. Каждую неделю слушателям будут предложены лекции, демонстрационные материалы, а также задания по пройденному материалу.\n\nПосле прохождения курса вы будете обладать знаниями о психологических проблемах и возможных путях их решения. Получите знание о тех закономерностях, которым подчиняется сознание человека. Познакомитесь с методами исследования сознания, а также приобретёте огромный багаж знаний о экспериментальных феноменах, связанных с изучением сознания.","tutor":"Гершкович Валерия Александровна, Морошкина Надежда Владимировна and Аллахвердов Виктор Михайлович","provider":"Coursera","language":"Russian","skills":["psychology","consciousness","new-moocs-2017"],"subject":"Psychology","studentsInterested":"34","courseLink":"https://www.coursera.org/learn/psikhologiya-soznaniya","classCentralLink":"https://www.class-central.com/course/coursera---psychology-of-consciousness-9342"},{"title":"Введение в гендерную социологию (Introduction to the Sociology of Gender)","about":"Курс «Гендерная социология» ставит цель - изучение гендерной социологии как частной социологической теории.\n\nЗадачи курса:\nАкадемическая: обсуждение гендера как социологической категории, методологии, теории.\nПрактическая: проведение гендерного анализа состояния российского общества.\nПрикладная: проведение гендерной экспертизы политических и социальных процессов.\nИнновационная: изучение мужской и женской гендерных общностей, интегрированных в систему социальных отношений в политической и общественной сферах.\nКомпаративистская: проведение сравнительного анализа гендерных исследований в российской и зарубежной социологии.\n\nОсобенности: Изучаются отличительные черты генезиса, развития и трансформации гендерной модели социума на различных этапах его существования.\n\nОсобое внимание уделяется причинам возникновения гендерного неравенства и дискриминации по признаку пола.","tutor":"Валентина Григорьевна Ушакова","provider":"Coursera","language":"Russian","skills":["gender studies","sociology","new-moocs-2017"],"subject":"Sociology","studentsInterested":"12","courseLink":"https://www.coursera.org/learn/vvedeniye-gendernuyu-sotsiologiyu","classCentralLink":"https://www.class-central.com/course/coursera-----introduction-to-the-sociology-of-gender-9347"},{"title":"Why Do People Migrate? Theories","about":"Move beyond the headlines about migration\nIn the second course in this two-part series, you will learn about different theoretical models that seek to explain why migration starts and why it continues. You will explore migration as a structural feature of our societies and examine individual’s choices to migrate. You will consider the role networks and institutions play in the movement of people. You will also hear from international experts about how migration theories can help us understand cases of labour migration in different world regions.\nThis course is for anyone interested in learning about migration. It would be useful if you had completed the first course in this series Why do People Migrate? Facts.","tutor":"Anna Triandafyllidou","provider":"FutureLearn","language":"English","skills":["history","migration"],"subject":"Social Sciences","studentsInterested":"20","courseLink":"https://www.futurelearn.com/courses/migration-theories","classCentralLink":"https://www.class-central.com/course/futurelearn-why-do-people-migrate-theories-9556"},{"title":"Constitutional Reforms in Russia","about":"The course prepared by one of the best Russian experts in constitutional law will focus on political, economic and cultural dimensions of the Russian constitutional system. Historical background of constitutional reforms and today developments will be discussed, basing on concrete examples of these developments.\n\nThe course will both observe the specific of the Russian constitutional system in comparison to the other constitutional systems and penetrate into the key characteristics of the Russian constitution. Since adoption of the current Russian constitution of 1993 this constitutional system made a great evolution. The course will help to understand what ideas and concepts stand behind the Russian politics, both domestic and international, which principles lie in the basement of the legal framework for cultural, political and economic life of the Russian society. Foreigners and Russians see the Russian constitutional system in the «distorting mirror» of mass media; both of them need professional analysis of how the legal, governmental and economic systems are designed in Russia. The course will present this kind of analysis by a Russian scholar, familiar to contemporary development of constitutionalism in the world, who is able to present the view from inside Russia, but to position the Russian constitutional system in the a wide context of the world constitutionalism.\n\nOn the finishing this course the students will:\n\n1. make analysis of legislative and judicial acts, taken by Russian state authorities in the context of the Russian constitution, its main values and basic principles\n2. to give expert assistance for interaction with the Russian government structures in a wide range of political and economic questions\n\nKnow:\n1. the specific of the Russian constitution, Russian legal, political and economic system\n2. the history of forming and development of the contemporary constitutional system of Russia\n\nHave the capacity to:\n1. better understand of political, economic and legal processes in Russia\n2. make prognosis of the development of the Russian legislation and judicial practice, the reaction of the Russian state bodies to events in the world and to the decisions made by foreign states and international organizations","tutor":"Sergei A. Belov","provider":"Coursera","language":"English","skills":["politics","russia","constitutional law","new-moocs-2017"],"subject":"Political Science","studentsInterested":"24","courseLink":"https://www.coursera.org/learn/constitutional-reforms-in-russia","classCentralLink":"https://www.class-central.com/course/coursera-constitutional-reforms-in-russia-9657"},{"title":"Genomics for Law","about":"Genomics for Law provides a unique framework to review the history and basics of genomics research as well as explore how genomics has, and will continue to, interact with the law.\n\nThroughout this course you will explore the implications of genomics research on law, as well as law\u0027s influence and implications on genomics research, as it pertains to the following topics:\n\n• Genomics and Criminal Law\n• Genomics and Criminal Procedure\n• Forensic Genomics\n• Intellectual Property Protection and Biotechnology\n• GMOs: Policy, Law, and Regulation\n• Genomics and Tort Law\n• Genomics and Privacy Law\n• Legal and Ethical Issues in Genomics\n\nThis course can be taken to fulfill continuing legal education (CLE) credits for practicing lawyers. 9.5 MCLE hours have been approved in Illinois.","tutor":"Gene E. Robinson and Dr. Jennifer K. Robbennolt","provider":"Coursera","language":"English","skills":["law","ethics","genomics","research"],"subject":"Law","studentsInterested":"43","courseLink":"https://www.coursera.org/learn/genomics-for-law","classCentralLink":"https://www.class-central.com/course/coursera-genomics-for-law-11055"},{"title":"The American South: Its Stories, Music, and Art","about":"From small farms to urban neighborhoods, from the region itself to the more distant worlds of the southern diaspora, we discover the stories, music, and art of the American South.","tutor":"William Ferris","provider":"Coursera","language":"English","skills":["america","literature","music","film","usa","north america"],"subject":"Anthropology","studentsInterested":"577","courseLink":"https://www.coursera.org/learn/the-south","classCentralLink":"https://www.class-central.com/course/coursera-the-american-south-its-stories-music-and-art-2385"},{"title":"Representaciones culturales de las sexualidades","about":"¿Queer? ¿Género? ¿transgénero?\nDesde los estudios de género, los estudios queer y los estudios culturales, este curso quiere familiarizaros con las representaciones culturales de las sexualidades no normativas en la cultura contemporánea.\nPlanteamos diversos marcos teóricos y ejemplos prácticos a partir de los cuales reflexionar sobre las construcciones corporales e identitarias de las personas lesbianas, gays, transgénero, transexuales, queer, heterosexuales, etc. en diversos soportes culturales como el cine, la literatura, internet, la televisión o las artes plásticas.\nDe este modo, queremos contribuir al análisis de los discursos normativos sobre el género y la sexualidad que nos construyen como sujetos y nos proporcionan posiciones jerárquicas dentro del marco social.\nEntendemos que las representaciones culturales son espacios privilegiados para llevar a cabo este análisis, porque en ellos se materializan tanto los discursos hegemónicos como sus posibilidades de subversión.\nSi estás interesado en la cultura, el género y la sexualidad, te invitamos a descubrir este curso. No necesitas conocimientos previos. Si ya estás familiarizad@ con la temática, queremos ofrecer contenidos sugestivos sin descuidar las reflexiones y explicaciones necesarias para aquellos que os adentráis en ella por primera vez.","tutor":"Meri Torras Francès, Aina Pérez Fontdevila, Noemí Acedo Alonso and Teresa López-Pellisa","provider":"Coursera","language":"Spanish","skills":["culture","gender studies","spain","europe"],"subject":"Sociology","studentsInterested":"38","courseLink":"https://www.coursera.org/learn/representaciones-culturales","classCentralLink":"https://www.class-central.com/course/coursera-representaciones-culturales-de-las-sexualidades-1969"}]